---------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\Mark\OneDrive\PhD Project\OpenSAFELY NEIAA\inflammatory_rheum/logs/cleaning_dataset.log
  log type:  text
 opened on:  21 May 2025, 20:25:29

. 
. di "$projectdir"
C:\Users\Mark\OneDrive\PhD Project\OpenSAFELY NEIAA\inflammatory_rheum

. di "$logdir"
C:\Users\Mark\OneDrive\PhD Project\OpenSAFELY NEIAA\inflammatory_rheum/logs

. 
. import delimited "$projectdir/output/dataset.csv", clear
(encoding automatically selected: ISO-8859-1)
(88 vars, 1,958 obs)

. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "C:\Program Files\Stata18\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata18\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\Users\Mark\ado\personal/"
  [5]  (PLUS)      "C:\Users\Mark\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "C:\Users\Mark\OneDrive\PhD Project\OpenSAFELY NEIAA\inflammatory_rheum/analysis/extra_ados"

. 
. **Set index dates ===========================================================*/
. global year_preceding = "01/04/2015"

. global start_date = "01/04/2016" //for outpatient analyses, data may only be available from April 2019

. global end_date = "31/03/2025"

. global base_year = year(date("$start_date", "DMY"))

. global end_year = year(date("$end_date", "DMY"))

. global max_year = $end_year - $base_year

. 
. **Conversion for dates====================================================*
. 
. ***Variables ending in _date that are string
. ds *_date, has(type string)
eia_code_d~e  ild_before~e  depr_befor~e  copd_after~e  osteop_aft~e  rheum~f_date  ~erheum_date  sulfasalaz~e  rtt_op_end~e
ra_code_date  copd_befor~e  osteop_bef~e  cva_after_~e  frac_after~e  rheum~y_date  l~ecode_date  hydroxychl~e
psa_code_d~e  cva_before~e  frac_befor~e  lung_ca_af~e  dem_after_~e  rheum~2_date  ~frheum_date  rtt_cl_sta~e
anksp_code~e  lung_ca_be~e  dem_before~e  solid_ca_a~e  creatinin~te  rheum~3_date  l~fcode_date  rtt_cl_ref~e
undiff_cod~e  solid_ca_b~e  chd_after_~e  haem_ca_af~e  rf_date       rheum~4_date  leflunomid~e  rtt_cl_end~e
chd_before~e  haem_ca_be~e  dm_after_d~e  ckd_after_~e  bmi_date      r~eappt_date  metho~e_date  rtt_op_sta~e
dm_before_~e  ckd_before~e  ild_after_~e  depr_after~e  r~_appt_date  rheum~e_date  metho~j_date  rtt_op_ref~e

. local string_dates `r(varlist)'

. foreach var of local string_dates {
  2.     gen `var'_num = date(`var', "YMD")
  3.     format `var'_num %td
  4.     order `var'_num, after(`var')
  5.     drop `var'
  6.     rename `var'_num `var'
  7. }
(325 missing values generated)
(1,753 missing values generated)
(1,822 missing values generated)
(1,922 missing values generated)
(1,708 missing values generated)
(1,839 missing values generated)
(1,758 missing values generated)
(1,917 missing values generated)
(1,740 missing values generated)
(1,689 missing values generated)
(403 missing values generated)
(1,363 missing values generated)
(1,706 missing values generated)
(1,868 missing values generated)
(1,931 missing values generated)
(1,957 missing values generated)
(1,722 missing values generated)
(1,654 missing values generated)
(1,817 missing values generated)
(1,735 missing values generated)
(1,899 missing values generated)
(1,690 missing values generated)
(1,633 missing values generated)
(219 missing values generated)
(1,275 missing values generated)
(1,602 missing values generated)
(1,858 missing values generated)
(1,920 missing values generated)
(1,956 missing values generated)
(1,659 missing values generated)
(1,948 missing values generated)
(1,948 missing values generated)
(1,957 missing values generated)
(1,315 missing values generated)
(1,315 missing values generated)
(766 missing values generated)
(949 missing values generated)
(650 missing values generated)
(398 missing values generated)
(1,952 missing values generated)
(1,938 missing values generated)
(1,600 missing values generated)
(851 missing values generated)
(1,957 missing values generated)
(1,951 missing values generated)
(1,120 missing values generated)
(504 missing values generated)
(329 missing values generated)
(969 missing values generated)
(711 missing values generated)
(774 missing values generated)
(774 missing values generated)
(774 missing values generated)
(766 missing values generated)
(766 missing values generated)
(766 missing values generated)

. 
. ***Variables ending in _date that are numeric
. foreach var of varlist *_date {
  2.     capture confirm string variable `var'
  3.     if _rc != 0 {
  4.         format `var' %td
  5.     }
  6. }

. 
. ***Create binary indicator for each
. ds *_date
eia_code_d~e  ild_before~e  depr_befor~e  copd_after~e  osteop_aft~e  rheum~f_date  ~erheum_date  sulfasalaz~e  rtt_op_end~e
ra_code_date  copd_befor~e  osteop_bef~e  cva_after_~e  frac_after~e  rheum~y_date  l~ecode_date  hydroxychl~e
psa_code_d~e  cva_before~e  frac_befor~e  lung_ca_af~e  dem_after_~e  rheum~2_date  ~frheum_date  rtt_cl_sta~e
anksp_code~e  lung_ca_be~e  dem_before~e  solid_ca_a~e  creatinin~te  rheum~3_date  l~fcode_date  rtt_cl_ref~e
undiff_cod~e  solid_ca_b~e  chd_after_~e  haem_ca_af~e  rf_date       rheum~4_date  leflunomid~e  rtt_cl_end~e
chd_before~e  haem_ca_be~e  dm_after_d~e  ckd_after_~e  bmi_date      r~eappt_date  metho~e_date  rtt_op_sta~e
dm_before_~e  ckd_before~e  ild_after_~e  depr_after~e  r~_appt_date  rheum~e_date  metho~j_date  rtt_op_ref~e

. local dates `r(varlist)'

. foreach var of local dates {
  2.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5. }

. 
. /*
> **Will also need to amend conversion for biologic dates ====================================================*
> ***Some dates are given with month/year only, so adding day 15 to enable them to be processed as dates 
> 
> foreach var of varlist   abatacept_date                                         ///
>                                                  adalimumab_date                                        ///     
>                                                  baricitinib_date                                       ///
>                                                  certolizumab_date                                      ///
>                                                  etanercept_date                                        ///
>                                                  golimumab_date                                         ///
>                                                  guselkumab_date                                        ///     
>                                                  infliximab_date                                        ///
>                                                  ixekizumab_date                                        ///
>                                                  methotrexate_hcd_date                          ///
>                                                  rituximab_date                                         ///
>                                                  sarilumab_date                                         ///
>                                                  secukinumab_date                                       ///     
>                                                  tocilizumab_date                                       ///
>                                                  tofacitinib_date                                       ///
>                                                  upadacitinib_date                                      ///
>                                                  ustekinumab_date                                       ///
>                                                  {
>                                                         
>                 capture confirm string variable `var'
>                 if _rc!=0 {
>                         assert `var'==.
>                         rename `var' `var'_date
>                 }
>         
>                 else {
>                                 replace `var' = `var' + "-15"
>                                 rename `var' `var'_dstr
>                                 replace `var'_dstr = " " if `var'_dstr == "-15"
>                                 gen `var'_date = date(`var'_dstr, "YMD") 
>                                 order `var'_date, after(`var'_dstr)
>                                 drop `var'_dstr
>                 }
>         
>         format `var'_date %td
> }
> */
.                                          
. **Create and label variables ===========================================================*/
. 
. ***Age variables
. *Create categorised age
. drop if age<18 & age !=.
(0 observations deleted)

. drop if age>109 & age !=.
(0 observations deleted)

. drop if age==.
(0 observations deleted)

. lab var age "Age at diagnosis"

. 
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
(1,958 differences between age and agegroup)

. 
. label define agegroup   1 "18-39" ///
>                                                 2 "40-49" ///
>                                                 3 "50-59" ///
>                                                 4 "60-69" ///
>                                                 5 "70-79" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. lab var agegroup "Age group"

. tab agegroup, missing

  Age group |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-39 |        832       42.49       42.49
      40-49 |        283       14.45       56.95
      50-59 |        282       14.40       71.35
      60-69 |        198       10.11       81.46
      70-79 |        150        7.66       89.12
        80+ |        213       10.88      100.00
------------+-----------------------------------
      Total |      1,958      100.00

. order agegroup, after(age)

. 
. ***Sex
. gen male = 1 if sex == "male"
(986 missing values generated)

. replace male = 0 if sex == "female"
(986 real changes made)

. lab var male "Male"

. lab define male 0 "No" 1 "Yes", modify

. lab val male male

. tab male, missing

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        986       50.36       50.36
        Yes |        972       49.64      100.00
------------+-----------------------------------
      Total |      1,958      100.00

. order male, after(sex)

. 
. ***Ethnicity
. gen ethnicity_n = 1 if ethnicity == "White"
(1,762 missing values generated)

. replace ethnicity_n = 2 if ethnicity == "Asian or Asian British"
(123 real changes made)

. replace ethnicity_n = 3 if ethnicity == "Black or Black British"
(135 real changes made)

. replace ethnicity_n = 4 if ethnicity == "Mixed"
(94 real changes made)

. replace ethnicity_n = 5 if ethnicity == "Chinese or Other Ethnic Groups"
(209 real changes made)

. replace ethnicity_n = 6 if ethnicity == "Unknown"
(1,201 real changes made)

. 
. 
. label define ethnicity_n        1 "White"                                               ///
>                                                         2 "Asian or Asian British"              ///
>                                                         3 "Black or Black British"      ///
>                                                         4 "Mixed"                                               ///
>                                                         5 "Chinese or Other Ethnic Groups" ///
>                                                         6 "Not known", modify

.                                                         
. label values ethnicity_n ethnicity_n

. lab var ethnicity_n "Ethnicity"

. tab ethnicity_n, missing

                     Ethnicity |      Freq.     Percent        Cum.
-------------------------------+-----------------------------------
                         White |        196       10.01       10.01
        Asian or Asian British |        123        6.28       16.29
        Black or Black British |        135        6.89       23.19
                         Mixed |         94        4.80       27.99
Chinese or Other Ethnic Groups |        209       10.67       38.66
                     Not known |      1,201       61.34      100.00
-------------------------------+-----------------------------------
                         Total |      1,958      100.00

. drop ethnicity

. rename ethnicity_n ethnicity 

. 
. ***Practice regions
. encode region, gen(nuts_region)

. tab region, missing

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |        214       10.93       10.93
           East Midlands |        202       10.32       21.25
                  London |        204       10.42       31.66
              North East |        228       11.64       43.31
              North West |        213       10.88       54.19
              South East |        214       10.93       65.12
              South West |        223       11.39       76.51
           West Midlands |        221       11.29       87.79
Yorkshire and The Humber |        239       12.21      100.00
-------------------------+-----------------------------------
                   Total |      1,958      100.00

. replace region="Not known" if region==""
(0 real changes made)

. gen region_nospace=region

. replace region_nospace="SouthWest" if region=="South West"
(223 real changes made)

. replace region_nospace="EastMidlands" if region=="East Midlands"
(202 real changes made)

. replace region_nospace="East" if region=="East"
(0 real changes made)

. replace region_nospace="London" if region=="London"
(0 real changes made)

. replace region_nospace="NorthEast" if region=="North East"
(228 real changes made)

. replace region_nospace="NorthWest" if region=="North West"
(213 real changes made)

. replace region_nospace="SouthEast" if region=="South East"
(214 real changes made)

. replace region_nospace="WestMidlands" if region=="West Midlands"
(221 real changes made)

. replace region_nospace="YorkshireandTheHumber" if region=="Yorkshire and The Humber"
(239 real changes made)

. 
. ***IMD
. gen imd = 1 if imd_quintile == "1 (most deprived)"
(1,582 missing values generated)

. replace imd = 2 if imd_quintile == "2"
(384 real changes made)

. replace imd = 3 if imd_quintile == "3"
(352 real changes made)

. replace imd = 4 if imd_quintile == "4"
(362 real changes made)

. replace imd = 5 if imd_quintile == "5 (least deprived)"
(369 real changes made)

. replace imd = .u if imd_quintile == "Unknown"
(115 real changes made, 115 to missing)

. lab var imd "Index of multiple deprivation"

. lab define imd 1 "1 (most deprived)" ///
>                            2 "2" ///
>                            3 "3" ///
>                            4 "4" ///
>                            5 "5 (least deprived)" ///
>                            .u "Not known"

. lab val imd imd                    

. tab imd, missing

 Index of multiple |
       deprivation |      Freq.     Percent        Cum.
-------------------+-----------------------------------
 1 (most deprived) |        376       19.20       19.20
                 2 |        384       19.61       38.82
                 3 |        352       17.98       56.79
                 4 |        362       18.49       75.28
5 (least deprived) |        369       18.85       94.13
         Not known |        115        5.87      100.00
-------------------+-----------------------------------
             Total |      1,958      100.00

. drop imd_quintile

. 
. ***Body Mass Index
. *Recode strange values 
. replace bmi_value = . if bmi_value == 0 
(0 real changes made)

. replace bmi_value = . if !inrange(bmi_value, 10, 80)
(0 real changes made)

. 
. *Restrict to within 10 years of EIA diagnosis date and aged>16 
. gen bmi_time = (eia_code_date - bmi_date)/365.25
(1,957 missing values generated)

. gen bmi_age = age - bmi_time
(1,957 missing values generated)

. replace bmi_value = . if bmi_age < 16 
(0 real changes made)

. replace bmi_value = . if bmi_time > 10 & bmi_time != . 
(0 real changes made)

. 
. *Set to missing if no date, and vice versa 
. replace bmi_value = . if bmi_date == . 
(0 real changes made)

. replace bmi_date = . if bmi_value == . 
(0 real changes made)

. replace bmi_time = . if bmi_value == . 
(0 real changes made)

. replace bmi_age = . if bmi_value == . 
(0 real changes made)

. 
. *Create BMI categories
. gen     bmicat = .
(1,958 missing values generated)

. recode  bmicat . = 1 if bmi_value < 18.5
(0 changes made to bmicat)

. recode  bmicat . = 2 if bmi_value < 25
(1 changes made to bmicat)

. recode  bmicat . = 3 if bmi_value < 30
(0 changes made to bmicat)

. recode  bmicat . = 4 if bmi_value < 35
(0 changes made to bmicat)

. recode  bmicat . = 5 if bmi_value < 40
(0 changes made to bmicat)

. recode  bmicat . = 6 if bmi_value < .
(0 changes made to bmicat)

. replace bmicat = .u if bmi_value >= .
(1,957 real changes made, 1,957 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                     ///
>                                         .u "Not known"

.                                         
. label values bmicat bmicat

. lab var bmicat "BMI"

. tab bmicat, missing

                 BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  Normal (18.5-24.9) |          1        0.05        0.05
           Not known |      1,957       99.95      100.00
---------------------+-----------------------------------
               Total |      1,958      100.00

. order bmicat, after (bmi_value)

. drop bmi_age bmi_time

. 
. *Create less granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
(1,958 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"           ///
>                                                 3 "Obese II (35-39.9)"          ///
>                                                 4 "Obese III (40+)"             

. 
. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. ***Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Not known"

. 
. gen     smoke = 1  if smoking_status == "N"
(1,929 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(760 real changes made)

. replace smoke = 3  if smoking_status == "S"
(1,165 real changes made)

. replace smoke = .u if smoking_status == "M"
(4 real changes made, 4 to missing)

. replace smoke = .u if smoking_status == "" 
(0 real changes made)

. 
. label values smoke smoke

. lab var smoke "Smoking status"

. drop smoking_status

. tab smoke, missing

    Smoking |
     status |      Freq.     Percent        Cum.
------------+-----------------------------------
      Never |         29        1.48        1.48
     Former |        760       38.82       40.30
    Current |      1,165       59.50       99.80
  Not known |          4        0.20      100.00
------------+-----------------------------------
      Total |      1,958      100.00

. 
. *Create non-missing 3-category variable for current smoking (assumes missing smoking is never smoking)
. recode smoke .u = 1, gen(smoke_nomiss)
(4 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. **Clinical comorbidities
. ***Nb. not using creatinine of HBA1c values for now, just codes
. foreach disease in ckd dm ild copd cva lung_ca solid_ca haem_ca depr osteop frac dem chd {
  2.         label define `disease'_before 0 "No" 1 "Yes"
  3.         label values `disease'_before `disease'_before
  4.         tab `disease'_before, missing
  5.         label define `disease'_after 0 "No" 1 "Yes"
  6.         label values `disease'_after `disease'_after
  7.         tab `disease'_after, missing
  8.         gen `disease'_new = 1 if (`disease'_after == 1 & `disease'_before == 0)
  9.         recode `disease'_new .=0
 10.         label define `disease'_new 0 "No" 1 "Yes"
 11.         label values `disease'_new `disease'_new
 12.         tab `disease'_new, missing
 13.         order `disease'_new, after(`disease'_after)
 14. }

 ckd_before |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,706       87.13       87.13
        Yes |        252       12.87      100.00
------------+-----------------------------------
      Total |      1,958      100.00

  ckd_after |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,602       81.82       81.82
        Yes |        356       18.18      100.00
------------+-----------------------------------
      Total |      1,958      100.00
(1,642 missing values generated)
(1,642 changes made to ckd_new)

    ckd_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,642       83.86       83.86
        Yes |        316       16.14      100.00
------------+-----------------------------------
      Total |      1,958      100.00

  dm_before |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,839       93.92       93.92
        Yes |        119        6.08      100.00
------------+-----------------------------------
      Total |      1,958      100.00

   dm_after |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,817       92.80       92.80
        Yes |        141        7.20      100.00
------------+-----------------------------------
      Total |      1,958      100.00
(1,822 missing values generated)
(1,822 changes made to dm_new)

     dm_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,822       93.05       93.05
        Yes |        136        6.95      100.00
------------+-----------------------------------
      Total |      1,958      100.00

 ild_before |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,758       89.79       89.79
        Yes |        200       10.21      100.00
------------+-----------------------------------
      Total |      1,958      100.00

  ild_after |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,735       88.61       88.61
        Yes |        223       11.39      100.00
------------+-----------------------------------
      Total |      1,958      100.00
(1,752 missing values generated)
(1,752 changes made to ild_new)

    ild_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,752       89.48       89.48
        Yes |        206       10.52      100.00
------------+-----------------------------------
      Total |      1,958      100.00

copd_before |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,917       97.91       97.91
        Yes |         41        2.09      100.00
------------+-----------------------------------
      Total |      1,958      100.00

 copd_after |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,899       96.99       96.99
        Yes |         59        3.01      100.00
------------+-----------------------------------
      Total |      1,958      100.00
(1,899 missing values generated)
(1,899 changes made to copd_new)

   copd_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,899       96.99       96.99
        Yes |         59        3.01      100.00
------------+-----------------------------------
      Total |      1,958      100.00

 cva_before |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,740       88.87       88.87
        Yes |        218       11.13      100.00
------------+-----------------------------------
      Total |      1,958      100.00

  cva_after |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,690       86.31       86.31
        Yes |        268       13.69      100.00
------------+-----------------------------------
      Total |      1,958      100.00
(1,718 missing values generated)
(1,718 changes made to cva_new)

    cva_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,718       87.74       87.74
        Yes |        240       12.26      100.00
------------+-----------------------------------
      Total |      1,958      100.00

lung_ca_bef |
        ore |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,689       86.26       86.26
        Yes |        269       13.74      100.00
------------+-----------------------------------
      Total |      1,958      100.00

lung_ca_aft |
         er |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,633       83.40       83.40
        Yes |        325       16.60      100.00
------------+-----------------------------------
      Total |      1,958      100.00
(1,663 missing values generated)
(1,663 changes made to lung_ca_new)

lung_ca_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,663       84.93       84.93
        Yes |        295       15.07      100.00
------------+-----------------------------------
      Total |      1,958      100.00

solid_ca_be |
       fore |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        403       20.58       20.58
        Yes |      1,555       79.42      100.00
------------+-----------------------------------
      Total |      1,958      100.00

solid_ca_af |
        ter |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        219       11.18       11.18
        Yes |      1,739       88.82      100.00
------------+-----------------------------------
      Total |      1,958      100.00
(1,597 missing values generated)
(1,597 changes made to solid_ca_new)

solid_ca_ne |
          w |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,597       81.56       81.56
        Yes |        361       18.44      100.00
------------+-----------------------------------
      Total |      1,958      100.00

haem_ca_bef |
        ore |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,363       69.61       69.61
        Yes |        595       30.39      100.00
------------+-----------------------------------
      Total |      1,958      100.00

haem_ca_aft |
         er |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,275       65.12       65.12
        Yes |        683       34.88      100.00
------------+-----------------------------------
      Total |      1,958      100.00
(1,459 missing values generated)
(1,459 changes made to haem_ca_new)

haem_ca_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,459       74.51       74.51
        Yes |        499       25.49      100.00
------------+-----------------------------------
      Total |      1,958      100.00

depr_before |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,868       95.40       95.40
        Yes |         90        4.60      100.00
------------+-----------------------------------
      Total |      1,958      100.00

 depr_after |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,858       94.89       94.89
        Yes |        100        5.11      100.00
------------+-----------------------------------
      Total |      1,958      100.00
(1,866 missing values generated)
(1,866 changes made to depr_new)

   depr_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,866       95.30       95.30
        Yes |         92        4.70      100.00
------------+-----------------------------------
      Total |      1,958      100.00

osteop_befo |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,931       98.62       98.62
        Yes |         27        1.38      100.00
------------+-----------------------------------
      Total |      1,958      100.00

osteop_afte |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,920       98.06       98.06
        Yes |         38        1.94      100.00
------------+-----------------------------------
      Total |      1,958      100.00
(1,920 missing values generated)
(1,920 changes made to osteop_new)

 osteop_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,920       98.06       98.06
        Yes |         38        1.94      100.00
------------+-----------------------------------
      Total |      1,958      100.00

frac_before |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,957       99.95       99.95
        Yes |          1        0.05      100.00
------------+-----------------------------------
      Total |      1,958      100.00

 frac_after |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,956       99.90       99.90
        Yes |          2        0.10      100.00
------------+-----------------------------------
      Total |      1,958      100.00
(1,956 missing values generated)
(1,956 changes made to frac_new)

   frac_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,956       99.90       99.90
        Yes |          2        0.10      100.00
------------+-----------------------------------
      Total |      1,958      100.00

 dem_before |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,722       87.95       87.95
        Yes |        236       12.05      100.00
------------+-----------------------------------
      Total |      1,958      100.00

  dem_after |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,659       84.73       84.73
        Yes |        299       15.27      100.00
------------+-----------------------------------
      Total |      1,958      100.00
(1,689 missing values generated)
(1,689 changes made to dem_new)

    dem_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,689       86.26       86.26
        Yes |        269       13.74      100.00
------------+-----------------------------------
      Total |      1,958      100.00

 chd_before |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,708       87.23       87.23
        Yes |        250       12.77      100.00
------------+-----------------------------------
      Total |      1,958      100.00

  chd_after |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,654       84.47       84.47
        Yes |        304       15.53      100.00
------------+-----------------------------------
      Total |      1,958      100.00
(1,685 missing values generated)
(1,685 changes made to chd_new)

    chd_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,685       86.06       86.06
        Yes |        273       13.94      100.00
------------+-----------------------------------
      Total |      1,958      100.00

. 
. lab var ckd_before "Chronic kidney disease"

. lab var ckd_after "Chronic kidney disease"

. lab var ckd_new "Chronic kidney disease"

. lab var dm_before "Type 2 diabetes mellitus"

. lab var dm_after "Type 2 diabetes mellitus"

. lab var dm_new "Type 2 diabetes mellitus"

. lab var ild_before "Interstitial lung disease"

. lab var ild_after "Interstitial lung disease"

. lab var ild_new "Interstitial lung disease"

. lab var copd_before "COPD"

. lab var copd_after "COPD"

. lab var copd_new "COPD"

. lab var lung_ca_before "Lung cancer"

. lab var lung_ca_after "Lung cancer"

. lab var lung_ca_new "Lung cancer"

. lab var solid_ca_before "Solid organ cancer"

. lab var solid_ca_after "Solid organ cancer"

. lab var solid_ca_new "Solid organ cancer"

. lab var haem_ca_before "Haematological cancer"

. lab var haem_ca_after "Haematological cancer"

. lab var haem_ca_new "Haematological cancer"

. lab var depr_before "Depression"

. lab var depr_after "Depression"

. lab var depr_new "Depression"

. lab var osteop_before "Osteoporosis"

. lab var osteop_after "Osteoporosis"

. lab var osteop_new "Osteoporosis"

. lab var frac_before "Fragility fracture"

. lab var frac_after "Fragility fracture"

. lab var frac_new "Fragility fracture"

. lab var dem_before "Dementia"

. lab var dem_after "Dementia"

. lab var dem_new "Dementia"

. lab var chd_before "Coronary heart disease"

. lab var chd_after "Coronary heart disease"

. lab var chd_new "Coronary heart disease"

. 
. lab var rheum_appt "Rheumatology appointment"

. lab define rheum_appt 0 "No" 1 "Yes", modify

. lab val rheum_appt rheum_appt

. 
. **All patients should have diagnostic code=============================================================*/
. tab eia_code, missing

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,958      100.00      100.00
------------+-----------------------------------
      Total |      1,958      100.00

. keep if eia_code==1
(0 observations deleted)

. 
. **Check first rheum appt date was before diagnostic code date==================================*/
. 
. tab rheum_appt, missing //proportion of patients with an rheum outpatient date (with first attendance option selected) in the 1
> 2 months before EIA code appeared in GP record; data only April 2019 onwards

Rheumatolog |
          y |
appointment |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,315       67.16       67.16
        Yes |        643       32.84      100.00
------------+-----------------------------------
      Total |      1,958      100.00

. tab rheum_appt if rheum_appt_date>eia_code_date & rheum_appt_date!=. //confirm proportion who had first rheum appt (i.e. not mi
> ssing) after EIA code

Rheumatolog |
          y |
appointment |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         94      100.00      100.00
------------+-----------------------------------
      Total |         94      100.00

. tab rheum_appt if rheum_appt_date>(eia_code_date + 30) & rheum_appt_date!=. //confirm proportion who had first rheum appt 30 da
> ys after EIA code 

Rheumatolog |
          y |
appointment |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         53      100.00      100.00
------------+-----------------------------------
      Total |         53      100.00

. tab rheum_appt if rheum_appt_date>(eia_code_date + 60) & rheum_appt_date!=. //confirm proportion who had first rheum appt 60 da
> ys after EIA code - should be none
no observations

. replace rheum_appt=0 if rheum_appt_date>(eia_code_date + 60) & rheum_appt_date!=. //replace as missing if first appt >60 days a
> fter EIA code - should be none
(0 real changes made)

. replace rheum_appt_date=. if rheum_appt_date>(eia_code_date + 60) & rheum_appt_date!=. //replace as missing if first appt >60 d
> ays after EIA code - should be none
(0 real changes made)

. 
. **As above - for differently specified rheumatology appointments
. replace rheum_appt_any=0 if rheum_appt_any_date>(eia_code_date + 60) & rheum_appt_any_date!=. //replace as missing those appts 
> >60 days after EIA code
(0 real changes made)

. replace rheum_appt_any_date=. if rheum_appt_any_date>(eia_code_date + 60) & rheum_appt_any_date!=. //replace as missing those a
> ppts >60 days after EIA code
(0 real changes made)

. replace rheum_appt2=0 if rheum_appt2_date>(eia_code_date + 60) & rheum_appt2_date!=. //replace as missing those appts >60 days 
> after EIA code
(0 real changes made)

. replace rheum_appt2_date=. if rheum_appt2_date>(eia_code_date + 60) & rheum_appt2_date!=. //replace as missing those appts >60 
> days after EIA code_yea
(0 real changes made)

. replace rheum_appt3=0 if rheum_appt3_date>(eia_code_date + 60) & rheum_appt3_date!=. //replace as missing those appts >60 days 
> after EIA code
(0 real changes made)

. replace rheum_appt3_date=. if rheum_appt3_date>(eia_code_date + 60) & rheum_appt3_date!=. //replace as missing those appts >60 
> days after EIA code
(0 real changes made)

. replace rheum_appt4=0 if rheum_appt4_date>(eia_code_date + 60) & rheum_appt4_date!=. //replace as missing those appts >60 days 
> after EIA code - THIS IS AN IMPORTANT ONE TO CHECK
(252 real changes made)

. replace rheum_appt4_date=. if rheum_appt4_date>(eia_code_date + 60) & rheum_appt4_date!=. //replace as missing those appts >60 
> days after EIA code
(252 real changes made, 252 to missing)

. 
. *Check if first csDMARD/biologic was after rheum appt date=====================================================*/
. **csDMARDs (not including high cost MTX; wouldn't be shared care)
. gen csdmard=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | methotrexate_inj==1 | sulfasalazine==1
(124 missing values generated)

. recode csdmard .=0 
(124 changes made to csdmard)

. tab csdmard, missing

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        124        6.33        6.33
          1 |      1,834       93.67      100.00
------------+-----------------------------------
      Total |      1,958      100.00

. 
. **Date of first csDMARD script (not including high cost MTX prescriptions)
. gen csdmard_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_date, methotrexate_inj_date, sulfasalazine_date)
(124 missing values generated)

. format %td csdmard_date

. 
. /*
> **csDMARDs (including high cost MTX)
> gen csdmard_hcd=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd==1 | sul
> fasalazine==1
> recode csdmard_hcd .=0 
> tab csdmard_hcd, missing
> 
> **Date of first csDMARD script (including high cost MTX prescriptions)
> gen csdmard_hcd_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_date, methotrexate_inj_date, methotrexate_hcd_
> date, sulfasalazine_date)
> format %td csdmard_hcd_date
> 
> **Biologic use
> gen biologic=1 if abatacept==1 | adalimumab==1 | baricitinib==1 | certolizumab==1 | etanercept==1 | golimumab==1 | guselkumab==
> 1 | infliximab==1 | ixekizumab==1 | rituximab==1 | sarilumab==1 | secukinumab==1 | tocilizumab==1 | tofacitinib==1 | upadacitin
> ib==1 | ustekinumab==1 
> recode biologic .=0
> tab biologic, missing
> 
> **Date of first biologic script
> gen biologic_date=min(abatacept_date, adalimumab_date, baricitinib_date, certolizumab_date, etanercept_date, golimumab_date, gu
> selkumab_date, infliximab_date, ixekizumab_date, rituximab_date, sarilumab_date, secukinumab_date, tocilizumab_date, tofacitini
> b_date, upadacitinib_date, ustekinumab_date)
> format %td biologic_date
> */
. 
. **Exclude if first csdmard was more than 60 days before first rheum appt
. tab csdmard if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt_date

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        541      100.00      100.00
------------+-----------------------------------
      Total |        541      100.00

. tab csdmard if rheum_appt_date!=. & csdmard_date!=. & (csdmard_date + 60)<rheum_appt_date 

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        522      100.00      100.00
------------+-----------------------------------
      Total |        522      100.00

. drop if rheum_appt_date!=. & csdmard_date!=. & (csdmard_date + 60)<rheum_appt_date //drop if first csDMARD more than 60 days be
> fore first attendance at a rheum appt 
(522 observations deleted)

. tab csdmard if rheum_appt_date==. & rheum_appt_any_date!=. & csdmard_date!=. & (csdmard_date + 60)<rheum_appt_any_date

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        395      100.00      100.00
------------+-----------------------------------
      Total |        395      100.00

. drop if rheum_appt_date==. & rheum_appt_any_date!=. & csdmard_date!=. & (csdmard_date + 60)<rheum_appt_any_date //drop if first
>  csDMARD more than 60 days before first captured rheum appt that did not have first attendance tag
(395 observations deleted)

. 
. /*
> tab biologic if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_appt_date 
> tab biologic if rheum_appt_date!=. & biologic_date!=. & (biologic_date + 60)<rheum_appt_date 
> drop if rheum_appt_date!=. & biologic_date!=. & (biologic_date + 60)<rheum_appt_date //drop if first biologic more than 60 days
>  before first rheum_appt_date
> tab biologic if rheum_appt_date==. & rheum_appt_any_date!=. & biologic_date!=. & (biologic_date + 60)<rheum_appt_any_date
> drop if rheum_appt_date==. & rheum_appt_any_date!=. & biologic_date!=. & (biologic_date + 60)<rheum_appt_any_date //drop if fir
> st biologic more than 60 days before first captured rheum appt that did not have first attendance tag
> */
. 
. *Generate diagnosis date===============================================================*/
. 
. **Use diagnostic code date (in GP record) as diagnosis date
. gen diagnosis_date=eia_code_date

. format diagnosis_date %td

. 
. *Refine diagnostic window=============================================================*/
. 
. **Keep patients with diagnosis date after start date and before end date - should be none dropped
. keep if diagnosis_date>=date("$start_date", "DMY") & diagnosis_date!=. 
(0 observations deleted)

. tab eia_code, missing

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,041      100.00      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. keep if diagnosis_date<=date("$end_date", "DMY") & diagnosis_date!=. 
(0 observations deleted)

. tab eia_code, missing

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,041      100.00      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. 
. *Include only most recent EIA sub-diagnosis=============================================*/
. replace ra_code =0 if psa_code_date > ra_code_date & psa_code_date !=.
(9 real changes made)

. replace ra_code =0 if anksp_code_date > ra_code_date & anksp_code_date !=.
(7 real changes made)

. replace ra_code =0 if undiff_code_date > ra_code_date & undiff_code_date !=.
(2 real changes made)

. replace psa_code =0 if ra_code_date >= psa_code_date & ra_code_date !=.
(8 real changes made)

. replace psa_code =0 if anksp_code_date > psa_code_date & anksp_code_date !=.
(0 real changes made)

. replace psa_code =0 if undiff_code_date > psa_code_date & undiff_code_date !=.
(0 real changes made)

. replace anksp_code =0 if psa_code_date >= anksp_code_date & psa_code_date !=.
(1 real change made)

. replace anksp_code =0 if ra_code_date >= anksp_code_date & ra_code_date !=.
(7 real changes made)

. replace anksp_code =0 if undiff_code_date > anksp_code_date & undiff_code_date !=.
(0 real changes made)

. replace undiff_code =0 if ra_code_date >= undiff_code_date & ra_code_date !=.
(0 real changes made)

. replace undiff_code =0 if psa_code_date >= undiff_code_date & psa_code_date !=.
(1 real change made)

. replace undiff_code =0 if anksp_code_date >= undiff_code_date & anksp_code_date !=.
(0 real changes made)

. gen eia_diagnosis=1 if ra_code==1
(198 missing values generated)

. replace eia_diagnosis=2 if psa_code==1
(110 real changes made)

. replace eia_diagnosis=3 if anksp_code==1
(72 real changes made)

. replace eia_diagnosis=4 if undiff_code==1
(16 real changes made)

. lab define eia_diagnosis 1 "RA" 2 "PsA" 3 "AxSpA" 4 "Undiff IA", modify

. lab val eia_diagnosis eia_diagnosis

. tab eia_diagnosis, missing

eia_diagnos |
         is |      Freq.     Percent        Cum.
------------+-----------------------------------
         RA |        843       80.98       80.98
        PsA |        110       10.57       91.55
      AxSpA |         72        6.92       98.46
  Undiff IA |         16        1.54      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. drop if eia_diagnosis==. //should be none
(0 observations deleted)

. 
. decode eia_diagnosis, gen(eia_diag)

. replace eia_diag="Undiff_IA" if eia_diagnosis==4
(16 real changes made)

. 
. *Split into time windows=========================================*/
. 
. **Month/Year of GP diagnostic code
. gen year_diag=year(eia_code_date)

. format year_diag %ty

. gen month_diag=month(eia_code_date)

. gen mo_year_diagn=ym(year_diag, month_diag)

. format mo_year_diagn %tmMon-CCYY

. generate str16 mo_year_diagn_s = strofreal(mo_year_diagn,"%tmCCYY!mNN")

. lab var mo_year_diagn "Month/Year of Diagnosis"

. lab var mo_year_diagn_s "Month/Year of Diagnosis"

. 
. **Month/Year of rheum appt
. gen year_appt=year(rheum_appt_date) if rheum_appt_date!=.
(920 missing values generated)

. format year_appt %ty

. gen month_appt=month(rheum_appt_date) if rheum_appt_date!=. 
(920 missing values generated)

. gen mo_year_appt=ym(year_appt, month_appt)
(920 missing values generated)

. format mo_year_appt %tmMon-CCYY

. generate str16 mo_year_appt_s = strofreal(mo_year_appt,"%tmCCYY!mNN")

. 
. **Separate into 3-month time windows (for diagnosis date)
. gen diagnosis_3m = qofd(diagnosis_date)

. format diagnosis_3m %tq

. lab var diagnosis_3m "Time period for diagnosis"

. tab diagnosis_3m, missing

Time period |
        for |
  diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
     2016q2 |          5        0.48        0.48
     2016q3 |          3        0.29        0.77
     2016q4 |          6        0.58        1.34
     2017q1 |          2        0.19        1.54
     2017q2 |          6        0.58        2.11
     2017q3 |          8        0.77        2.88
     2017q4 |          6        0.58        3.46
     2018q1 |          4        0.38        3.84
     2018q2 |          4        0.38        4.23
     2018q3 |          6        0.58        4.80
     2018q4 |          5        0.48        5.28
     2019q1 |          7        0.67        5.96
     2019q2 |          9        0.86        6.82
     2019q3 |          9        0.86        7.68
     2019q4 |         10        0.96        8.65
     2020q1 |          2        0.19        8.84
     2020q2 |         10        0.96        9.80
     2020q3 |          7        0.67       10.47
     2020q4 |         21        2.02       12.49
     2021q1 |         14        1.34       13.83
     2021q2 |         10        0.96       14.79
     2021q3 |         19        1.83       16.62
     2021q4 |         11        1.06       17.68
     2022q1 |         22        2.11       19.79
     2022q2 |         34        3.27       23.05
     2022q3 |         34        3.27       26.32
     2022q4 |         43        4.13       30.45
     2023q1 |         51        4.90       35.35
     2023q2 |         50        4.80       40.15
     2023q3 |         79        7.59       47.74
     2023q4 |         70        6.72       54.47
     2024q1 |         90        8.65       63.11
     2024q2 |         80        7.68       70.80
     2024q3 |         88        8.45       79.25
     2024q4 |        106       10.18       89.43
     2025q1 |        110       10.57      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. bys eia_diagnosis: tab diagnosis_3m, missing

---------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

Time period |
        for |
  diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
     2016q2 |          4        0.47        0.47
     2016q3 |          3        0.36        0.83
     2016q4 |          6        0.71        1.54
     2017q1 |          1        0.12        1.66
     2017q2 |          4        0.47        2.14
     2017q3 |          5        0.59        2.73
     2017q4 |          5        0.59        3.32
     2018q1 |          4        0.47        3.80
     2018q2 |          3        0.36        4.15
     2018q3 |          6        0.71        4.86
     2018q4 |          3        0.36        5.22
     2019q1 |          6        0.71        5.93
     2019q2 |          7        0.83        6.76
     2019q3 |          6        0.71        7.47
     2019q4 |          8        0.95        8.42
     2020q1 |          1        0.12        8.54
     2020q2 |          5        0.59        9.13
     2020q3 |          5        0.59        9.73
     2020q4 |         18        2.14       11.86
     2021q1 |         10        1.19       13.05
     2021q2 |         10        1.19       14.23
     2021q3 |         15        1.78       16.01
     2021q4 |          8        0.95       16.96
     2022q1 |         20        2.37       19.34
     2022q2 |         24        2.85       22.18
     2022q3 |         28        3.32       25.50
     2022q4 |         30        3.56       29.06
     2023q1 |         41        4.86       33.93
     2023q2 |         42        4.98       38.91
     2023q3 |         63        7.47       46.38
     2023q4 |         64        7.59       53.97
     2024q1 |         66        7.83       61.80
     2024q2 |         70        8.30       70.11
     2024q3 |         75        8.90       79.00
     2024q4 |         89       10.56       89.56
     2025q1 |         88       10.44      100.00
------------+-----------------------------------
      Total |        843      100.00

---------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

Time period |
        for |
  diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
     2016q2 |          1        0.91        0.91
     2017q1 |          1        0.91        1.82
     2017q2 |          2        1.82        3.64
     2017q3 |          1        0.91        4.55
     2017q4 |          1        0.91        5.45
     2018q4 |          1        0.91        6.36
     2019q2 |          2        1.82        8.18
     2019q3 |          2        1.82       10.00
     2020q1 |          1        0.91       10.91
     2020q2 |          3        2.73       13.64
     2020q3 |          2        1.82       15.45
     2020q4 |          3        2.73       18.18
     2021q1 |          1        0.91       19.09
     2021q3 |          2        1.82       20.91
     2021q4 |          1        0.91       21.82
     2022q1 |          1        0.91       22.73
     2022q2 |          7        6.36       29.09
     2022q3 |          4        3.64       32.73
     2022q4 |          6        5.45       38.18
     2023q1 |          3        2.73       40.91
     2023q2 |          4        3.64       44.55
     2023q3 |         11       10.00       54.55
     2023q4 |          6        5.45       60.00
     2024q1 |         13       11.82       71.82
     2024q2 |          5        4.55       76.36
     2024q3 |          6        5.45       81.82
     2024q4 |          9        8.18       90.00
     2025q1 |         11       10.00      100.00
------------+-----------------------------------
      Total |        110      100.00

---------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

Time period |
        for |
  diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
     2017q3 |          1        1.39        1.39
     2018q4 |          1        1.39        2.78
     2019q3 |          1        1.39        4.17
     2019q4 |          2        2.78        6.94
     2020q2 |          2        2.78        9.72
     2021q1 |          2        2.78       12.50
     2021q3 |          2        2.78       15.28
     2021q4 |          2        2.78       18.06
     2022q1 |          1        1.39       19.44
     2022q2 |          3        4.17       23.61
     2022q3 |          2        2.78       26.39
     2022q4 |          7        9.72       36.11
     2023q1 |          6        8.33       44.44
     2023q2 |          4        5.56       50.00
     2023q3 |          3        4.17       54.17
     2024q1 |         10       13.89       68.06
     2024q2 |          4        5.56       73.61
     2024q3 |          4        5.56       79.17
     2024q4 |          6        8.33       87.50
     2025q1 |          9       12.50      100.00
------------+-----------------------------------
      Total |         72      100.00

---------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = Undiff IA

Time period |
        for |
  diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
     2017q3 |          1        6.25        6.25
     2018q2 |          1        6.25       12.50
     2019q1 |          1        6.25       18.75
     2021q1 |          1        6.25       25.00
     2023q1 |          1        6.25       31.25
     2023q3 |          2       12.50       43.75
     2024q1 |          1        6.25       50.00
     2024q2 |          1        6.25       56.25
     2024q3 |          3       18.75       75.00
     2024q4 |          2       12.50       87.50
     2025q1 |          2       12.50      100.00
------------+-----------------------------------
      Total |         16      100.00


. 
. **Separate into 12-month time windows (for diagnosis date)
. gen diagnosis_year = (floor((diagnosis_date - date("$start_date", "DMY")) / 365.25) + 1) if inrange(diagnosis_date, date("$star
> t_date", "DMY"), date("$end_date", "DMY"))

. lab var diagnosis_year "Year of diagnosis"

. forvalues i = 1/$max_year {
  2.     local start = $base_year + `i' - 1
  3.     local end = `start' + 1
  4.     label define diagnosis_year_lbl `i' "Apr `start'–Mar `end'", add
  5. }

. lab val diagnosis_year diagnosis_year_lbl

. tab diagnosis_year, missing

Year of diagnosis |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2016–Mar 2017 |         16        1.54        1.54
Apr 2017–Mar 2018 |         24        2.31        3.84
Apr 2018–Mar 2019 |         22        2.11        5.96
Apr 2019–Mar 2020 |         30        2.88        8.84
Apr 2020–Mar 2021 |         52        5.00       13.83
Apr 2021–Mar 2022 |         62        5.96       19.79
Apr 2022–Mar 2023 |        162       15.56       35.35
Apr 2023–Mar 2024 |        289       27.76       63.11
Apr 2024–Mar 2025 |        384       36.89      100.00
------------------+-----------------------------------
            Total |      1,041      100.00

. bys eia_diagnosis: tab diagnosis_year, missing

---------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

Year of diagnosis |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2016–Mar 2017 |         14        1.66        1.66
Apr 2017–Mar 2018 |         18        2.14        3.80
Apr 2018–Mar 2019 |         18        2.14        5.93
Apr 2019–Mar 2020 |         22        2.61        8.54
Apr 2020–Mar 2021 |         38        4.51       13.05
Apr 2021–Mar 2022 |         53        6.29       19.34
Apr 2022–Mar 2023 |        123       14.59       33.93
Apr 2023–Mar 2024 |        235       27.88       61.80
Apr 2024–Mar 2025 |        322       38.20      100.00
------------------+-----------------------------------
            Total |        843      100.00

---------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

Year of diagnosis |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2016–Mar 2017 |          2        1.82        1.82
Apr 2017–Mar 2018 |          4        3.64        5.45
Apr 2018–Mar 2019 |          1        0.91        6.36
Apr 2019–Mar 2020 |          5        4.55       10.91
Apr 2020–Mar 2021 |          9        8.18       19.09
Apr 2021–Mar 2022 |          4        3.64       22.73
Apr 2022–Mar 2023 |         20       18.18       40.91
Apr 2023–Mar 2024 |         34       30.91       71.82
Apr 2024–Mar 2025 |         31       28.18      100.00
------------------+-----------------------------------
            Total |        110      100.00

---------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

Year of diagnosis |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2017–Mar 2018 |          1        1.39        1.39
Apr 2018–Mar 2019 |          1        1.39        2.78
Apr 2019–Mar 2020 |          3        4.17        6.94
Apr 2020–Mar 2021 |          4        5.56       12.50
Apr 2021–Mar 2022 |          5        6.94       19.44
Apr 2022–Mar 2023 |         18       25.00       44.44
Apr 2023–Mar 2024 |         17       23.61       68.06
Apr 2024–Mar 2025 |         23       31.94      100.00
------------------+-----------------------------------
            Total |         72      100.00

---------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = Undiff IA

Year of diagnosis |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2017–Mar 2018 |          1        6.25        6.25
Apr 2018–Mar 2019 |          2       12.50       18.75
Apr 2020–Mar 2021 |          1        6.25       25.00
Apr 2022–Mar 2023 |          1        6.25       31.25
Apr 2023–Mar 2024 |          3       18.75       50.00
Apr 2024–Mar 2025 |          8       50.00      100.00
------------------+-----------------------------------
            Total |         16      100.00


. 
. **Separate into 3-month time windows (for appt date)
. gen appt_3m = qofd(rheum_appt_date)
(920 missing values generated)

. format appt_3m %tq

. lab var appt_3m "Time period for appointment"

. tab appt_3m, missing

Time period |
        for |
appointment |      Freq.     Percent        Cum.
------------+-----------------------------------
     2015q3 |          2        0.19        0.19
     2016q1 |          2        0.19        0.38
     2016q3 |          1        0.10        0.48
     2016q4 |          1        0.10        0.58
     2017q2 |          1        0.10        0.67
     2017q3 |          2        0.19        0.86
     2017q4 |          1        0.10        0.96
     2018q3 |          2        0.19        1.15
     2019q4 |          1        0.10        1.25
     2020q4 |          1        0.10        1.34
     2021q1 |          1        0.10        1.44
     2021q2 |          1        0.10        1.54
     2021q3 |          1        0.10        1.63
     2021q4 |          1        0.10        1.73
     2022q1 |          2        0.19        1.92
     2022q2 |          3        0.29        2.21
     2022q3 |          3        0.29        2.50
     2022q4 |          6        0.58        3.07
     2023q1 |          9        0.86        3.94
     2023q2 |          4        0.38        4.32
     2023q3 |          8        0.77        5.09
     2023q4 |         10        0.96        6.05
     2024q1 |         16        1.54        7.59
     2024q2 |         18        1.73        9.32
     2024q3 |          9        0.86       10.18
     2024q4 |         11        1.06       11.24
     2025q1 |          4        0.38       11.62
          . |        920       88.38      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. bys eia_diagnosis: tab appt_3m, missing

---------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

Time period |
        for |
appointment |      Freq.     Percent        Cum.
------------+-----------------------------------
     2015q3 |          1        0.12        0.12
     2016q1 |          2        0.24        0.36
     2016q3 |          1        0.12        0.47
     2017q2 |          1        0.12        0.59
     2017q3 |          2        0.24        0.83
     2017q4 |          1        0.12        0.95
     2018q3 |          2        0.24        1.19
     2019q4 |          1        0.12        1.30
     2020q4 |          1        0.12        1.42
     2021q1 |          1        0.12        1.54
     2021q2 |          1        0.12        1.66
     2021q3 |          1        0.12        1.78
     2021q4 |          1        0.12        1.90
     2022q1 |          2        0.24        2.14
     2022q2 |          3        0.36        2.49
     2022q3 |          3        0.36        2.85
     2022q4 |          6        0.71        3.56
     2023q1 |          7        0.83        4.39
     2023q2 |          2        0.24        4.63
     2023q3 |          6        0.71        5.34
     2023q4 |          8        0.95        6.29
     2024q1 |         12        1.42        7.71
     2024q2 |         14        1.66        9.37
     2024q3 |          9        1.07       10.44
     2024q4 |          9        1.07       11.51
     2025q1 |          4        0.47       11.98
          . |        742       88.02      100.00
------------+-----------------------------------
      Total |        843      100.00

---------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

Time period |
        for |
appointment |      Freq.     Percent        Cum.
------------+-----------------------------------
     2015q3 |          1        0.91        0.91
     2023q1 |          1        0.91        1.82
     2023q2 |          1        0.91        2.73
     2023q3 |          2        1.82        4.55
     2024q1 |          1        0.91        5.45
     2024q2 |          3        2.73        8.18
     2024q4 |          1        0.91        9.09
          . |        100       90.91      100.00
------------+-----------------------------------
      Total |        110      100.00

---------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

Time period |
        for |
appointment |      Freq.     Percent        Cum.
------------+-----------------------------------
     2023q1 |          1        1.39        1.39
     2023q2 |          1        1.39        2.78
     2023q4 |          2        2.78        5.56
     2024q1 |          3        4.17        9.72
     2024q2 |          1        1.39       11.11
     2024q4 |          1        1.39       12.50
          . |         63       87.50      100.00
------------+-----------------------------------
      Total |         72      100.00

---------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = Undiff IA

Time period |
        for |
appointment |      Freq.     Percent        Cum.
------------+-----------------------------------
     2016q4 |          1        6.25        6.25
          . |         15       93.75      100.00
------------+-----------------------------------
      Total |         16      100.00


. 
. **Separate into 12-month time windows (for appt date)
. gen appt_year = (floor((rheum_appt_date - date("$start_date", "DMY")) / 365.25) + 1) if inrange(rheum_appt_date, date("$start_d
> ate", "DMY"), date("$end_date", "DMY"))
(924 missing values generated)

. lab var appt_year "Year of appointment"

. forvalues i = 1/$max_year {
  2.     local start = $base_year + `i' - 1
  3.     local end = `start' + 1
  4.     label define appt_year_lbl `i' "Apr `start'–Mar `end'", add
  5. }

. lab val appt_year appt_year_lbl

. tab appt_year, missing

          Year of |
      appointment |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2016–Mar 2017 |          2        0.19        0.19
Apr 2017–Mar 2018 |          4        0.38        0.58
Apr 2018–Mar 2019 |          2        0.19        0.77
Apr 2019–Mar 2020 |          1        0.10        0.86
Apr 2020–Mar 2021 |          2        0.19        1.06
Apr 2021–Mar 2022 |          5        0.48        1.54
Apr 2022–Mar 2023 |         21        2.02        3.55
Apr 2023–Mar 2024 |         38        3.65        7.20
Apr 2024–Mar 2025 |         42        4.03       11.24
                . |        924       88.76      100.00
------------------+-----------------------------------
            Total |      1,041      100.00

. bys eia_diagnosis: tab appt_year, missing

---------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

          Year of |
      appointment |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2016–Mar 2017 |          1        0.12        0.12
Apr 2017–Mar 2018 |          4        0.47        0.59
Apr 2018–Mar 2019 |          2        0.24        0.83
Apr 2019–Mar 2020 |          1        0.12        0.95
Apr 2020–Mar 2021 |          2        0.24        1.19
Apr 2021–Mar 2022 |          5        0.59        1.78
Apr 2022–Mar 2023 |         19        2.25        4.03
Apr 2023–Mar 2024 |         28        3.32        7.35
Apr 2024–Mar 2025 |         36        4.27       11.63
                . |        745       88.37      100.00
------------------+-----------------------------------
            Total |        843      100.00

---------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

          Year of |
      appointment |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2022–Mar 2023 |          1        0.91        0.91
Apr 2023–Mar 2024 |          4        3.64        4.55
Apr 2024–Mar 2025 |          4        3.64        8.18
                . |        101       91.82      100.00
------------------+-----------------------------------
            Total |        110      100.00

---------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

          Year of |
      appointment |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2022–Mar 2023 |          1        1.39        1.39
Apr 2023–Mar 2024 |          6        8.33        9.72
Apr 2024–Mar 2025 |          2        2.78       12.50
                . |         63       87.50      100.00
------------------+-----------------------------------
            Total |         72      100.00

---------------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = Undiff IA

          Year of |
      appointment |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2016–Mar 2017 |          1        6.25        6.25
                . |         15       93.75      100.00
------------------+-----------------------------------
            Total |         16      100.00


. 
. *Define Rheumatology appointments ======================================*/
. 
. **Rheumatology appt definitions 
. tab rheum_appt, missing //proportion of patients with an rheum outpatient date (with first attendance option selected) in the 1
> 2 months before and 60 days after EIA code appeared in GP record; data only April 2019 onwards

Rheumatolog |
          y |
appointment |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        920       88.38       88.38
        Yes |        121       11.62      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. tab mo_year_diagn rheum_appt, missing //proportion of patients with an rheum outpatient date (with first attendance option sele
> cted) in the 12 months before and 60 days after EIA code appeared in GP record; data only April 2019 onwards

Month/Year |     Rheumatology
        of |      appointment
 Diagnosis |        No        Yes |     Total
-----------+----------------------+----------
  Apr-2016 |         0          1 |         1 
  May-2016 |         1          1 |         2 
  Jun-2016 |         2          0 |         2 
  Jul-2016 |         1          0 |         1 
  Aug-2016 |         1          0 |         1 
  Sep-2016 |         1          0 |         1 
  Oct-2016 |         1          0 |         1 
  Nov-2016 |         1          1 |         2 
  Dec-2016 |         3          0 |         3 
  Jan-2017 |         0          1 |         1 
  Mar-2017 |         1          0 |         1 
  Apr-2017 |         2          0 |         2 
  May-2017 |         1          1 |         2 
  Jun-2017 |         2          0 |         2 
  Jul-2017 |         2          0 |         2 
  Aug-2017 |         2          1 |         3 
  Sep-2017 |         2          1 |         3 
  Oct-2017 |         2          0 |         2 
  Nov-2017 |         1          1 |         2 
  Dec-2017 |         2          0 |         2 
  Feb-2018 |         2          2 |         4 
  Apr-2018 |         2          0 |         2 
  Jun-2018 |         2          0 |         2 
  Jul-2018 |         4          0 |         4 
  Sep-2018 |         1          1 |         2 
  Oct-2018 |         2          0 |         2 
  Nov-2018 |         2          0 |         2 
  Dec-2018 |         1          0 |         1 
  Jan-2019 |         2          0 |         2 
  Feb-2019 |         3          0 |         3 
  Mar-2019 |         2          0 |         2 
  Apr-2019 |         1          0 |         1 
  May-2019 |         5          0 |         5 
  Jun-2019 |         2          1 |         3 
  Jul-2019 |         3          0 |         3 
  Aug-2019 |         3          0 |         3 
  Sep-2019 |         3          0 |         3 
  Oct-2019 |         4          0 |         4 
  Nov-2019 |         3          0 |         3 
  Dec-2019 |         3          0 |         3 
  Jan-2020 |         1          0 |         1 
  Feb-2020 |         1          0 |         1 
  Apr-2020 |         4          0 |         4 
  May-2020 |         3          0 |         3 
  Jun-2020 |         3          0 |         3 
  Jul-2020 |         4          0 |         4 
  Sep-2020 |         3          0 |         3 
  Oct-2020 |         4          0 |         4 
  Nov-2020 |         7          1 |         8 
  Dec-2020 |         9          0 |         9 
  Jan-2021 |         4          0 |         4 
  Feb-2021 |         8          0 |         8 
  Mar-2021 |         2          0 |         2 
  Apr-2021 |         4          0 |         4 
  May-2021 |         4          0 |         4 
  Jun-2021 |         2          0 |         2 
  Jul-2021 |         6          1 |         7 
  Aug-2021 |         5          1 |         6 
  Sep-2021 |         5          1 |         6 
  Oct-2021 |         4          0 |         4 
  Nov-2021 |         3          0 |         3 
  Dec-2021 |         4          0 |         4 
  Jan-2022 |         3          0 |         3 
  Feb-2022 |        11          0 |        11 
  Mar-2022 |         7          1 |         8 
  Apr-2022 |        11          0 |        11 
  May-2022 |        13          0 |        13 
  Jun-2022 |        10          0 |        10 
  Jul-2022 |        13          0 |        13 
  Aug-2022 |         9          1 |        10 
  Sep-2022 |         9          2 |        11 
  Oct-2022 |        12          2 |        14 
  Nov-2022 |        15          0 |        15 
  Dec-2022 |        12          2 |        14 
  Jan-2023 |        12          1 |        13 
  Feb-2023 |        15          1 |        16 
  Mar-2023 |        20          2 |        22 
  Apr-2023 |        17          0 |        17 
  May-2023 |        11          3 |        14 
  Jun-2023 |        18          1 |        19 
  Jul-2023 |        25          1 |        26 
  Aug-2023 |        26          1 |        27 
  Sep-2023 |        24          2 |        26 
  Oct-2023 |        23          2 |        25 
  Nov-2023 |        19          2 |        21 
  Dec-2023 |        22          2 |        24 
  Jan-2024 |        30          3 |        33 
  Feb-2024 |        23          4 |        27 
  Mar-2024 |        27          3 |        30 
  Apr-2024 |        23          5 |        28 
  May-2024 |        24          5 |        29 
  Jun-2024 |        21          2 |        23 
  Jul-2024 |        34          3 |        37 
  Aug-2024 |        21          4 |        25 
  Sep-2024 |        20          6 |        26 
  Oct-2024 |        36          2 |        38 
  Nov-2024 |        31          5 |        36 
  Dec-2024 |        23          9 |        32 
  Jan-2025 |        29         10 |        39 
  Feb-2025 |        25         12 |        37 
  Mar-2025 |        28          6 |        34 
-----------+----------------------+----------
     Total |       920        121 |     1,041 

. tab rheum_appt_any, missing //proportion of patients with a rheum outpatient date (without first attendance option selected) in
>  the 12 months before and 60 days after EIA code appeared in GP record; data only April 2019 onwards

rheum_appt_ |
        any |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        766       73.58       73.58
          1 |        275       26.42      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. tab rheum_appt2, missing //proportion of patients with a rheum outpatient date (without first attendance option selected) in th
> e 6 months before and 60 days after  EIA code appeared in GP record; data only April 2019 onwards

rheum_appt2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        826       79.35       79.35
          1 |        215       20.65      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. tab rheum_appt3, missing //proportion of patients with a rheum outpatient date (without first attendance option selected) in th
> e 2 years before and 60 days after EIA code appeared in GP record; data only April 2019 onwards

rheum_appt3 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        650       62.44       62.44
          1 |        391       37.56      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. tab rheum_appt4, missing //proportion of patients with a rheum outpatient date (without first attendance option selected) in th
> e 2 years before and 1 year after EIA code appeared in GP record; data only April 2019 onwards

rheum_appt4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        650       62.44       62.44
          1 |        391       37.56      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. 
. ***Check number of rheumatology appts in the year before EIA code
. tabstat rheum_appt_count, stat (n mean sd p50 p25 p75)

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |      1041  .4553314  .9962299         0         0         0
--------------------------------------------------------------------------

. bys diagnosis_year: tabstat rheum_appt_count, stat (n mean sd p50 p25 p75)

---------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = Apr 2016–Mar 2017

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |        16      .875  1.360147         0         0       1.5
--------------------------------------------------------------------------

---------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = Apr 2017–Mar 2018

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |        24  .6666667   1.09014         0         0         1
--------------------------------------------------------------------------

---------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = Apr 2018–Mar 2019

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |        22  .2272727  .5284135         0         0         0
--------------------------------------------------------------------------

---------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = Apr 2019–Mar 2020

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |        30  .0666667  .3651484         0         0         0
--------------------------------------------------------------------------

---------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = Apr 2020–Mar 2021

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |        52  .1153846  .5108181         0         0         0
--------------------------------------------------------------------------

---------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = Apr 2021–Mar 2022

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |        62  .2258065  .6381159         0         0         0
--------------------------------------------------------------------------

---------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = Apr 2022–Mar 2023

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |       162   .154321  .4537078         0         0         0
--------------------------------------------------------------------------

---------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = Apr 2023–Mar 2024

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |       289  .3114187   .634572         0         0         0
--------------------------------------------------------------------------

---------------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = Apr 2024–Mar 2025

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |       384  .7864583  1.350456         0         0         1
--------------------------------------------------------------------------

. bys appt_year: tabstat rheum_appt_count, stat (n mean sd p50 p25 p75)

---------------------------------------------------------------------------------------------------------------------------------
-> appt_year = Apr 2016–Mar 2017

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |         2         1         0         1         1         1
--------------------------------------------------------------------------

---------------------------------------------------------------------------------------------------------------------------------
-> appt_year = Apr 2017–Mar 2018

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |         4         2  1.414214       1.5         1         3
--------------------------------------------------------------------------

---------------------------------------------------------------------------------------------------------------------------------
-> appt_year = Apr 2018–Mar 2019

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |         2         2         0         2         2         2
--------------------------------------------------------------------------

---------------------------------------------------------------------------------------------------------------------------------
-> appt_year = Apr 2019–Mar 2020

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |         1         3         .         3         3         3
--------------------------------------------------------------------------

---------------------------------------------------------------------------------------------------------------------------------
-> appt_year = Apr 2020–Mar 2021

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |         2       1.5  .7071068       1.5         1         2
--------------------------------------------------------------------------

---------------------------------------------------------------------------------------------------------------------------------
-> appt_year = Apr 2021–Mar 2022

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |         5       1.6  1.341641         1         1         1
--------------------------------------------------------------------------

---------------------------------------------------------------------------------------------------------------------------------
-> appt_year = Apr 2022–Mar 2023

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |        21  1.428571  .8106435         1         1         2
--------------------------------------------------------------------------

---------------------------------------------------------------------------------------------------------------------------------
-> appt_year = Apr 2023–Mar 2024

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |        38  2.078947  .8504873         2         1         3
--------------------------------------------------------------------------

---------------------------------------------------------------------------------------------------------------------------------
-> appt_year = Apr 2024–Mar 2025

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |        42  2.833333  1.737908       2.5         1         4
--------------------------------------------------------------------------

---------------------------------------------------------------------------------------------------------------------------------
-> appt_year = .

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |       924  .2359307  .6766234         0         0         0
--------------------------------------------------------------------------

. 
. ***Check medium used for rheumatology appointment
. tab rheum_appt_medium, missing

rheum_appt_ |
     medium |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         18        1.73        1.73
          2 |         11        1.06        2.79
          3 |         12        1.15        3.94
          4 |         10        0.96        4.90
          5 |         16        1.54        6.44
          9 |          6        0.58        7.01
         10 |         17        1.63        8.65
         11 |         15        1.44       10.09
         98 |         16        1.54       11.62
          . |        920       88.38      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. gen rheum_appt_medium_clean = rheum_appt_medium if rheum_appt_medium >0 & rheum_appt_medium<100
(920 missing values generated)

. recode rheum_appt_medium_clean 3=2 //recode telemedicine=telephone
(12 changes made to rheum_appt_medium_clean)

. replace rheum_appt_medium_clean=10 if rheum_appt_medium_clean>2 & rheum_appt_medium_clean!=.
(63 real changes made)

. recode rheum_appt_medium_clean .=.u
(920 changes made to rheum_appt_medium_clean)

. lab define rheum_appt_medium_clean 1 "Face-to-face" 2 "Telephone" 10 "Other" .u "Missing", modify

. lab val rheum_appt_medium_clean rheum_appt_medium_clean

. lab var rheum_appt_medium_clean "Rheumatology consultation medium"

. tab rheum_appt_medium_clean 

Rheumatology |
consultation |
      medium |      Freq.     Percent        Cum.
-------------+-----------------------------------
Face-to-face |         18       14.88       14.88
   Telephone |         23       19.01       33.88
       Other |         80       66.12      100.00
-------------+-----------------------------------
       Total |        121      100.00

. 
. *Gen rheum appt variable with 6m/12m+ until study end date
. gen rheum_appt_12m=rheum_appt if rheum_appt_date<=(date("$end_date", "DMY")-365) 
(962 missing values generated)

. recode rheum_appt_12m .=0
(962 changes made to rheum_appt_12m)

. lab var rheum_appt_12m "Rheumatology appt 12m+"

. lab define rheum_appt_12m 0 "No" 1 "Yes", modify

. lab val rheum_appt_12m rheum_appt_12m

. 
. gen rheum_appt_6m=rheum_appt if rheum_appt_date<=(date("$end_date", "DMY")-180) 
(935 missing values generated)

. recode rheum_appt_6m .=0
(935 changes made to rheum_appt_6m)

. lab var rheum_appt_6m "Rheumatology appt 6m+"

. lab define rheum_appt_6m 0 "No" 1 "Yes", modify

. lab val rheum_appt_6m rheum_appt_6m

. 
. **Define Rheumatology referrals ======================================*/
. 
. ***From HES OPA (referral_request_received_date)
. tab rheum_appt_ref_date, missing

rheum_appt_ |
   ref_date |      Freq.     Percent        Cum.
------------+-----------------------------------
  11apr2012 |          1        0.10        0.10
  13apr2016 |          1        0.10        0.19
  10may2016 |          1        0.10        0.29
  28aug2016 |          1        0.10        0.38
  28nov2016 |          1        0.10        0.48
  27jan2017 |          1        0.10        0.58
  29jan2017 |          1        0.10        0.67
  13mar2017 |          1        0.10        0.77
  06apr2017 |          1        0.10        0.86
  11dec2018 |          1        0.10        0.96
  27feb2019 |          1        0.10        1.06
  06apr2019 |          1        0.10        1.15
  12jul2019 |          1        0.10        1.25
  15dec2020 |          1        0.10        1.34
  25may2021 |          1        0.10        1.44
  07nov2021 |          1        0.10        1.54
  20dec2021 |          1        0.10        1.63
  03apr2022 |          1        0.10        1.73
  29jun2022 |          1        0.10        1.83
  01aug2022 |          1        0.10        1.92
  17aug2022 |          1        0.10        2.02
  21sep2022 |          1        0.10        2.11
  27oct2022 |          1        0.10        2.21
  26dec2022 |          1        0.10        2.31
  10feb2023 |          1        0.10        2.40
  23feb2023 |          1        0.10        2.50
  09mar2023 |          1        0.10        2.59
  08apr2023 |          1        0.10        2.69
  20apr2023 |          1        0.10        2.79
  25may2023 |          1        0.10        2.88
  26may2023 |          1        0.10        2.98
  28jun2023 |          1        0.10        3.07
  22jul2023 |          1        0.10        3.17
  26jul2023 |          1        0.10        3.27
  15sep2023 |          1        0.10        3.36
  21sep2023 |          1        0.10        3.46
  24sep2023 |          1        0.10        3.55
  02oct2023 |          1        0.10        3.65
  15nov2023 |          1        0.10        3.75
  24nov2023 |          1        0.10        3.84
  28nov2023 |          1        0.10        3.94
  05dec2023 |          1        0.10        4.03
  06dec2023 |          1        0.10        4.13
  09dec2023 |          1        0.10        4.23
  14dec2023 |          1        0.10        4.32
  22dec2023 |          1        0.10        4.42
  24dec2023 |          1        0.10        4.51
  03jan2024 |          1        0.10        4.61
  13jan2024 |          1        0.10        4.71
  14jan2024 |          1        0.10        4.80
  23jan2024 |          1        0.10        4.90
  30jan2024 |          1        0.10        5.00
  07feb2024 |          1        0.10        5.09
  11feb2024 |          1        0.10        5.19
  21feb2024 |          1        0.10        5.28
  22feb2024 |          1        0.10        5.38
  29feb2024 |          1        0.10        5.48
  10mar2024 |          1        0.10        5.57
  17mar2024 |          1        0.10        5.67
  19mar2024 |          1        0.10        5.76
  07apr2024 |          1        0.10        5.86
  02may2024 |          1        0.10        5.96
  10may2024 |          1        0.10        6.05
  06jun2024 |          1        0.10        6.15
  05jul2024 |          1        0.10        6.24
  09jul2024 |          1        0.10        6.34
  12jul2024 |          1        0.10        6.44
  21jul2024 |          1        0.10        6.53
  22jul2024 |          1        0.10        6.63
  29jul2024 |          1        0.10        6.72
  01aug2024 |          1        0.10        6.82
  06aug2024 |          1        0.10        6.92
  10aug2024 |          1        0.10        7.01
  17aug2024 |          1        0.10        7.11
  21aug2024 |          1        0.10        7.20
  09sep2024 |          1        0.10        7.30
  15sep2024 |          1        0.10        7.40
  21sep2024 |          1        0.10        7.49
  22sep2024 |          1        0.10        7.59
  27sep2024 |          1        0.10        7.68
  29sep2024 |          1        0.10        7.78
  29oct2024 |          1        0.10        7.88
  06nov2024 |          1        0.10        7.97
  23nov2024 |          1        0.10        8.07
  30nov2024 |          1        0.10        8.17
  02dec2024 |          1        0.10        8.26
  11dec2024 |          1        0.10        8.36
  15dec2024 |          1        0.10        8.45
  17dec2024 |          1        0.10        8.55
  23dec2024 |          1        0.10        8.65
  29dec2024 |          1        0.10        8.74
  04jan2025 |          1        0.10        8.84
  06jan2025 |          1        0.10        8.93
  09jan2025 |          1        0.10        9.03
  14jan2025 |          1        0.10        9.13
  02feb2025 |          1        0.10        9.22
  06feb2025 |          1        0.10        9.32
  12feb2025 |          1        0.10        9.41
  15feb2025 |          1        0.10        9.51
  17feb2025 |          1        0.10        9.61
  19feb2025 |          1        0.10        9.70
  21feb2025 |          1        0.10        9.80
  25feb2025 |          1        0.10        9.89
  04mar2025 |          1        0.10        9.99
  12mar2025 |          1        0.10       10.09
  14mar2025 |          1        0.10       10.18
  18mar2025 |          2        0.19       10.37
  02apr2025 |          1        0.10       10.47
  05apr2025 |          2        0.19       10.66
  09apr2025 |          2        0.19       10.85
  20apr2025 |          1        0.10       10.95
  26apr2025 |          1        0.10       11.05
  03may2025 |          1        0.10       11.14
  05may2025 |          1        0.10       11.24
  08may2025 |          2        0.19       11.43
  14may2025 |          1        0.10       11.53
  17may2025 |          1        0.10       11.62
          . |        920       88.38      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. tab mo_year_diagn rheum_appt_ref_date, missing
too many values
r(134);

end of do-file

r(134);

. do "C:\Users\Mark\AppData\Local\Temp\STD2bf4_000000.tmp"

. import delimited "$projectdir/output/dataset.csv", clear
(encoding automatically selected: ISO-8859-1)
(88 vars, 1,958 obs)

. 
. **Set Ado file path
. adopath + "$projectdir/analysis/extra_ados"
  [1]  (BASE)      "C:\Program Files\Stata18\ado\base/"
  [2]  (SITE)      "C:\Program Files\Stata18\ado\site/"
  [3]              "."
  [4]  (PERSONAL)  "C:\Users\Mark\ado\personal/"
  [5]  (PLUS)      "C:\Users\Mark\ado\plus/"
  [6]  (OLDPLACE)  "c:\ado/"
  [7]              "C:\Users\Mark\OneDrive\PhD Project\OpenSAFELY NEIAA\inflammatory_rheum/analysis/extra_ados"

. 
. **Set index dates ===========================================================*/
. global year_preceding = "01/04/2015"

. global start_date = "01/04/2016" //for outpatient analyses, data may only be available from April 2019

. global end_date = "31/03/2025"

. global base_year = year(date("$start_date", "DMY"))

. global end_year = year(date("$end_date", "DMY"))

. global max_year = $end_year - $base_year

. 
. **Conversion for dates====================================================*
. 
. ***Variables ending in _date that are string
. ds *_date, has(type string)
eia_code_d~e  copd_befor~e  frac_befor~e  solid_ca_a~e  rf_date       r~eappt_date  metho~j_date  rtt_op_end~e
ra_code_date  cva_before~e  dem_before~e  haem_ca_af~e  bmi_date      rheum~e_date  sulfasalaz~e
psa_code_d~e  lung_ca_be~e  chd_after_~e  ckd_after_~e  r~_appt_date  ~erheum_date  hydroxychl~e
anksp_code~e  solid_ca_b~e  dm_after_d~e  depr_after~e  rheum~f_date  l~ecode_date  rtt_cl_sta~e
undiff_cod~e  haem_ca_be~e  ild_after_~e  osteop_aft~e  rheum~y_date  ~frheum_date  rtt_cl_ref~e
chd_before~e  ckd_before~e  copd_after~e  frac_after~e  rheum~2_date  l~fcode_date  rtt_cl_end~e
dm_before_~e  depr_befor~e  cva_after_~e  dem_after_~e  rheum~3_date  leflunomid~e  rtt_op_sta~e
ild_before~e  osteop_bef~e  lung_ca_af~e  creatinin~te  rheum~4_date  metho~e_date  rtt_op_ref~e

. local string_dates `r(varlist)'

. foreach var of local string_dates {
  2.     gen `var'_num = date(`var', "YMD")
  3.     format `var'_num %td
  4.     order `var'_num, after(`var')
  5.     drop `var'
  6.     rename `var'_num `var'
  7. }
(325 missing values generated)
(1,753 missing values generated)
(1,822 missing values generated)
(1,922 missing values generated)
(1,708 missing values generated)
(1,839 missing values generated)
(1,758 missing values generated)
(1,917 missing values generated)
(1,740 missing values generated)
(1,689 missing values generated)
(403 missing values generated)
(1,363 missing values generated)
(1,706 missing values generated)
(1,868 missing values generated)
(1,931 missing values generated)
(1,957 missing values generated)
(1,722 missing values generated)
(1,654 missing values generated)
(1,817 missing values generated)
(1,735 missing values generated)
(1,899 missing values generated)
(1,690 missing values generated)
(1,633 missing values generated)
(219 missing values generated)
(1,275 missing values generated)
(1,602 missing values generated)
(1,858 missing values generated)
(1,920 missing values generated)
(1,956 missing values generated)
(1,659 missing values generated)
(1,948 missing values generated)
(1,948 missing values generated)
(1,957 missing values generated)
(1,315 missing values generated)
(1,315 missing values generated)
(766 missing values generated)
(949 missing values generated)
(650 missing values generated)
(398 missing values generated)
(1,952 missing values generated)
(1,938 missing values generated)
(1,600 missing values generated)
(851 missing values generated)
(1,957 missing values generated)
(1,951 missing values generated)
(1,120 missing values generated)
(504 missing values generated)
(329 missing values generated)
(969 missing values generated)
(711 missing values generated)
(774 missing values generated)
(774 missing values generated)
(774 missing values generated)
(766 missing values generated)
(766 missing values generated)
(766 missing values generated)

. 
. ***Variables ending in _date that are numeric
. foreach var of varlist *_date {
  2.     capture confirm string variable `var'
  3.     if _rc != 0 {
  4.         format `var' %td
  5.     }
  6. }

. 
. ***Create binary indicator for each
. ds *_date
eia_code_d~e  copd_befor~e  frac_befor~e  solid_ca_a~e  rf_date       r~eappt_date  metho~j_date  rtt_op_end~e
ra_code_date  cva_before~e  dem_before~e  haem_ca_af~e  bmi_date      rheum~e_date  sulfasalaz~e
psa_code_d~e  lung_ca_be~e  chd_after_~e  ckd_after_~e  r~_appt_date  ~erheum_date  hydroxychl~e
anksp_code~e  solid_ca_b~e  dm_after_d~e  depr_after~e  rheum~f_date  l~ecode_date  rtt_cl_sta~e
undiff_cod~e  haem_ca_be~e  ild_after_~e  osteop_aft~e  rheum~y_date  ~frheum_date  rtt_cl_ref~e
chd_before~e  ckd_before~e  copd_after~e  frac_after~e  rheum~2_date  l~fcode_date  rtt_cl_end~e
dm_before_~e  depr_befor~e  cva_after_~e  dem_after_~e  rheum~3_date  leflunomid~e  rtt_op_sta~e
ild_before~e  osteop_bef~e  lung_ca_af~e  creatinin~te  rheum~4_date  metho~e_date  rtt_op_ref~e

. local dates `r(varlist)'

. foreach var of local dates {
  2.         local newvar =  substr("`var'", 1, length("`var'") - 5)
  3.         gen `newvar' = (`var'!=. )
  4.         order `newvar', after(`var')
  5. }

. 
. /*
> **Will also need to amend conversion for biologic dates ====================================================*
> ***Some dates are given with month/year only, so adding day 15 to enable them to be processed as dates 
> 
> foreach var of varlist   abatacept_date                                         ///
>                                                  adalimumab_date                                        ///     
>                                                  baricitinib_date                                       ///
>                                                  certolizumab_date                                      ///
>                                                  etanercept_date                                        ///
>                                                  golimumab_date                                         ///
>                                                  guselkumab_date                                        ///     
>                                                  infliximab_date                                        ///
>                                                  ixekizumab_date                                        ///
>                                                  methotrexate_hcd_date                          ///
>                                                  rituximab_date                                         ///
>                                                  sarilumab_date                                         ///
>                                                  secukinumab_date                                       ///     
>                                                  tocilizumab_date                                       ///
>                                                  tofacitinib_date                                       ///
>                                                  upadacitinib_date                                      ///
>                                                  ustekinumab_date                                       ///
>                                                  {
>                                                         
>                 capture confirm string variable `var'
>                 if _rc!=0 {
>                         assert `var'==.
>                         rename `var' `var'_date
>                 }
>         
>                 else {
>                                 replace `var' = `var' + "-15"
>                                 rename `var' `var'_dstr
>                                 replace `var'_dstr = " " if `var'_dstr == "-15"
>                                 gen `var'_date = date(`var'_dstr, "YMD") 
>                                 order `var'_date, after(`var'_dstr)
>                                 drop `var'_dstr
>                 }
>         
>         format `var'_date %td
> }
> */
.                                          
. **Create and label variables ===========================================================*/
. 
. ***Age variables
. *Create categorised age
. drop if age<18 & age !=.
(0 observations deleted)

. drop if age>109 & age !=.
(0 observations deleted)

. drop if age==.
(0 observations deleted)

. lab var age "Age at diagnosis"

. 
. recode age 18/39.9999 = 1 /// 
>            40/49.9999 = 2 ///
>                    50/59.9999 = 3 ///
>                60/69.9999 = 4 ///
>                    70/79.9999 = 5 ///
>                    80/max = 6, gen(agegroup) 
(1,958 differences between age and agegroup)

. 
. label define agegroup   1 "18-39" ///
>                                                 2 "40-49" ///
>                                                 3 "50-59" ///
>                                                 4 "60-69" ///
>                                                 5 "70-79" ///
>                                                 6 "80+"

.                                                 
. label values agegroup agegroup

. lab var agegroup "Age group"

. tab agegroup, missing

  Age group |      Freq.     Percent        Cum.
------------+-----------------------------------
      18-39 |        832       42.49       42.49
      40-49 |        283       14.45       56.95
      50-59 |        282       14.40       71.35
      60-69 |        198       10.11       81.46
      70-79 |        150        7.66       89.12
        80+ |        213       10.88      100.00
------------+-----------------------------------
      Total |      1,958      100.00

. order agegroup, after(age)

. 
. ***Sex
. gen male = 1 if sex == "male"
(986 missing values generated)

. replace male = 0 if sex == "female"
(986 real changes made)

. lab var male "Male"

. lab define male 0 "No" 1 "Yes", modify

. lab val male male

. tab male, missing

       Male |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        986       50.36       50.36
        Yes |        972       49.64      100.00
------------+-----------------------------------
      Total |      1,958      100.00

. order male, after(sex)

. 
. ***Ethnicity
. gen ethnicity_n = 1 if ethnicity == "White"
(1,762 missing values generated)

. replace ethnicity_n = 2 if ethnicity == "Asian or Asian British"
(123 real changes made)

. replace ethnicity_n = 3 if ethnicity == "Black or Black British"
(135 real changes made)

. replace ethnicity_n = 4 if ethnicity == "Mixed"
(94 real changes made)

. replace ethnicity_n = 5 if ethnicity == "Chinese or Other Ethnic Groups"
(209 real changes made)

. replace ethnicity_n = 6 if ethnicity == "Unknown"
(1,201 real changes made)

. 
. 
. label define ethnicity_n        1 "White"                                               ///
>                                                         2 "Asian or Asian British"              ///
>                                                         3 "Black or Black British"      ///
>                                                         4 "Mixed"                                               ///
>                                                         5 "Chinese or Other Ethnic Groups" ///
>                                                         6 "Not known", modify

.                                                         
. label values ethnicity_n ethnicity_n

. lab var ethnicity_n "Ethnicity"

. tab ethnicity_n, missing

                     Ethnicity |      Freq.     Percent        Cum.
-------------------------------+-----------------------------------
                         White |        196       10.01       10.01
        Asian or Asian British |        123        6.28       16.29
        Black or Black British |        135        6.89       23.19
                         Mixed |         94        4.80       27.99
Chinese or Other Ethnic Groups |        209       10.67       38.66
                     Not known |      1,201       61.34      100.00
-------------------------------+-----------------------------------
                         Total |      1,958      100.00

. drop ethnicity

. rename ethnicity_n ethnicity 

. 
. ***Practice regions
. encode region, gen(nuts_region)

. tab region, missing

                  region |      Freq.     Percent        Cum.
-------------------------+-----------------------------------
                    East |        214       10.93       10.93
           East Midlands |        202       10.32       21.25
                  London |        204       10.42       31.66
              North East |        228       11.64       43.31
              North West |        213       10.88       54.19
              South East |        214       10.93       65.12
              South West |        223       11.39       76.51
           West Midlands |        221       11.29       87.79
Yorkshire and The Humber |        239       12.21      100.00
-------------------------+-----------------------------------
                   Total |      1,958      100.00

. replace region="Not known" if region==""
(0 real changes made)

. gen region_nospace=region

. replace region_nospace="SouthWest" if region=="South West"
(223 real changes made)

. replace region_nospace="EastMidlands" if region=="East Midlands"
(202 real changes made)

. replace region_nospace="East" if region=="East"
(0 real changes made)

. replace region_nospace="London" if region=="London"
(0 real changes made)

. replace region_nospace="NorthEast" if region=="North East"
(228 real changes made)

. replace region_nospace="NorthWest" if region=="North West"
(213 real changes made)

. replace region_nospace="SouthEast" if region=="South East"
(214 real changes made)

. replace region_nospace="WestMidlands" if region=="West Midlands"
(221 real changes made)

. replace region_nospace="YorkshireandTheHumber" if region=="Yorkshire and The Humber"
(239 real changes made)

. 
. ***IMD
. gen imd = 1 if imd_quintile == "1 (most deprived)"
(1,582 missing values generated)

. replace imd = 2 if imd_quintile == "2"
(384 real changes made)

. replace imd = 3 if imd_quintile == "3"
(352 real changes made)

. replace imd = 4 if imd_quintile == "4"
(362 real changes made)

. replace imd = 5 if imd_quintile == "5 (least deprived)"
(369 real changes made)

. replace imd = .u if imd_quintile == "Unknown"
(115 real changes made, 115 to missing)

. lab var imd "Index of multiple deprivation"

. lab define imd 1 "1 (most deprived)" ///
>                            2 "2" ///
>                            3 "3" ///
>                            4 "4" ///
>                            5 "5 (least deprived)" ///
>                            .u "Not known"

. lab val imd imd                    

. tab imd, missing

 Index of multiple |
       deprivation |      Freq.     Percent        Cum.
-------------------+-----------------------------------
 1 (most deprived) |        376       19.20       19.20
                 2 |        384       19.61       38.82
                 3 |        352       17.98       56.79
                 4 |        362       18.49       75.28
5 (least deprived) |        369       18.85       94.13
         Not known |        115        5.87      100.00
-------------------+-----------------------------------
             Total |      1,958      100.00

. drop imd_quintile

. 
. ***Body Mass Index
. *Recode strange values 
. replace bmi_value = . if bmi_value == 0 
(0 real changes made)

. replace bmi_value = . if !inrange(bmi_value, 10, 80)
(0 real changes made)

. 
. *Restrict to within 10 years of EIA diagnosis date and aged>16 
. gen bmi_time = (eia_code_date - bmi_date)/365.25
(1,957 missing values generated)

. gen bmi_age = age - bmi_time
(1,957 missing values generated)

. replace bmi_value = . if bmi_age < 16 
(0 real changes made)

. replace bmi_value = . if bmi_time > 10 & bmi_time != . 
(0 real changes made)

. 
. *Set to missing if no date, and vice versa 
. replace bmi_value = . if bmi_date == . 
(0 real changes made)

. replace bmi_date = . if bmi_value == . 
(0 real changes made)

. replace bmi_time = . if bmi_value == . 
(0 real changes made)

. replace bmi_age = . if bmi_value == . 
(0 real changes made)

. 
. *Create BMI categories
. gen     bmicat = .
(1,958 missing values generated)

. recode  bmicat . = 1 if bmi_value < 18.5
(0 changes made to bmicat)

. recode  bmicat . = 2 if bmi_value < 25
(1 changes made to bmicat)

. recode  bmicat . = 3 if bmi_value < 30
(0 changes made to bmicat)

. recode  bmicat . = 4 if bmi_value < 35
(0 changes made to bmicat)

. recode  bmicat . = 5 if bmi_value < 40
(0 changes made to bmicat)

. recode  bmicat . = 6 if bmi_value < .
(0 changes made to bmicat)

. replace bmicat = .u if bmi_value >= .
(1,957 real changes made, 1,957 to missing)

. 
. label define bmicat 1 "Underweight (<18.5)"     ///
>                                         2 "Normal (18.5-24.9)"          ///
>                                         3 "Overweight (25-29.9)"        ///
>                                         4 "Obese I (30-34.9)"           ///
>                                         5 "Obese II (35-39.9)"          ///
>                                         6 "Obese III (40+)"                     ///
>                                         .u "Not known"

.                                         
. label values bmicat bmicat

. lab var bmicat "BMI"

. tab bmicat, missing

                 BMI |      Freq.     Percent        Cum.
---------------------+-----------------------------------
  Normal (18.5-24.9) |          1        0.05        0.05
           Not known |      1,957       99.95      100.00
---------------------+-----------------------------------
               Total |      1,958      100.00

. order bmicat, after (bmi_value)

. drop bmi_age bmi_time

. 
. *Create less granular categorisation
. recode bmicat 1/3 .u = 1 4 = 2 5 = 3 6 = 4, gen(obese4cat)
(1,958 differences between bmicat and obese4cat)

. 
. label define obese4cat  1 "No record of obesity"        ///
>                                                 2 "Obese I (30-34.9)"           ///
>                                                 3 "Obese II (35-39.9)"          ///
>                                                 4 "Obese III (40+)"             

. 
. label values obese4cat obese4cat

. order obese4cat, after(bmicat)

. 
. ***Smoking 
. label define smoke 1 "Never" 2 "Former" 3 "Current" .u "Not known"

. 
. gen     smoke = 1  if smoking_status == "N"
(1,929 missing values generated)

. replace smoke = 2  if smoking_status == "E"
(760 real changes made)

. replace smoke = 3  if smoking_status == "S"
(1,165 real changes made)

. replace smoke = .u if smoking_status == "M"
(4 real changes made, 4 to missing)

. replace smoke = .u if smoking_status == "" 
(0 real changes made)

. 
. label values smoke smoke

. lab var smoke "Smoking status"

. drop smoking_status

. tab smoke, missing

    Smoking |
     status |      Freq.     Percent        Cum.
------------+-----------------------------------
      Never |         29        1.48        1.48
     Former |        760       38.82       40.30
    Current |      1,165       59.50       99.80
  Not known |          4        0.20      100.00
------------+-----------------------------------
      Total |      1,958      100.00

. 
. *Create non-missing 3-category variable for current smoking (assumes missing smoking is never smoking)
. recode smoke .u = 1, gen(smoke_nomiss)
(4 differences between smoke and smoke_nomiss)

. order smoke_nomiss, after(smoke)

. label values smoke_nomiss smoke

. 
. **Clinical comorbidities
. ***Nb. not using creatinine of HBA1c values for now, just codes
. foreach disease in ckd dm ild copd cva lung_ca solid_ca haem_ca depr osteop frac dem chd {
  2.         label define `disease'_before 0 "No" 1 "Yes"
  3.         label values `disease'_before `disease'_before
  4.         tab `disease'_before, missing
  5.         label define `disease'_after 0 "No" 1 "Yes"
  6.         label values `disease'_after `disease'_after
  7.         tab `disease'_after, missing
  8.         gen `disease'_new = 1 if (`disease'_after == 1 & `disease'_before == 0)
  9.         recode `disease'_new .=0
 10.         label define `disease'_new 0 "No" 1 "Yes"
 11.         label values `disease'_new `disease'_new
 12.         tab `disease'_new, missing
 13.         order `disease'_new, after(`disease'_after)
 14. }

 ckd_before |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,706       87.13       87.13
        Yes |        252       12.87      100.00
------------+-----------------------------------
      Total |      1,958      100.00

  ckd_after |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,602       81.82       81.82
        Yes |        356       18.18      100.00
------------+-----------------------------------
      Total |      1,958      100.00
(1,642 missing values generated)
(1,642 changes made to ckd_new)

    ckd_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,642       83.86       83.86
        Yes |        316       16.14      100.00
------------+-----------------------------------
      Total |      1,958      100.00

  dm_before |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,839       93.92       93.92
        Yes |        119        6.08      100.00
------------+-----------------------------------
      Total |      1,958      100.00

   dm_after |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,817       92.80       92.80
        Yes |        141        7.20      100.00
------------+-----------------------------------
      Total |      1,958      100.00
(1,822 missing values generated)
(1,822 changes made to dm_new)

     dm_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,822       93.05       93.05
        Yes |        136        6.95      100.00
------------+-----------------------------------
      Total |      1,958      100.00

 ild_before |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,758       89.79       89.79
        Yes |        200       10.21      100.00
------------+-----------------------------------
      Total |      1,958      100.00

  ild_after |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,735       88.61       88.61
        Yes |        223       11.39      100.00
------------+-----------------------------------
      Total |      1,958      100.00
(1,752 missing values generated)
(1,752 changes made to ild_new)

    ild_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,752       89.48       89.48
        Yes |        206       10.52      100.00
------------+-----------------------------------
      Total |      1,958      100.00

copd_before |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,917       97.91       97.91
        Yes |         41        2.09      100.00
------------+-----------------------------------
      Total |      1,958      100.00

 copd_after |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,899       96.99       96.99
        Yes |         59        3.01      100.00
------------+-----------------------------------
      Total |      1,958      100.00
(1,899 missing values generated)
(1,899 changes made to copd_new)

   copd_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,899       96.99       96.99
        Yes |         59        3.01      100.00
------------+-----------------------------------
      Total |      1,958      100.00

 cva_before |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,740       88.87       88.87
        Yes |        218       11.13      100.00
------------+-----------------------------------
      Total |      1,958      100.00

  cva_after |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,690       86.31       86.31
        Yes |        268       13.69      100.00
------------+-----------------------------------
      Total |      1,958      100.00
(1,718 missing values generated)
(1,718 changes made to cva_new)

    cva_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,718       87.74       87.74
        Yes |        240       12.26      100.00
------------+-----------------------------------
      Total |      1,958      100.00

lung_ca_bef |
        ore |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,689       86.26       86.26
        Yes |        269       13.74      100.00
------------+-----------------------------------
      Total |      1,958      100.00

lung_ca_aft |
         er |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,633       83.40       83.40
        Yes |        325       16.60      100.00
------------+-----------------------------------
      Total |      1,958      100.00
(1,663 missing values generated)
(1,663 changes made to lung_ca_new)

lung_ca_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,663       84.93       84.93
        Yes |        295       15.07      100.00
------------+-----------------------------------
      Total |      1,958      100.00

solid_ca_be |
       fore |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        403       20.58       20.58
        Yes |      1,555       79.42      100.00
------------+-----------------------------------
      Total |      1,958      100.00

solid_ca_af |
        ter |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        219       11.18       11.18
        Yes |      1,739       88.82      100.00
------------+-----------------------------------
      Total |      1,958      100.00
(1,597 missing values generated)
(1,597 changes made to solid_ca_new)

solid_ca_ne |
          w |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,597       81.56       81.56
        Yes |        361       18.44      100.00
------------+-----------------------------------
      Total |      1,958      100.00

haem_ca_bef |
        ore |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,363       69.61       69.61
        Yes |        595       30.39      100.00
------------+-----------------------------------
      Total |      1,958      100.00

haem_ca_aft |
         er |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,275       65.12       65.12
        Yes |        683       34.88      100.00
------------+-----------------------------------
      Total |      1,958      100.00
(1,459 missing values generated)
(1,459 changes made to haem_ca_new)

haem_ca_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,459       74.51       74.51
        Yes |        499       25.49      100.00
------------+-----------------------------------
      Total |      1,958      100.00

depr_before |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,868       95.40       95.40
        Yes |         90        4.60      100.00
------------+-----------------------------------
      Total |      1,958      100.00

 depr_after |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,858       94.89       94.89
        Yes |        100        5.11      100.00
------------+-----------------------------------
      Total |      1,958      100.00
(1,866 missing values generated)
(1,866 changes made to depr_new)

   depr_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,866       95.30       95.30
        Yes |         92        4.70      100.00
------------+-----------------------------------
      Total |      1,958      100.00

osteop_befo |
         re |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,931       98.62       98.62
        Yes |         27        1.38      100.00
------------+-----------------------------------
      Total |      1,958      100.00

osteop_afte |
          r |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,920       98.06       98.06
        Yes |         38        1.94      100.00
------------+-----------------------------------
      Total |      1,958      100.00
(1,920 missing values generated)
(1,920 changes made to osteop_new)

 osteop_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,920       98.06       98.06
        Yes |         38        1.94      100.00
------------+-----------------------------------
      Total |      1,958      100.00

frac_before |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,957       99.95       99.95
        Yes |          1        0.05      100.00
------------+-----------------------------------
      Total |      1,958      100.00

 frac_after |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,956       99.90       99.90
        Yes |          2        0.10      100.00
------------+-----------------------------------
      Total |      1,958      100.00
(1,956 missing values generated)
(1,956 changes made to frac_new)

   frac_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,956       99.90       99.90
        Yes |          2        0.10      100.00
------------+-----------------------------------
      Total |      1,958      100.00

 dem_before |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,722       87.95       87.95
        Yes |        236       12.05      100.00
------------+-----------------------------------
      Total |      1,958      100.00

  dem_after |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,659       84.73       84.73
        Yes |        299       15.27      100.00
------------+-----------------------------------
      Total |      1,958      100.00
(1,689 missing values generated)
(1,689 changes made to dem_new)

    dem_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,689       86.26       86.26
        Yes |        269       13.74      100.00
------------+-----------------------------------
      Total |      1,958      100.00

 chd_before |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,708       87.23       87.23
        Yes |        250       12.77      100.00
------------+-----------------------------------
      Total |      1,958      100.00

  chd_after |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,654       84.47       84.47
        Yes |        304       15.53      100.00
------------+-----------------------------------
      Total |      1,958      100.00
(1,685 missing values generated)
(1,685 changes made to chd_new)

    chd_new |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,685       86.06       86.06
        Yes |        273       13.94      100.00
------------+-----------------------------------
      Total |      1,958      100.00

. 
. lab var ckd_before "Chronic kidney disease"

. lab var ckd_after "Chronic kidney disease"

. lab var ckd_new "Chronic kidney disease"

. lab var dm_before "Type 2 diabetes mellitus"

. lab var dm_after "Type 2 diabetes mellitus"

. lab var dm_new "Type 2 diabetes mellitus"

. lab var ild_before "Interstitial lung disease"

. lab var ild_after "Interstitial lung disease"

. lab var ild_new "Interstitial lung disease"

. lab var copd_before "COPD"

. lab var copd_after "COPD"

. lab var copd_new "COPD"

. lab var lung_ca_before "Lung cancer"

. lab var lung_ca_after "Lung cancer"

. lab var lung_ca_new "Lung cancer"

. lab var solid_ca_before "Solid organ cancer"

. lab var solid_ca_after "Solid organ cancer"

. lab var solid_ca_new "Solid organ cancer"

. lab var haem_ca_before "Haematological cancer"

. lab var haem_ca_after "Haematological cancer"

. lab var haem_ca_new "Haematological cancer"

. lab var depr_before "Depression"

. lab var depr_after "Depression"

. lab var depr_new "Depression"

. lab var osteop_before "Osteoporosis"

. lab var osteop_after "Osteoporosis"

. lab var osteop_new "Osteoporosis"

. lab var frac_before "Fragility fracture"

. lab var frac_after "Fragility fracture"

. lab var frac_new "Fragility fracture"

. lab var dem_before "Dementia"

. lab var dem_after "Dementia"

. lab var dem_new "Dementia"

. lab var chd_before "Coronary heart disease"

. lab var chd_after "Coronary heart disease"

. lab var chd_new "Coronary heart disease"

. 
. lab var rheum_appt "Rheumatology appointment"

. lab define rheum_appt 0 "No" 1 "Yes", modify

. lab val rheum_appt rheum_appt

. 
. **All patients should have diagnostic code=============================================================*/
. tab eia_code, missing

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,958      100.00      100.00
------------+-----------------------------------
      Total |      1,958      100.00

. keep if eia_code==1
(0 observations deleted)

. 
. **Check first rheum appt date was before diagnostic code date==================================*/
. 
. tab rheum_appt, missing //proportion of patients with an rheum outpatient date (with first attendance option selected) 
> in the 12 months before EIA code appeared in GP record; data only April 2019 onwards

Rheumatolog |
          y |
appointment |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,315       67.16       67.16
        Yes |        643       32.84      100.00
------------+-----------------------------------
      Total |      1,958      100.00

. tab rheum_appt if rheum_appt_date>eia_code_date & rheum_appt_date!=. //confirm proportion who had first rheum appt (i.e
> . not missing) after EIA code

Rheumatolog |
          y |
appointment |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         94      100.00      100.00
------------+-----------------------------------
      Total |         94      100.00

. tab rheum_appt if rheum_appt_date>(eia_code_date + 30) & rheum_appt_date!=. //confirm proportion who had first rheum ap
> pt 30 days after EIA code 

Rheumatolog |
          y |
appointment |      Freq.     Percent        Cum.
------------+-----------------------------------
        Yes |         53      100.00      100.00
------------+-----------------------------------
      Total |         53      100.00

. tab rheum_appt if rheum_appt_date>(eia_code_date + 60) & rheum_appt_date!=. //confirm proportion who had first rheum ap
> pt 60 days after EIA code - should be none
no observations

. replace rheum_appt=0 if rheum_appt_date>(eia_code_date + 60) & rheum_appt_date!=. //replace as missing if first appt >6
> 0 days after EIA code - should be none
(0 real changes made)

. replace rheum_appt_date=. if rheum_appt_date>(eia_code_date + 60) & rheum_appt_date!=. //replace as missing if first ap
> pt >60 days after EIA code - should be none
(0 real changes made)

. 
. **As above - for differently specified rheumatology appointments
. replace rheum_appt_any=0 if rheum_appt_any_date>(eia_code_date + 60) & rheum_appt_any_date!=. //replace as missing thos
> e appts >60 days after EIA code
(0 real changes made)

. replace rheum_appt_any_date=. if rheum_appt_any_date>(eia_code_date + 60) & rheum_appt_any_date!=. //replace as missing
>  those appts >60 days after EIA code
(0 real changes made)

. replace rheum_appt2=0 if rheum_appt2_date>(eia_code_date + 60) & rheum_appt2_date!=. //replace as missing those appts >
> 60 days after EIA code
(0 real changes made)

. replace rheum_appt2_date=. if rheum_appt2_date>(eia_code_date + 60) & rheum_appt2_date!=. //replace as missing those ap
> pts >60 days after EIA code_yea
(0 real changes made)

. replace rheum_appt3=0 if rheum_appt3_date>(eia_code_date + 60) & rheum_appt3_date!=. //replace as missing those appts >
> 60 days after EIA code
(0 real changes made)

. replace rheum_appt3_date=. if rheum_appt3_date>(eia_code_date + 60) & rheum_appt3_date!=. //replace as missing those ap
> pts >60 days after EIA code
(0 real changes made)

. replace rheum_appt4=0 if rheum_appt4_date>(eia_code_date + 60) & rheum_appt4_date!=. //replace as missing those appts >
> 60 days after EIA code - THIS IS AN IMPORTANT ONE TO CHECK
(252 real changes made)

. replace rheum_appt4_date=. if rheum_appt4_date>(eia_code_date + 60) & rheum_appt4_date!=. //replace as missing those ap
> pts >60 days after EIA code
(252 real changes made, 252 to missing)

. 
. *Check if first csDMARD/biologic was after rheum appt date=====================================================*/
. **csDMARDs (not including high cost MTX; wouldn't be shared care)
. gen csdmard=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | methotrexate_inj==1 | sulfasalazine==1
(124 missing values generated)

. recode csdmard .=0 
(124 changes made to csdmard)

. tab csdmard, missing

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        124        6.33        6.33
          1 |      1,834       93.67      100.00
------------+-----------------------------------
      Total |      1,958      100.00

. 
. **Date of first csDMARD script (not including high cost MTX prescriptions)
. gen csdmard_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_date, methotrexate_inj_date, sulfasalazine
> _date)
(124 missing values generated)

. format %td csdmard_date

. 
. /*
> **csDMARDs (including high cost MTX)
> gen csdmard_hcd=1 if hydroxychloroquine==1 | leflunomide==1 | methotrexate==1 | methotrexate_inj==1 | methotrexate_hcd=
> =1 | sulfasalazine==1
> recode csdmard_hcd .=0 
> tab csdmard_hcd, missing
> 
> **Date of first csDMARD script (including high cost MTX prescriptions)
> gen csdmard_hcd_date=min(hydroxychloroquine_date, leflunomide_date, methotrexate_date, methotrexate_inj_date, methotrex
> ate_hcd_date, sulfasalazine_date)
> format %td csdmard_hcd_date
> 
> **Biologic use
> gen biologic=1 if abatacept==1 | adalimumab==1 | baricitinib==1 | certolizumab==1 | etanercept==1 | golimumab==1 | guse
> lkumab==1 | infliximab==1 | ixekizumab==1 | rituximab==1 | sarilumab==1 | secukinumab==1 | tocilizumab==1 | tofacitinib
> ==1 | upadacitinib==1 | ustekinumab==1 
> recode biologic .=0
> tab biologic, missing
> 
> **Date of first biologic script
> gen biologic_date=min(abatacept_date, adalimumab_date, baricitinib_date, certolizumab_date, etanercept_date, golimumab_
> date, guselkumab_date, infliximab_date, ixekizumab_date, rituximab_date, sarilumab_date, secukinumab_date, tocilizumab_
> date, tofacitinib_date, upadacitinib_date, ustekinumab_date)
> format %td biologic_date
> */
. 
. **Exclude if first csdmard was more than 60 days before first rheum appt
. tab csdmard if rheum_appt_date!=. & csdmard_date!=. & csdmard_date<rheum_appt_date

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        541      100.00      100.00
------------+-----------------------------------
      Total |        541      100.00

. tab csdmard if rheum_appt_date!=. & csdmard_date!=. & (csdmard_date + 60)<rheum_appt_date 

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        522      100.00      100.00
------------+-----------------------------------
      Total |        522      100.00

. drop if rheum_appt_date!=. & csdmard_date!=. & (csdmard_date + 60)<rheum_appt_date //drop if first csDMARD more than 60
>  days before first attendance at a rheum appt 
(522 observations deleted)

. tab csdmard if rheum_appt_date==. & rheum_appt_any_date!=. & csdmard_date!=. & (csdmard_date + 60)<rheum_appt_any_date

    csdmard |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |        395      100.00      100.00
------------+-----------------------------------
      Total |        395      100.00

. drop if rheum_appt_date==. & rheum_appt_any_date!=. & csdmard_date!=. & (csdmard_date + 60)<rheum_appt_any_date //drop 
> if first csDMARD more than 60 days before first captured rheum appt that did not have first attendance tag
(395 observations deleted)

. 
. /*
> tab biologic if rheum_appt_date!=. & biologic_date!=. & biologic_date<rheum_appt_date 
> tab biologic if rheum_appt_date!=. & biologic_date!=. & (biologic_date + 60)<rheum_appt_date 
> drop if rheum_appt_date!=. & biologic_date!=. & (biologic_date + 60)<rheum_appt_date //drop if first biologic more than
>  60 days before first rheum_appt_date
> tab biologic if rheum_appt_date==. & rheum_appt_any_date!=. & biologic_date!=. & (biologic_date + 60)<rheum_appt_any_da
> te
> drop if rheum_appt_date==. & rheum_appt_any_date!=. & biologic_date!=. & (biologic_date + 60)<rheum_appt_any_date //dro
> p if first biologic more than 60 days before first captured rheum appt that did not have first attendance tag
> */
. 
. *Generate diagnosis date===============================================================*/
. 
. **Use diagnostic code date (in GP record) as diagnosis date
. gen diagnosis_date=eia_code_date

. format diagnosis_date %td

. 
. *Refine diagnostic window=============================================================*/
. 
. **Keep patients with diagnosis date after start date and before end date - should be none dropped
. keep if diagnosis_date>=date("$start_date", "DMY") & diagnosis_date!=. 
(0 observations deleted)

. tab eia_code, missing

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,041      100.00      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. keep if diagnosis_date<=date("$end_date", "DMY") & diagnosis_date!=. 
(0 observations deleted)

. tab eia_code, missing

   eia_code |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,041      100.00      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. 
. *Include only most recent EIA sub-diagnosis=============================================*/
. replace ra_code =0 if psa_code_date > ra_code_date & psa_code_date !=.
(9 real changes made)

. replace ra_code =0 if anksp_code_date > ra_code_date & anksp_code_date !=.
(7 real changes made)

. replace ra_code =0 if undiff_code_date > ra_code_date & undiff_code_date !=.
(2 real changes made)

. replace psa_code =0 if ra_code_date >= psa_code_date & ra_code_date !=.
(8 real changes made)

. replace psa_code =0 if anksp_code_date > psa_code_date & anksp_code_date !=.
(0 real changes made)

. replace psa_code =0 if undiff_code_date > psa_code_date & undiff_code_date !=.
(0 real changes made)

. replace anksp_code =0 if psa_code_date >= anksp_code_date & psa_code_date !=.
(1 real change made)

. replace anksp_code =0 if ra_code_date >= anksp_code_date & ra_code_date !=.
(7 real changes made)

. replace anksp_code =0 if undiff_code_date > anksp_code_date & undiff_code_date !=.
(0 real changes made)

. replace undiff_code =0 if ra_code_date >= undiff_code_date & ra_code_date !=.
(0 real changes made)

. replace undiff_code =0 if psa_code_date >= undiff_code_date & psa_code_date !=.
(1 real change made)

. replace undiff_code =0 if anksp_code_date >= undiff_code_date & anksp_code_date !=.
(0 real changes made)

. gen eia_diagnosis=1 if ra_code==1
(198 missing values generated)

. replace eia_diagnosis=2 if psa_code==1
(110 real changes made)

. replace eia_diagnosis=3 if anksp_code==1
(72 real changes made)

. replace eia_diagnosis=4 if undiff_code==1
(16 real changes made)

. lab define eia_diagnosis 1 "RA" 2 "PsA" 3 "AxSpA" 4 "Undiff IA", modify

. lab val eia_diagnosis eia_diagnosis

. tab eia_diagnosis, missing

eia_diagnos |
         is |      Freq.     Percent        Cum.
------------+-----------------------------------
         RA |        843       80.98       80.98
        PsA |        110       10.57       91.55
      AxSpA |         72        6.92       98.46
  Undiff IA |         16        1.54      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. drop if eia_diagnosis==. //should be none
(0 observations deleted)

. 
. decode eia_diagnosis, gen(eia_diag)

. replace eia_diag="Undiff_IA" if eia_diagnosis==4
(16 real changes made)

. 
. *Split into time windows=========================================*/
. 
. **Month/Year of GP diagnostic code
. gen year_diag=year(eia_code_date)

. format year_diag %ty

. gen month_diag=month(eia_code_date)

. gen mo_year_diagn=ym(year_diag, month_diag)

. format mo_year_diagn %tmMon-CCYY

. generate str16 mo_year_diagn_s = strofreal(mo_year_diagn,"%tmCCYY!mNN")

. lab var mo_year_diagn "Month/Year of Diagnosis"

. lab var mo_year_diagn_s "Month/Year of Diagnosis"

. 
. **Month/Year of rheum appt
. gen year_appt=year(rheum_appt_date) if rheum_appt_date!=.
(920 missing values generated)

. format year_appt %ty

. gen month_appt=month(rheum_appt_date) if rheum_appt_date!=. 
(920 missing values generated)

. gen mo_year_appt=ym(year_appt, month_appt)
(920 missing values generated)

. format mo_year_appt %tmMon-CCYY

. generate str16 mo_year_appt_s = strofreal(mo_year_appt,"%tmCCYY!mNN")

. 
. **Separate into 3-month time windows (for diagnosis date)
. gen diagnosis_3m = qofd(diagnosis_date)

. format diagnosis_3m %tq

. lab var diagnosis_3m "Time period for diagnosis"

. tab diagnosis_3m, missing

Time period |
        for |
  diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
     2016q2 |          5        0.48        0.48
     2016q3 |          3        0.29        0.77
     2016q4 |          6        0.58        1.34
     2017q1 |          2        0.19        1.54
     2017q2 |          6        0.58        2.11
     2017q3 |          8        0.77        2.88
     2017q4 |          6        0.58        3.46
     2018q1 |          4        0.38        3.84
     2018q2 |          4        0.38        4.23
     2018q3 |          6        0.58        4.80
     2018q4 |          5        0.48        5.28
     2019q1 |          7        0.67        5.96
     2019q2 |          9        0.86        6.82
     2019q3 |          9        0.86        7.68
     2019q4 |         10        0.96        8.65
     2020q1 |          2        0.19        8.84
     2020q2 |         10        0.96        9.80
     2020q3 |          7        0.67       10.47
     2020q4 |         21        2.02       12.49
     2021q1 |         14        1.34       13.83
     2021q2 |         10        0.96       14.79
     2021q3 |         19        1.83       16.62
     2021q4 |         11        1.06       17.68
     2022q1 |         22        2.11       19.79
     2022q2 |         34        3.27       23.05
     2022q3 |         34        3.27       26.32
     2022q4 |         43        4.13       30.45
     2023q1 |         51        4.90       35.35
     2023q2 |         50        4.80       40.15
     2023q3 |         79        7.59       47.74
     2023q4 |         70        6.72       54.47
     2024q1 |         90        8.65       63.11
     2024q2 |         80        7.68       70.80
     2024q3 |         88        8.45       79.25
     2024q4 |        106       10.18       89.43
     2025q1 |        110       10.57      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. bys eia_diagnosis: tab diagnosis_3m, missing

-------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

Time period |
        for |
  diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
     2016q2 |          4        0.47        0.47
     2016q3 |          3        0.36        0.83
     2016q4 |          6        0.71        1.54
     2017q1 |          1        0.12        1.66
     2017q2 |          4        0.47        2.14
     2017q3 |          5        0.59        2.73
     2017q4 |          5        0.59        3.32
     2018q1 |          4        0.47        3.80
     2018q2 |          3        0.36        4.15
     2018q3 |          6        0.71        4.86
     2018q4 |          3        0.36        5.22
     2019q1 |          6        0.71        5.93
     2019q2 |          7        0.83        6.76
     2019q3 |          6        0.71        7.47
     2019q4 |          8        0.95        8.42
     2020q1 |          1        0.12        8.54
     2020q2 |          5        0.59        9.13
     2020q3 |          5        0.59        9.73
     2020q4 |         18        2.14       11.86
     2021q1 |         10        1.19       13.05
     2021q2 |         10        1.19       14.23
     2021q3 |         15        1.78       16.01
     2021q4 |          8        0.95       16.96
     2022q1 |         20        2.37       19.34
     2022q2 |         24        2.85       22.18
     2022q3 |         28        3.32       25.50
     2022q4 |         30        3.56       29.06
     2023q1 |         41        4.86       33.93
     2023q2 |         42        4.98       38.91
     2023q3 |         63        7.47       46.38
     2023q4 |         64        7.59       53.97
     2024q1 |         66        7.83       61.80
     2024q2 |         70        8.30       70.11
     2024q3 |         75        8.90       79.00
     2024q4 |         89       10.56       89.56
     2025q1 |         88       10.44      100.00
------------+-----------------------------------
      Total |        843      100.00

-------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

Time period |
        for |
  diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
     2016q2 |          1        0.91        0.91
     2017q1 |          1        0.91        1.82
     2017q2 |          2        1.82        3.64
     2017q3 |          1        0.91        4.55
     2017q4 |          1        0.91        5.45
     2018q4 |          1        0.91        6.36
     2019q2 |          2        1.82        8.18
     2019q3 |          2        1.82       10.00
     2020q1 |          1        0.91       10.91
     2020q2 |          3        2.73       13.64
     2020q3 |          2        1.82       15.45
     2020q4 |          3        2.73       18.18
     2021q1 |          1        0.91       19.09
     2021q3 |          2        1.82       20.91
     2021q4 |          1        0.91       21.82
     2022q1 |          1        0.91       22.73
     2022q2 |          7        6.36       29.09
     2022q3 |          4        3.64       32.73
     2022q4 |          6        5.45       38.18
     2023q1 |          3        2.73       40.91
     2023q2 |          4        3.64       44.55
     2023q3 |         11       10.00       54.55
     2023q4 |          6        5.45       60.00
     2024q1 |         13       11.82       71.82
     2024q2 |          5        4.55       76.36
     2024q3 |          6        5.45       81.82
     2024q4 |          9        8.18       90.00
     2025q1 |         11       10.00      100.00
------------+-----------------------------------
      Total |        110      100.00

-------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

Time period |
        for |
  diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
     2017q3 |          1        1.39        1.39
     2018q4 |          1        1.39        2.78
     2019q3 |          1        1.39        4.17
     2019q4 |          2        2.78        6.94
     2020q2 |          2        2.78        9.72
     2021q1 |          2        2.78       12.50
     2021q3 |          2        2.78       15.28
     2021q4 |          2        2.78       18.06
     2022q1 |          1        1.39       19.44
     2022q2 |          3        4.17       23.61
     2022q3 |          2        2.78       26.39
     2022q4 |          7        9.72       36.11
     2023q1 |          6        8.33       44.44
     2023q2 |          4        5.56       50.00
     2023q3 |          3        4.17       54.17
     2024q1 |         10       13.89       68.06
     2024q2 |          4        5.56       73.61
     2024q3 |          4        5.56       79.17
     2024q4 |          6        8.33       87.50
     2025q1 |          9       12.50      100.00
------------+-----------------------------------
      Total |         72      100.00

-------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = Undiff IA

Time period |
        for |
  diagnosis |      Freq.     Percent        Cum.
------------+-----------------------------------
     2017q3 |          1        6.25        6.25
     2018q2 |          1        6.25       12.50
     2019q1 |          1        6.25       18.75
     2021q1 |          1        6.25       25.00
     2023q1 |          1        6.25       31.25
     2023q3 |          2       12.50       43.75
     2024q1 |          1        6.25       50.00
     2024q2 |          1        6.25       56.25
     2024q3 |          3       18.75       75.00
     2024q4 |          2       12.50       87.50
     2025q1 |          2       12.50      100.00
------------+-----------------------------------
      Total |         16      100.00


. 
. **Separate into 12-month time windows (for diagnosis date)
. gen diagnosis_year = (floor((diagnosis_date - date("$start_date", "DMY")) / 365.25) + 1) if inrange(diagnosis_date, dat
> e("$start_date", "DMY"), date("$end_date", "DMY"))

. lab var diagnosis_year "Year of diagnosis"

. forvalues i = 1/$max_year {
  2.     local start = $base_year + `i' - 1
  3.     local end = `start' + 1
  4.     label define diagnosis_year_lbl `i' "Apr `start'–Mar `end'", add
  5. }

. lab val diagnosis_year diagnosis_year_lbl

. tab diagnosis_year, missing

Year of diagnosis |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2016–Mar 2017 |         16        1.54        1.54
Apr 2017–Mar 2018 |         24        2.31        3.84
Apr 2018–Mar 2019 |         22        2.11        5.96
Apr 2019–Mar 2020 |         30        2.88        8.84
Apr 2020–Mar 2021 |         52        5.00       13.83
Apr 2021–Mar 2022 |         62        5.96       19.79
Apr 2022–Mar 2023 |        162       15.56       35.35
Apr 2023–Mar 2024 |        289       27.76       63.11
Apr 2024–Mar 2025 |        384       36.89      100.00
------------------+-----------------------------------
            Total |      1,041      100.00

. bys eia_diagnosis: tab diagnosis_year, missing

-------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

Year of diagnosis |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2016–Mar 2017 |         14        1.66        1.66
Apr 2017–Mar 2018 |         18        2.14        3.80
Apr 2018–Mar 2019 |         18        2.14        5.93
Apr 2019–Mar 2020 |         22        2.61        8.54
Apr 2020–Mar 2021 |         38        4.51       13.05
Apr 2021–Mar 2022 |         53        6.29       19.34
Apr 2022–Mar 2023 |        123       14.59       33.93
Apr 2023–Mar 2024 |        235       27.88       61.80
Apr 2024–Mar 2025 |        322       38.20      100.00
------------------+-----------------------------------
            Total |        843      100.00

-------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

Year of diagnosis |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2016–Mar 2017 |          2        1.82        1.82
Apr 2017–Mar 2018 |          4        3.64        5.45
Apr 2018–Mar 2019 |          1        0.91        6.36
Apr 2019–Mar 2020 |          5        4.55       10.91
Apr 2020–Mar 2021 |          9        8.18       19.09
Apr 2021–Mar 2022 |          4        3.64       22.73
Apr 2022–Mar 2023 |         20       18.18       40.91
Apr 2023–Mar 2024 |         34       30.91       71.82
Apr 2024–Mar 2025 |         31       28.18      100.00
------------------+-----------------------------------
            Total |        110      100.00

-------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

Year of diagnosis |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2017–Mar 2018 |          1        1.39        1.39
Apr 2018–Mar 2019 |          1        1.39        2.78
Apr 2019–Mar 2020 |          3        4.17        6.94
Apr 2020–Mar 2021 |          4        5.56       12.50
Apr 2021–Mar 2022 |          5        6.94       19.44
Apr 2022–Mar 2023 |         18       25.00       44.44
Apr 2023–Mar 2024 |         17       23.61       68.06
Apr 2024–Mar 2025 |         23       31.94      100.00
------------------+-----------------------------------
            Total |         72      100.00

-------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = Undiff IA

Year of diagnosis |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2017–Mar 2018 |          1        6.25        6.25
Apr 2018–Mar 2019 |          2       12.50       18.75
Apr 2020–Mar 2021 |          1        6.25       25.00
Apr 2022–Mar 2023 |          1        6.25       31.25
Apr 2023–Mar 2024 |          3       18.75       50.00
Apr 2024–Mar 2025 |          8       50.00      100.00
------------------+-----------------------------------
            Total |         16      100.00


. 
. **Separate into 3-month time windows (for appt date)
. gen appt_3m = qofd(rheum_appt_date)
(920 missing values generated)

. format appt_3m %tq

. lab var appt_3m "Time period for appointment"

. tab appt_3m, missing

Time period |
        for |
appointment |      Freq.     Percent        Cum.
------------+-----------------------------------
     2015q3 |          2        0.19        0.19
     2016q1 |          2        0.19        0.38
     2016q3 |          1        0.10        0.48
     2016q4 |          1        0.10        0.58
     2017q2 |          1        0.10        0.67
     2017q3 |          2        0.19        0.86
     2017q4 |          1        0.10        0.96
     2018q3 |          2        0.19        1.15
     2019q4 |          1        0.10        1.25
     2020q4 |          1        0.10        1.34
     2021q1 |          1        0.10        1.44
     2021q2 |          1        0.10        1.54
     2021q3 |          1        0.10        1.63
     2021q4 |          1        0.10        1.73
     2022q1 |          2        0.19        1.92
     2022q2 |          3        0.29        2.21
     2022q3 |          3        0.29        2.50
     2022q4 |          6        0.58        3.07
     2023q1 |          9        0.86        3.94
     2023q2 |          4        0.38        4.32
     2023q3 |          8        0.77        5.09
     2023q4 |         10        0.96        6.05
     2024q1 |         16        1.54        7.59
     2024q2 |         18        1.73        9.32
     2024q3 |          9        0.86       10.18
     2024q4 |         11        1.06       11.24
     2025q1 |          4        0.38       11.62
          . |        920       88.38      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. bys eia_diagnosis: tab appt_3m, missing

-------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

Time period |
        for |
appointment |      Freq.     Percent        Cum.
------------+-----------------------------------
     2015q3 |          1        0.12        0.12
     2016q1 |          2        0.24        0.36
     2016q3 |          1        0.12        0.47
     2017q2 |          1        0.12        0.59
     2017q3 |          2        0.24        0.83
     2017q4 |          1        0.12        0.95
     2018q3 |          2        0.24        1.19
     2019q4 |          1        0.12        1.30
     2020q4 |          1        0.12        1.42
     2021q1 |          1        0.12        1.54
     2021q2 |          1        0.12        1.66
     2021q3 |          1        0.12        1.78
     2021q4 |          1        0.12        1.90
     2022q1 |          2        0.24        2.14
     2022q2 |          3        0.36        2.49
     2022q3 |          3        0.36        2.85
     2022q4 |          6        0.71        3.56
     2023q1 |          7        0.83        4.39
     2023q2 |          2        0.24        4.63
     2023q3 |          6        0.71        5.34
     2023q4 |          8        0.95        6.29
     2024q1 |         12        1.42        7.71
     2024q2 |         14        1.66        9.37
     2024q3 |          9        1.07       10.44
     2024q4 |          9        1.07       11.51
     2025q1 |          4        0.47       11.98
          . |        742       88.02      100.00
------------+-----------------------------------
      Total |        843      100.00

-------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

Time period |
        for |
appointment |      Freq.     Percent        Cum.
------------+-----------------------------------
     2015q3 |          1        0.91        0.91
     2023q1 |          1        0.91        1.82
     2023q2 |          1        0.91        2.73
     2023q3 |          2        1.82        4.55
     2024q1 |          1        0.91        5.45
     2024q2 |          3        2.73        8.18
     2024q4 |          1        0.91        9.09
          . |        100       90.91      100.00
------------+-----------------------------------
      Total |        110      100.00

-------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

Time period |
        for |
appointment |      Freq.     Percent        Cum.
------------+-----------------------------------
     2023q1 |          1        1.39        1.39
     2023q2 |          1        1.39        2.78
     2023q4 |          2        2.78        5.56
     2024q1 |          3        4.17        9.72
     2024q2 |          1        1.39       11.11
     2024q4 |          1        1.39       12.50
          . |         63       87.50      100.00
------------+-----------------------------------
      Total |         72      100.00

-------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = Undiff IA

Time period |
        for |
appointment |      Freq.     Percent        Cum.
------------+-----------------------------------
     2016q4 |          1        6.25        6.25
          . |         15       93.75      100.00
------------+-----------------------------------
      Total |         16      100.00


. 
. **Separate into 12-month time windows (for appt date)
. gen appt_year = (floor((rheum_appt_date - date("$start_date", "DMY")) / 365.25) + 1) if inrange(rheum_appt_date, date("
> $start_date", "DMY"), date("$end_date", "DMY"))
(924 missing values generated)

. lab var appt_year "Year of appointment"

. forvalues i = 1/$max_year {
  2.     local start = $base_year + `i' - 1
  3.     local end = `start' + 1
  4.     label define appt_year_lbl `i' "Apr `start'–Mar `end'", add
  5. }

. lab val appt_year appt_year_lbl

. tab appt_year, missing

          Year of |
      appointment |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2016–Mar 2017 |          2        0.19        0.19
Apr 2017–Mar 2018 |          4        0.38        0.58
Apr 2018–Mar 2019 |          2        0.19        0.77
Apr 2019–Mar 2020 |          1        0.10        0.86
Apr 2020–Mar 2021 |          2        0.19        1.06
Apr 2021–Mar 2022 |          5        0.48        1.54
Apr 2022–Mar 2023 |         21        2.02        3.55
Apr 2023–Mar 2024 |         38        3.65        7.20
Apr 2024–Mar 2025 |         42        4.03       11.24
                . |        924       88.76      100.00
------------------+-----------------------------------
            Total |      1,041      100.00

. bys eia_diagnosis: tab appt_year, missing

-------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = RA

          Year of |
      appointment |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2016–Mar 2017 |          1        0.12        0.12
Apr 2017–Mar 2018 |          4        0.47        0.59
Apr 2018–Mar 2019 |          2        0.24        0.83
Apr 2019–Mar 2020 |          1        0.12        0.95
Apr 2020–Mar 2021 |          2        0.24        1.19
Apr 2021–Mar 2022 |          5        0.59        1.78
Apr 2022–Mar 2023 |         19        2.25        4.03
Apr 2023–Mar 2024 |         28        3.32        7.35
Apr 2024–Mar 2025 |         36        4.27       11.63
                . |        745       88.37      100.00
------------------+-----------------------------------
            Total |        843      100.00

-------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = PsA

          Year of |
      appointment |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2022–Mar 2023 |          1        0.91        0.91
Apr 2023–Mar 2024 |          4        3.64        4.55
Apr 2024–Mar 2025 |          4        3.64        8.18
                . |        101       91.82      100.00
------------------+-----------------------------------
            Total |        110      100.00

-------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = AxSpA

          Year of |
      appointment |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2022–Mar 2023 |          1        1.39        1.39
Apr 2023–Mar 2024 |          6        8.33        9.72
Apr 2024–Mar 2025 |          2        2.78       12.50
                . |         63       87.50      100.00
------------------+-----------------------------------
            Total |         72      100.00

-------------------------------------------------------------------------------------------------------------------------
-> eia_diagnosis = Undiff IA

          Year of |
      appointment |      Freq.     Percent        Cum.
------------------+-----------------------------------
Apr 2016–Mar 2017 |          1        6.25        6.25
                . |         15       93.75      100.00
------------------+-----------------------------------
            Total |         16      100.00


. 
. *Define Rheumatology appointments ======================================*/
. 
. **Rheumatology appt definitions 
. tab rheum_appt, missing //proportion of patients with an rheum outpatient date (with first attendance option selected) 
> in the 12 months before and 60 days after EIA code appeared in GP record; data only April 2019 onwards

Rheumatolog |
          y |
appointment |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        920       88.38       88.38
        Yes |        121       11.62      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. tab mo_year_diagn rheum_appt, missing //proportion of patients with an rheum outpatient date (with first attendance opt
> ion selected) in the 12 months before and 60 days after EIA code appeared in GP record; data only April 2019 onwards

Month/Year |     Rheumatology
        of |      appointment
 Diagnosis |        No        Yes |     Total
-----------+----------------------+----------
  Apr-2016 |         0          1 |         1 
  May-2016 |         1          1 |         2 
  Jun-2016 |         2          0 |         2 
  Jul-2016 |         1          0 |         1 
  Aug-2016 |         1          0 |         1 
  Sep-2016 |         1          0 |         1 
  Oct-2016 |         1          0 |         1 
  Nov-2016 |         1          1 |         2 
  Dec-2016 |         3          0 |         3 
  Jan-2017 |         0          1 |         1 
  Mar-2017 |         1          0 |         1 
  Apr-2017 |         2          0 |         2 
  May-2017 |         1          1 |         2 
  Jun-2017 |         2          0 |         2 
  Jul-2017 |         2          0 |         2 
  Aug-2017 |         2          1 |         3 
  Sep-2017 |         2          1 |         3 
  Oct-2017 |         2          0 |         2 
  Nov-2017 |         1          1 |         2 
  Dec-2017 |         2          0 |         2 
  Feb-2018 |         2          2 |         4 
  Apr-2018 |         2          0 |         2 
  Jun-2018 |         2          0 |         2 
  Jul-2018 |         4          0 |         4 
  Sep-2018 |         1          1 |         2 
  Oct-2018 |         2          0 |         2 
  Nov-2018 |         2          0 |         2 
  Dec-2018 |         1          0 |         1 
  Jan-2019 |         2          0 |         2 
  Feb-2019 |         3          0 |         3 
  Mar-2019 |         2          0 |         2 
  Apr-2019 |         1          0 |         1 
  May-2019 |         5          0 |         5 
  Jun-2019 |         2          1 |         3 
  Jul-2019 |         3          0 |         3 
  Aug-2019 |         3          0 |         3 
  Sep-2019 |         3          0 |         3 
  Oct-2019 |         4          0 |         4 
  Nov-2019 |         3          0 |         3 
  Dec-2019 |         3          0 |         3 
  Jan-2020 |         1          0 |         1 
  Feb-2020 |         1          0 |         1 
  Apr-2020 |         4          0 |         4 
  May-2020 |         3          0 |         3 
  Jun-2020 |         3          0 |         3 
  Jul-2020 |         4          0 |         4 
  Sep-2020 |         3          0 |         3 
  Oct-2020 |         4          0 |         4 
  Nov-2020 |         7          1 |         8 
  Dec-2020 |         9          0 |         9 
  Jan-2021 |         4          0 |         4 
  Feb-2021 |         8          0 |         8 
  Mar-2021 |         2          0 |         2 
  Apr-2021 |         4          0 |         4 
  May-2021 |         4          0 |         4 
  Jun-2021 |         2          0 |         2 
  Jul-2021 |         6          1 |         7 
  Aug-2021 |         5          1 |         6 
  Sep-2021 |         5          1 |         6 
  Oct-2021 |         4          0 |         4 
  Nov-2021 |         3          0 |         3 
  Dec-2021 |         4          0 |         4 
  Jan-2022 |         3          0 |         3 
  Feb-2022 |        11          0 |        11 
  Mar-2022 |         7          1 |         8 
  Apr-2022 |        11          0 |        11 
  May-2022 |        13          0 |        13 
  Jun-2022 |        10          0 |        10 
  Jul-2022 |        13          0 |        13 
  Aug-2022 |         9          1 |        10 
  Sep-2022 |         9          2 |        11 
  Oct-2022 |        12          2 |        14 
  Nov-2022 |        15          0 |        15 
  Dec-2022 |        12          2 |        14 
  Jan-2023 |        12          1 |        13 
  Feb-2023 |        15          1 |        16 
  Mar-2023 |        20          2 |        22 
  Apr-2023 |        17          0 |        17 
  May-2023 |        11          3 |        14 
  Jun-2023 |        18          1 |        19 
  Jul-2023 |        25          1 |        26 
  Aug-2023 |        26          1 |        27 
  Sep-2023 |        24          2 |        26 
  Oct-2023 |        23          2 |        25 
  Nov-2023 |        19          2 |        21 
  Dec-2023 |        22          2 |        24 
  Jan-2024 |        30          3 |        33 
  Feb-2024 |        23          4 |        27 
  Mar-2024 |        27          3 |        30 
  Apr-2024 |        23          5 |        28 
  May-2024 |        24          5 |        29 
  Jun-2024 |        21          2 |        23 
  Jul-2024 |        34          3 |        37 
  Aug-2024 |        21          4 |        25 
  Sep-2024 |        20          6 |        26 
  Oct-2024 |        36          2 |        38 
  Nov-2024 |        31          5 |        36 
  Dec-2024 |        23          9 |        32 
  Jan-2025 |        29         10 |        39 
  Feb-2025 |        25         12 |        37 
  Mar-2025 |        28          6 |        34 
-----------+----------------------+----------
     Total |       920        121 |     1,041 

. tab rheum_appt_any, missing //proportion of patients with a rheum outpatient date (without first attendance option sele
> cted) in the 12 months before and 60 days after EIA code appeared in GP record; data only April 2019 onwards

rheum_appt_ |
        any |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        766       73.58       73.58
          1 |        275       26.42      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. tab rheum_appt2, missing //proportion of patients with a rheum outpatient date (without first attendance option selecte
> d) in the 6 months before and 60 days after  EIA code appeared in GP record; data only April 2019 onwards

rheum_appt2 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        826       79.35       79.35
          1 |        215       20.65      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. tab rheum_appt3, missing //proportion of patients with a rheum outpatient date (without first attendance option selecte
> d) in the 2 years before and 60 days after EIA code appeared in GP record; data only April 2019 onwards

rheum_appt3 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        650       62.44       62.44
          1 |        391       37.56      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. tab rheum_appt4, missing //proportion of patients with a rheum outpatient date (without first attendance option selecte
> d) in the 2 years before and 1 year after EIA code appeared in GP record; data only April 2019 onwards

rheum_appt4 |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        650       62.44       62.44
          1 |        391       37.56      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. 
. ***Check number of rheumatology appts in the year before EIA code
. tabstat rheum_appt_count, stat (n mean sd p50 p25 p75)

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |      1041  .4553314  .9962299         0         0         0
--------------------------------------------------------------------------

. bys diagnosis_year: tabstat rheum_appt_count, stat (n mean sd p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = Apr 2016–Mar 2017

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |        16      .875  1.360147         0         0       1.5
--------------------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = Apr 2017–Mar 2018

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |        24  .6666667   1.09014         0         0         1
--------------------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = Apr 2018–Mar 2019

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |        22  .2272727  .5284135         0         0         0
--------------------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = Apr 2019–Mar 2020

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |        30  .0666667  .3651484         0         0         0
--------------------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = Apr 2020–Mar 2021

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |        52  .1153846  .5108181         0         0         0
--------------------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = Apr 2021–Mar 2022

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |        62  .2258065  .6381159         0         0         0
--------------------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = Apr 2022–Mar 2023

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |       162   .154321  .4537078         0         0         0
--------------------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = Apr 2023–Mar 2024

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |       289  .3114187   .634572         0         0         0
--------------------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------
-> diagnosis_year = Apr 2024–Mar 2025

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |       384  .7864583  1.350456         0         0         1
--------------------------------------------------------------------------

. bys appt_year: tabstat rheum_appt_count, stat (n mean sd p50 p25 p75)

-------------------------------------------------------------------------------------------------------------------------
-> appt_year = Apr 2016–Mar 2017

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |         2         1         0         1         1         1
--------------------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------
-> appt_year = Apr 2017–Mar 2018

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |         4         2  1.414214       1.5         1         3
--------------------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------
-> appt_year = Apr 2018–Mar 2019

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |         2         2         0         2         2         2
--------------------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------
-> appt_year = Apr 2019–Mar 2020

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |         1         3         .         3         3         3
--------------------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------
-> appt_year = Apr 2020–Mar 2021

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |         2       1.5  .7071068       1.5         1         2
--------------------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------
-> appt_year = Apr 2021–Mar 2022

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |         5       1.6  1.341641         1         1         1
--------------------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------
-> appt_year = Apr 2022–Mar 2023

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |        21  1.428571  .8106435         1         1         2
--------------------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------
-> appt_year = Apr 2023–Mar 2024

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |        38  2.078947  .8504873         2         1         3
--------------------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------
-> appt_year = Apr 2024–Mar 2025

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |        42  2.833333  1.737908       2.5         1         4
--------------------------------------------------------------------------

-------------------------------------------------------------------------------------------------------------------------
-> appt_year = .

    Variable |         N      Mean        SD       p50       p25       p75
-------------+------------------------------------------------------------
rheum_appt~t |       924  .2359307  .6766234         0         0         0
--------------------------------------------------------------------------

. 
. ***Check medium used for rheumatology appointment
. tab rheum_appt_medium, missing

rheum_appt_ |
     medium |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         18        1.73        1.73
          2 |         11        1.06        2.79
          3 |         12        1.15        3.94
          4 |         10        0.96        4.90
          5 |         16        1.54        6.44
          9 |          6        0.58        7.01
         10 |         17        1.63        8.65
         11 |         15        1.44       10.09
         98 |         16        1.54       11.62
          . |        920       88.38      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. gen rheum_appt_medium_clean = rheum_appt_medium if rheum_appt_medium >0 & rheum_appt_medium<100
(920 missing values generated)

. recode rheum_appt_medium_clean 3=2 //recode telemedicine=telephone
(12 changes made to rheum_appt_medium_clean)

. replace rheum_appt_medium_clean=10 if rheum_appt_medium_clean>2 & rheum_appt_medium_clean!=.
(63 real changes made)

. recode rheum_appt_medium_clean .=.u
(920 changes made to rheum_appt_medium_clean)

. lab define rheum_appt_medium_clean 1 "Face-to-face" 2 "Telephone" 10 "Other" .u "Missing", modify

. lab val rheum_appt_medium_clean rheum_appt_medium_clean

. lab var rheum_appt_medium_clean "Rheumatology consultation medium"

. tab rheum_appt_medium_clean 

Rheumatology |
consultation |
      medium |      Freq.     Percent        Cum.
-------------+-----------------------------------
Face-to-face |         18       14.88       14.88
   Telephone |         23       19.01       33.88
       Other |         80       66.12      100.00
-------------+-----------------------------------
       Total |        121      100.00

. 
. *Gen rheum appt variable with 6m/12m+ until study end date
. gen rheum_appt_12m=rheum_appt if rheum_appt_date<=(date("$end_date", "DMY")-365) 
(962 missing values generated)

. recode rheum_appt_12m .=0
(962 changes made to rheum_appt_12m)

. lab var rheum_appt_12m "Rheumatology appt 12m+"

. lab define rheum_appt_12m 0 "No" 1 "Yes", modify

. lab val rheum_appt_12m rheum_appt_12m

. 
. gen rheum_appt_6m=rheum_appt if rheum_appt_date<=(date("$end_date", "DMY")-180) 
(935 missing values generated)

. recode rheum_appt_6m .=0
(935 changes made to rheum_appt_6m)

. lab var rheum_appt_6m "Rheumatology appt 6m+"

. lab define rheum_appt_6m 0 "No" 1 "Yes", modify

. lab val rheum_appt_6m rheum_appt_6m

. 
. **Define Rheumatology referrals ======================================*/
. 
. ***From HES OPA (referral_request_received_date)
. tab rheum_appt_ref, missing

rheum_appt_ |
        ref |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        920       88.38       88.38
          1 |        121       11.62      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. codebook rheum_appt_ref_date

-------------------------------------------------------------------------------------------------------------------------
rheum_appt_ref_date                                                                                           (unlabeled)
-------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric daily date (float)

                 Range: [19094,23878]                 Units: 1
       Or equivalently: [11apr2012,17may2025]         Units: days
         Unique values: 117                       Missing .: 920/1,041

                  Mean: 23204.4 = 13jul2023(+ 9 hours)
             Std. dev.: 891.492
           Percentiles:       10%        25%        50%        75%        90%
                            21742      23156      23473      23739      23833
                        12jul2019  26may2023  07apr2024  29dec2024  02apr2025

. tab mo_year_diagn rheum_appt_ref, missing

Month/Year |
        of |    rheum_appt_ref
 Diagnosis |         0          1 |     Total
-----------+----------------------+----------
  Apr-2016 |         0          1 |         1 
  May-2016 |         1          1 |         2 
  Jun-2016 |         2          0 |         2 
  Jul-2016 |         1          0 |         1 
  Aug-2016 |         1          0 |         1 
  Sep-2016 |         1          0 |         1 
  Oct-2016 |         1          0 |         1 
  Nov-2016 |         1          1 |         2 
  Dec-2016 |         3          0 |         3 
  Jan-2017 |         0          1 |         1 
  Mar-2017 |         1          0 |         1 
  Apr-2017 |         2          0 |         2 
  May-2017 |         1          1 |         2 
  Jun-2017 |         2          0 |         2 
  Jul-2017 |         2          0 |         2 
  Aug-2017 |         2          1 |         3 
  Sep-2017 |         2          1 |         3 
  Oct-2017 |         2          0 |         2 
  Nov-2017 |         1          1 |         2 
  Dec-2017 |         2          0 |         2 
  Feb-2018 |         2          2 |         4 
  Apr-2018 |         2          0 |         2 
  Jun-2018 |         2          0 |         2 
  Jul-2018 |         4          0 |         4 
  Sep-2018 |         1          1 |         2 
  Oct-2018 |         2          0 |         2 
  Nov-2018 |         2          0 |         2 
  Dec-2018 |         1          0 |         1 
  Jan-2019 |         2          0 |         2 
  Feb-2019 |         3          0 |         3 
  Mar-2019 |         2          0 |         2 
  Apr-2019 |         1          0 |         1 
  May-2019 |         5          0 |         5 
  Jun-2019 |         2          1 |         3 
  Jul-2019 |         3          0 |         3 
  Aug-2019 |         3          0 |         3 
  Sep-2019 |         3          0 |         3 
  Oct-2019 |         4          0 |         4 
  Nov-2019 |         3          0 |         3 
  Dec-2019 |         3          0 |         3 
  Jan-2020 |         1          0 |         1 
  Feb-2020 |         1          0 |         1 
  Apr-2020 |         4          0 |         4 
  May-2020 |         3          0 |         3 
  Jun-2020 |         3          0 |         3 
  Jul-2020 |         4          0 |         4 
  Sep-2020 |         3          0 |         3 
  Oct-2020 |         4          0 |         4 
  Nov-2020 |         7          1 |         8 
  Dec-2020 |         9          0 |         9 
  Jan-2021 |         4          0 |         4 
  Feb-2021 |         8          0 |         8 
  Mar-2021 |         2          0 |         2 
  Apr-2021 |         4          0 |         4 
  May-2021 |         4          0 |         4 
  Jun-2021 |         2          0 |         2 
  Jul-2021 |         6          1 |         7 
  Aug-2021 |         5          1 |         6 
  Sep-2021 |         5          1 |         6 
  Oct-2021 |         4          0 |         4 
  Nov-2021 |         3          0 |         3 
  Dec-2021 |         4          0 |         4 
  Jan-2022 |         3          0 |         3 
  Feb-2022 |        11          0 |        11 
  Mar-2022 |         7          1 |         8 
  Apr-2022 |        11          0 |        11 
  May-2022 |        13          0 |        13 
  Jun-2022 |        10          0 |        10 
  Jul-2022 |        13          0 |        13 
  Aug-2022 |         9          1 |        10 
  Sep-2022 |         9          2 |        11 
  Oct-2022 |        12          2 |        14 
  Nov-2022 |        15          0 |        15 
  Dec-2022 |        12          2 |        14 
  Jan-2023 |        12          1 |        13 
  Feb-2023 |        15          1 |        16 
  Mar-2023 |        20          2 |        22 
  Apr-2023 |        17          0 |        17 
  May-2023 |        11          3 |        14 
  Jun-2023 |        18          1 |        19 
  Jul-2023 |        25          1 |        26 
  Aug-2023 |        26          1 |        27 
  Sep-2023 |        24          2 |        26 
  Oct-2023 |        23          2 |        25 
  Nov-2023 |        19          2 |        21 
  Dec-2023 |        22          2 |        24 
  Jan-2024 |        30          3 |        33 
  Feb-2024 |        23          4 |        27 
  Mar-2024 |        27          3 |        30 
  Apr-2024 |        23          5 |        28 
  May-2024 |        24          5 |        29 
  Jun-2024 |        21          2 |        23 
  Jul-2024 |        34          3 |        37 
  Aug-2024 |        21          4 |        25 
  Sep-2024 |        20          6 |        26 
  Oct-2024 |        36          2 |        38 
  Nov-2024 |        31          5 |        36 
  Dec-2024 |        23          9 |        32 
  Jan-2025 |        29         10 |        39 
  Feb-2025 |        25         12 |        37 
  Mar-2025 |        28          6 |        34 
-----------+----------------------+----------
     Total |       920        121 |     1,041 

. tab mo_year_diagn rheum_appt_ref if rheum_appt!=., missing

Month/Year |
        of |    rheum_appt_ref
 Diagnosis |         0          1 |     Total
-----------+----------------------+----------
  Apr-2016 |         0          1 |         1 
  May-2016 |         1          1 |         2 
  Jun-2016 |         2          0 |         2 
  Jul-2016 |         1          0 |         1 
  Aug-2016 |         1          0 |         1 
  Sep-2016 |         1          0 |         1 
  Oct-2016 |         1          0 |         1 
  Nov-2016 |         1          1 |         2 
  Dec-2016 |         3          0 |         3 
  Jan-2017 |         0          1 |         1 
  Mar-2017 |         1          0 |         1 
  Apr-2017 |         2          0 |         2 
  May-2017 |         1          1 |         2 
  Jun-2017 |         2          0 |         2 
  Jul-2017 |         2          0 |         2 
  Aug-2017 |         2          1 |         3 
  Sep-2017 |         2          1 |         3 
  Oct-2017 |         2          0 |         2 
  Nov-2017 |         1          1 |         2 
  Dec-2017 |         2          0 |         2 
  Feb-2018 |         2          2 |         4 
  Apr-2018 |         2          0 |         2 
  Jun-2018 |         2          0 |         2 
  Jul-2018 |         4          0 |         4 
  Sep-2018 |         1          1 |         2 
  Oct-2018 |         2          0 |         2 
  Nov-2018 |         2          0 |         2 
  Dec-2018 |         1          0 |         1 
  Jan-2019 |         2          0 |         2 
  Feb-2019 |         3          0 |         3 
  Mar-2019 |         2          0 |         2 
  Apr-2019 |         1          0 |         1 
  May-2019 |         5          0 |         5 
  Jun-2019 |         2          1 |         3 
  Jul-2019 |         3          0 |         3 
  Aug-2019 |         3          0 |         3 
  Sep-2019 |         3          0 |         3 
  Oct-2019 |         4          0 |         4 
  Nov-2019 |         3          0 |         3 
  Dec-2019 |         3          0 |         3 
  Jan-2020 |         1          0 |         1 
  Feb-2020 |         1          0 |         1 
  Apr-2020 |         4          0 |         4 
  May-2020 |         3          0 |         3 
  Jun-2020 |         3          0 |         3 
  Jul-2020 |         4          0 |         4 
  Sep-2020 |         3          0 |         3 
  Oct-2020 |         4          0 |         4 
  Nov-2020 |         7          1 |         8 
  Dec-2020 |         9          0 |         9 
  Jan-2021 |         4          0 |         4 
  Feb-2021 |         8          0 |         8 
  Mar-2021 |         2          0 |         2 
  Apr-2021 |         4          0 |         4 
  May-2021 |         4          0 |         4 
  Jun-2021 |         2          0 |         2 
  Jul-2021 |         6          1 |         7 
  Aug-2021 |         5          1 |         6 
  Sep-2021 |         5          1 |         6 
  Oct-2021 |         4          0 |         4 
  Nov-2021 |         3          0 |         3 
  Dec-2021 |         4          0 |         4 
  Jan-2022 |         3          0 |         3 
  Feb-2022 |        11          0 |        11 
  Mar-2022 |         7          1 |         8 
  Apr-2022 |        11          0 |        11 
  May-2022 |        13          0 |        13 
  Jun-2022 |        10          0 |        10 
  Jul-2022 |        13          0 |        13 
  Aug-2022 |         9          1 |        10 
  Sep-2022 |         9          2 |        11 
  Oct-2022 |        12          2 |        14 
  Nov-2022 |        15          0 |        15 
  Dec-2022 |        12          2 |        14 
  Jan-2023 |        12          1 |        13 
  Feb-2023 |        15          1 |        16 
  Mar-2023 |        20          2 |        22 
  Apr-2023 |        17          0 |        17 
  May-2023 |        11          3 |        14 
  Jun-2023 |        18          1 |        19 
  Jul-2023 |        25          1 |        26 
  Aug-2023 |        26          1 |        27 
  Sep-2023 |        24          2 |        26 
  Oct-2023 |        23          2 |        25 
  Nov-2023 |        19          2 |        21 
  Dec-2023 |        22          2 |        24 
  Jan-2024 |        30          3 |        33 
  Feb-2024 |        23          4 |        27 
  Mar-2024 |        27          3 |        30 
  Apr-2024 |        23          5 |        28 
  May-2024 |        24          5 |        29 
  Jun-2024 |        21          2 |        23 
  Jul-2024 |        34          3 |        37 
  Aug-2024 |        21          4 |        25 
  Sep-2024 |        20          6 |        26 
  Oct-2024 |        36          2 |        38 
  Nov-2024 |        31          5 |        36 
  Dec-2024 |        23          9 |        32 
  Jan-2025 |        29         10 |        39 
  Feb-2025 |        25         12 |        37 
  Mar-2025 |        28          6 |        34 
-----------+----------------------+----------
     Total |       920        121 |     1,041 

. 
. ***From RTT clock-stop data (only available for those with clock-stop date between May 2021 and May 2022)
. tab rtt_cl_ref, missing

 rtt_cl_ref |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        500       48.03       48.03
          1 |        541       51.97      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. codebook rtt_cl_ref_date

-------------------------------------------------------------------------------------------------------------------------
rtt_cl_ref_date                                                                                               (unlabeled)
-------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric daily date (float)

                 Range: [19938,23882]                 Units: 1
       Or equivalently: [03aug2014,21may2025]         Units: days
         Unique values: 425                       Missing .: 500/1,041

                  Mean:   23243 = 21aug2023(+ 0 hours)
             Std. dev.: 809.236
           Percentiles:       10%        25%        50%        75%        90%
                            22057      23137      23561      23760      23837
                        22may2020  07may2023  04jul2024  19jan2025  06apr2025

. tab rtt_cl_ref if rheum_appt!=0 & rtt_cl_ref_date<=rheum_appt_date, missing 

 rtt_cl_ref |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         24      100.00      100.00
------------+-----------------------------------
      Total |         24      100.00

. tab mo_year_diagn rtt_cl_ref, missing

Month/Year |
        of |      rtt_cl_ref
 Diagnosis |         0          1 |     Total
-----------+----------------------+----------
  Apr-2016 |         1          0 |         1 
  May-2016 |         0          2 |         2 
  Jun-2016 |         1          1 |         2 
  Jul-2016 |         0          1 |         1 
  Aug-2016 |         0          1 |         1 
  Sep-2016 |         0          1 |         1 
  Oct-2016 |         0          1 |         1 
  Nov-2016 |         0          2 |         2 
  Dec-2016 |         1          2 |         3 
  Jan-2017 |         0          1 |         1 
  Mar-2017 |         0          1 |         1 
  Apr-2017 |         0          2 |         2 
  May-2017 |         1          1 |         2 
  Jun-2017 |         0          2 |         2 
  Jul-2017 |         1          1 |         2 
  Aug-2017 |         0          3 |         3 
  Sep-2017 |         2          1 |         3 
  Oct-2017 |         0          2 |         2 
  Nov-2017 |         0          2 |         2 
  Dec-2017 |         0          2 |         2 
  Feb-2018 |         2          2 |         4 
  Apr-2018 |         1          1 |         2 
  Jun-2018 |         2          0 |         2 
  Jul-2018 |         2          2 |         4 
  Sep-2018 |         0          2 |         2 
  Oct-2018 |         1          1 |         2 
  Nov-2018 |         2          0 |         2 
  Dec-2018 |         1          0 |         1 
  Jan-2019 |         1          1 |         2 
  Feb-2019 |         2          1 |         3 
  Mar-2019 |         2          0 |         2 
  Apr-2019 |         1          0 |         1 
  May-2019 |         4          1 |         5 
  Jun-2019 |         2          1 |         3 
  Jul-2019 |         1          2 |         3 
  Aug-2019 |         1          2 |         3 
  Sep-2019 |         1          2 |         3 
  Oct-2019 |         2          2 |         4 
  Nov-2019 |         2          1 |         3 
  Dec-2019 |         2          1 |         3 
  Jan-2020 |         1          0 |         1 
  Feb-2020 |         0          1 |         1 
  Apr-2020 |         4          0 |         4 
  May-2020 |         3          0 |         3 
  Jun-2020 |         2          1 |         3 
  Jul-2020 |         2          2 |         4 
  Sep-2020 |         1          2 |         3 
  Oct-2020 |         2          2 |         4 
  Nov-2020 |         5          3 |         8 
  Dec-2020 |         8          1 |         9 
  Jan-2021 |         3          1 |         4 
  Feb-2021 |         5          3 |         8 
  Mar-2021 |         1          1 |         2 
  Apr-2021 |         4          0 |         4 
  May-2021 |         3          1 |         4 
  Jun-2021 |         2          0 |         2 
  Jul-2021 |         4          3 |         7 
  Aug-2021 |         5          1 |         6 
  Sep-2021 |         4          2 |         6 
  Oct-2021 |         3          1 |         4 
  Nov-2021 |         3          0 |         3 
  Dec-2021 |         4          0 |         4 
  Jan-2022 |         3          0 |         3 
  Feb-2022 |         8          3 |        11 
  Mar-2022 |         8          0 |         8 
  Apr-2022 |         8          3 |        11 
  May-2022 |         8          5 |        13 
  Jun-2022 |         8          2 |        10 
  Jul-2022 |         8          5 |        13 
  Aug-2022 |        10          0 |        10 
  Sep-2022 |         8          3 |        11 
  Oct-2022 |        11          3 |        14 
  Nov-2022 |        13          2 |        15 
  Dec-2022 |         6          8 |        14 
  Jan-2023 |        11          2 |        13 
  Feb-2023 |        11          5 |        16 
  Mar-2023 |        15          7 |        22 
  Apr-2023 |        13          4 |        17 
  May-2023 |         9          5 |        14 
  Jun-2023 |        14          5 |        19 
  Jul-2023 |        20          6 |        26 
  Aug-2023 |        19          8 |        27 
  Sep-2023 |        12         14 |        26 
  Oct-2023 |        12         13 |        25 
  Nov-2023 |         9         12 |        21 
  Dec-2023 |        11         13 |        24 
  Jan-2024 |        19         14 |        33 
  Feb-2024 |        14         13 |        27 
  Mar-2024 |        10         20 |        30 
  Apr-2024 |        10         18 |        28 
  May-2024 |        12         17 |        29 
  Jun-2024 |         9         14 |        23 
  Jul-2024 |        14         23 |        37 
  Aug-2024 |         5         20 |        25 
  Sep-2024 |         8         18 |        26 
  Oct-2024 |         4         34 |        38 
  Nov-2024 |         6         30 |        36 
  Dec-2024 |         7         25 |        32 
  Jan-2025 |         8         31 |        39 
  Feb-2025 |         5         32 |        37 
  Mar-2025 |         6         28 |        34 
-----------+----------------------+----------
     Total |       500        541 |     1,041 

. tab mo_year_diagn rtt_cl_ref if rheum_appt!=., missing

Month/Year |
        of |      rtt_cl_ref
 Diagnosis |         0          1 |     Total
-----------+----------------------+----------
  Apr-2016 |         1          0 |         1 
  May-2016 |         0          2 |         2 
  Jun-2016 |         1          1 |         2 
  Jul-2016 |         0          1 |         1 
  Aug-2016 |         0          1 |         1 
  Sep-2016 |         0          1 |         1 
  Oct-2016 |         0          1 |         1 
  Nov-2016 |         0          2 |         2 
  Dec-2016 |         1          2 |         3 
  Jan-2017 |         0          1 |         1 
  Mar-2017 |         0          1 |         1 
  Apr-2017 |         0          2 |         2 
  May-2017 |         1          1 |         2 
  Jun-2017 |         0          2 |         2 
  Jul-2017 |         1          1 |         2 
  Aug-2017 |         0          3 |         3 
  Sep-2017 |         2          1 |         3 
  Oct-2017 |         0          2 |         2 
  Nov-2017 |         0          2 |         2 
  Dec-2017 |         0          2 |         2 
  Feb-2018 |         2          2 |         4 
  Apr-2018 |         1          1 |         2 
  Jun-2018 |         2          0 |         2 
  Jul-2018 |         2          2 |         4 
  Sep-2018 |         0          2 |         2 
  Oct-2018 |         1          1 |         2 
  Nov-2018 |         2          0 |         2 
  Dec-2018 |         1          0 |         1 
  Jan-2019 |         1          1 |         2 
  Feb-2019 |         2          1 |         3 
  Mar-2019 |         2          0 |         2 
  Apr-2019 |         1          0 |         1 
  May-2019 |         4          1 |         5 
  Jun-2019 |         2          1 |         3 
  Jul-2019 |         1          2 |         3 
  Aug-2019 |         1          2 |         3 
  Sep-2019 |         1          2 |         3 
  Oct-2019 |         2          2 |         4 
  Nov-2019 |         2          1 |         3 
  Dec-2019 |         2          1 |         3 
  Jan-2020 |         1          0 |         1 
  Feb-2020 |         0          1 |         1 
  Apr-2020 |         4          0 |         4 
  May-2020 |         3          0 |         3 
  Jun-2020 |         2          1 |         3 
  Jul-2020 |         2          2 |         4 
  Sep-2020 |         1          2 |         3 
  Oct-2020 |         2          2 |         4 
  Nov-2020 |         5          3 |         8 
  Dec-2020 |         8          1 |         9 
  Jan-2021 |         3          1 |         4 
  Feb-2021 |         5          3 |         8 
  Mar-2021 |         1          1 |         2 
  Apr-2021 |         4          0 |         4 
  May-2021 |         3          1 |         4 
  Jun-2021 |         2          0 |         2 
  Jul-2021 |         4          3 |         7 
  Aug-2021 |         5          1 |         6 
  Sep-2021 |         4          2 |         6 
  Oct-2021 |         3          1 |         4 
  Nov-2021 |         3          0 |         3 
  Dec-2021 |         4          0 |         4 
  Jan-2022 |         3          0 |         3 
  Feb-2022 |         8          3 |        11 
  Mar-2022 |         8          0 |         8 
  Apr-2022 |         8          3 |        11 
  May-2022 |         8          5 |        13 
  Jun-2022 |         8          2 |        10 
  Jul-2022 |         8          5 |        13 
  Aug-2022 |        10          0 |        10 
  Sep-2022 |         8          3 |        11 
  Oct-2022 |        11          3 |        14 
  Nov-2022 |        13          2 |        15 
  Dec-2022 |         6          8 |        14 
  Jan-2023 |        11          2 |        13 
  Feb-2023 |        11          5 |        16 
  Mar-2023 |        15          7 |        22 
  Apr-2023 |        13          4 |        17 
  May-2023 |         9          5 |        14 
  Jun-2023 |        14          5 |        19 
  Jul-2023 |        20          6 |        26 
  Aug-2023 |        19          8 |        27 
  Sep-2023 |        12         14 |        26 
  Oct-2023 |        12         13 |        25 
  Nov-2023 |         9         12 |        21 
  Dec-2023 |        11         13 |        24 
  Jan-2024 |        19         14 |        33 
  Feb-2024 |        14         13 |        27 
  Mar-2024 |        10         20 |        30 
  Apr-2024 |        10         18 |        28 
  May-2024 |        12         17 |        29 
  Jun-2024 |         9         14 |        23 
  Jul-2024 |        14         23 |        37 
  Aug-2024 |         5         20 |        25 
  Sep-2024 |         8         18 |        26 
  Oct-2024 |         4         34 |        38 
  Nov-2024 |         6         30 |        36 
  Dec-2024 |         7         25 |        32 
  Jan-2025 |         8         31 |        39 
  Feb-2025 |         5         32 |        37 
  Mar-2025 |         6         28 |        34 
-----------+----------------------+----------
     Total |       500        541 |     1,041 

. tab rtt_cl_start, missing //check how this differs

rtt_cl_star |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        500       48.03       48.03
          1 |        541       51.97      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. codebook rtt_cl_start_date

-------------------------------------------------------------------------------------------------------------------------
rtt_cl_start_date                                                                                             (unlabeled)
-------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric daily date (float)

                 Range: [20421,23818]                 Units: 1
       Or equivalently: [29nov2015,18mar2025]         Units: days
         Unique values: 426                       Missing .: 500/1,041

                  Mean: 23070.4 = 01mar2023(+ 9 hours)
             Std. dev.: 760.608
           Percentiles:       10%        25%        50%        75%        90%
                            21894      23007      23335      23526      23656
                        11dec2019  28dec2022  21nov2023  30may2024  07oct2024

. tab rtt_cl_start if rheum_appt!=0 & rtt_cl_start_date<=rheum_appt_date, missing 

rtt_cl_star |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         39      100.00      100.00
------------+-----------------------------------
      Total |         39      100.00

. 
. ***From RTT open pathway data (only available as a snapshot of those with open RTT pathways as of May 2022)
. tab rtt_op_ref, missing

 rtt_op_ref |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        501       48.13       48.13
          1 |        540       51.87      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. codebook rtt_op_ref_date

-------------------------------------------------------------------------------------------------------------------------
rtt_op_ref_date                                                                                               (unlabeled)
-------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric daily date (float)

                 Range: [19180,23882]                 Units: 1
       Or equivalently: [06jul2012,21may2025]         Units: days
         Unique values: 421                       Missing .: 501/1,041

                  Mean:   23296 = 12oct2023(+ 24 hours)
             Std. dev.: 764.234
           Percentiles:       10%        25%        50%        75%        90%
                            22236      23234    23566.5    23757.5      23848
                        17nov2020  12aug2023  09jul2024  16jan2025  17apr2025

. tab rtt_op_ref if rheum_appt!=0 & rtt_op_ref_date<=rheum_appt_date, missing 

 rtt_op_ref |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         31      100.00      100.00
------------+-----------------------------------
      Total |         31      100.00

. tab mo_year_diagn rtt_op_ref, missing

Month/Year |
        of |      rtt_op_ref
 Diagnosis |         0          1 |     Total
-----------+----------------------+----------
  Apr-2016 |         0          1 |         1 
  May-2016 |         0          2 |         2 
  Jun-2016 |         2          0 |         2 
  Jul-2016 |         1          0 |         1 
  Aug-2016 |         1          0 |         1 
  Sep-2016 |         1          0 |         1 
  Oct-2016 |         0          1 |         1 
  Nov-2016 |         0          2 |         2 
  Dec-2016 |         2          1 |         3 
  Jan-2017 |         0          1 |         1 
  Mar-2017 |         0          1 |         1 
  Apr-2017 |         0          2 |         2 
  May-2017 |         1          1 |         2 
  Jun-2017 |         1          1 |         2 
  Jul-2017 |         0          2 |         2 
  Aug-2017 |         0          3 |         3 
  Sep-2017 |         1          2 |         3 
  Oct-2017 |         1          1 |         2 
  Nov-2017 |         1          1 |         2 
  Dec-2017 |         1          1 |         2 
  Feb-2018 |         2          2 |         4 
  Apr-2018 |         2          0 |         2 
  Jun-2018 |         2          0 |         2 
  Jul-2018 |         0          4 |         4 
  Sep-2018 |         1          1 |         2 
  Oct-2018 |         1          1 |         2 
  Nov-2018 |         2          0 |         2 
  Dec-2018 |         0          1 |         1 
  Jan-2019 |         2          0 |         2 
  Feb-2019 |         3          0 |         3 
  Mar-2019 |         2          0 |         2 
  Apr-2019 |         1          0 |         1 
  May-2019 |         5          0 |         5 
  Jun-2019 |         1          2 |         3 
  Jul-2019 |         3          0 |         3 
  Aug-2019 |         2          1 |         3 
  Sep-2019 |         2          1 |         3 
  Oct-2019 |         2          2 |         4 
  Nov-2019 |         2          1 |         3 
  Dec-2019 |         3          0 |         3 
  Jan-2020 |         0          1 |         1 
  Feb-2020 |         1          0 |         1 
  Apr-2020 |         2          2 |         4 
  May-2020 |         3          0 |         3 
  Jun-2020 |         2          1 |         3 
  Jul-2020 |         2          2 |         4 
  Sep-2020 |         3          0 |         3 
  Oct-2020 |         3          1 |         4 
  Nov-2020 |         5          3 |         8 
  Dec-2020 |         7          2 |         9 
  Jan-2021 |         4          0 |         4 
  Feb-2021 |         6          2 |         8 
  Mar-2021 |         1          1 |         2 
  Apr-2021 |         2          2 |         4 
  May-2021 |         2          2 |         4 
  Jun-2021 |         2          0 |         2 
  Jul-2021 |         5          2 |         7 
  Aug-2021 |         5          1 |         6 
  Sep-2021 |         4          2 |         6 
  Oct-2021 |         3          1 |         4 
  Nov-2021 |         3          0 |         3 
  Dec-2021 |         4          0 |         4 
  Jan-2022 |         2          1 |         3 
  Feb-2022 |         9          2 |        11 
  Mar-2022 |         7          1 |         8 
  Apr-2022 |        10          1 |        11 
  May-2022 |        11          2 |        13 
  Jun-2022 |         8          2 |        10 
  Jul-2022 |        10          3 |        13 
  Aug-2022 |         9          1 |        10 
  Sep-2022 |         9          2 |        11 
  Oct-2022 |        10          4 |        14 
  Nov-2022 |        11          4 |        15 
  Dec-2022 |        12          2 |        14 
  Jan-2023 |        10          3 |        13 
  Feb-2023 |        11          5 |        16 
  Mar-2023 |        15          7 |        22 
  Apr-2023 |        10          7 |        17 
  May-2023 |         7          7 |        14 
  Jun-2023 |         9         10 |        19 
  Jul-2023 |        14         12 |        26 
  Aug-2023 |        13         14 |        27 
  Sep-2023 |        16         10 |        26 
  Oct-2023 |        14         11 |        25 
  Nov-2023 |         9         12 |        21 
  Dec-2023 |        13         11 |        24 
  Jan-2024 |        15         18 |        33 
  Feb-2024 |        14         13 |        27 
  Mar-2024 |        15         15 |        30 
  Apr-2024 |        10         18 |        28 
  May-2024 |         5         24 |        29 
  Jun-2024 |         7         16 |        23 
  Jul-2024 |         8         29 |        37 
  Aug-2024 |         8         17 |        25 
  Sep-2024 |         9         17 |        26 
  Oct-2024 |         4         34 |        38 
  Nov-2024 |         7         29 |        36 
  Dec-2024 |        13         19 |        32 
  Jan-2025 |         5         34 |        39 
  Feb-2025 |         8         29 |        37 
  Mar-2025 |         4         30 |        34 
-----------+----------------------+----------
     Total |       501        540 |     1,041 

. tab mo_year_diagn rtt_op_ref if rheum_appt!=., missing

Month/Year |
        of |      rtt_op_ref
 Diagnosis |         0          1 |     Total
-----------+----------------------+----------
  Apr-2016 |         0          1 |         1 
  May-2016 |         0          2 |         2 
  Jun-2016 |         2          0 |         2 
  Jul-2016 |         1          0 |         1 
  Aug-2016 |         1          0 |         1 
  Sep-2016 |         1          0 |         1 
  Oct-2016 |         0          1 |         1 
  Nov-2016 |         0          2 |         2 
  Dec-2016 |         2          1 |         3 
  Jan-2017 |         0          1 |         1 
  Mar-2017 |         0          1 |         1 
  Apr-2017 |         0          2 |         2 
  May-2017 |         1          1 |         2 
  Jun-2017 |         1          1 |         2 
  Jul-2017 |         0          2 |         2 
  Aug-2017 |         0          3 |         3 
  Sep-2017 |         1          2 |         3 
  Oct-2017 |         1          1 |         2 
  Nov-2017 |         1          1 |         2 
  Dec-2017 |         1          1 |         2 
  Feb-2018 |         2          2 |         4 
  Apr-2018 |         2          0 |         2 
  Jun-2018 |         2          0 |         2 
  Jul-2018 |         0          4 |         4 
  Sep-2018 |         1          1 |         2 
  Oct-2018 |         1          1 |         2 
  Nov-2018 |         2          0 |         2 
  Dec-2018 |         0          1 |         1 
  Jan-2019 |         2          0 |         2 
  Feb-2019 |         3          0 |         3 
  Mar-2019 |         2          0 |         2 
  Apr-2019 |         1          0 |         1 
  May-2019 |         5          0 |         5 
  Jun-2019 |         1          2 |         3 
  Jul-2019 |         3          0 |         3 
  Aug-2019 |         2          1 |         3 
  Sep-2019 |         2          1 |         3 
  Oct-2019 |         2          2 |         4 
  Nov-2019 |         2          1 |         3 
  Dec-2019 |         3          0 |         3 
  Jan-2020 |         0          1 |         1 
  Feb-2020 |         1          0 |         1 
  Apr-2020 |         2          2 |         4 
  May-2020 |         3          0 |         3 
  Jun-2020 |         2          1 |         3 
  Jul-2020 |         2          2 |         4 
  Sep-2020 |         3          0 |         3 
  Oct-2020 |         3          1 |         4 
  Nov-2020 |         5          3 |         8 
  Dec-2020 |         7          2 |         9 
  Jan-2021 |         4          0 |         4 
  Feb-2021 |         6          2 |         8 
  Mar-2021 |         1          1 |         2 
  Apr-2021 |         2          2 |         4 
  May-2021 |         2          2 |         4 
  Jun-2021 |         2          0 |         2 
  Jul-2021 |         5          2 |         7 
  Aug-2021 |         5          1 |         6 
  Sep-2021 |         4          2 |         6 
  Oct-2021 |         3          1 |         4 
  Nov-2021 |         3          0 |         3 
  Dec-2021 |         4          0 |         4 
  Jan-2022 |         2          1 |         3 
  Feb-2022 |         9          2 |        11 
  Mar-2022 |         7          1 |         8 
  Apr-2022 |        10          1 |        11 
  May-2022 |        11          2 |        13 
  Jun-2022 |         8          2 |        10 
  Jul-2022 |        10          3 |        13 
  Aug-2022 |         9          1 |        10 
  Sep-2022 |         9          2 |        11 
  Oct-2022 |        10          4 |        14 
  Nov-2022 |        11          4 |        15 
  Dec-2022 |        12          2 |        14 
  Jan-2023 |        10          3 |        13 
  Feb-2023 |        11          5 |        16 
  Mar-2023 |        15          7 |        22 
  Apr-2023 |        10          7 |        17 
  May-2023 |         7          7 |        14 
  Jun-2023 |         9         10 |        19 
  Jul-2023 |        14         12 |        26 
  Aug-2023 |        13         14 |        27 
  Sep-2023 |        16         10 |        26 
  Oct-2023 |        14         11 |        25 
  Nov-2023 |         9         12 |        21 
  Dec-2023 |        13         11 |        24 
  Jan-2024 |        15         18 |        33 
  Feb-2024 |        14         13 |        27 
  Mar-2024 |        15         15 |        30 
  Apr-2024 |        10         18 |        28 
  May-2024 |         5         24 |        29 
  Jun-2024 |         7         16 |        23 
  Jul-2024 |         8         29 |        37 
  Aug-2024 |         8         17 |        25 
  Sep-2024 |         9         17 |        26 
  Oct-2024 |         4         34 |        38 
  Nov-2024 |         7         29 |        36 
  Dec-2024 |        13         19 |        32 
  Jan-2025 |         5         34 |        39 
  Feb-2025 |         8         29 |        37 
  Mar-2025 |         4         30 |        34 
-----------+----------------------+----------
     Total |       501        540 |     1,041 

. tab rtt_op_start, missing //check how this differs

rtt_op_star |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        501       48.13       48.13
          1 |        540       51.87      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. codebook rtt_op_start_date

-------------------------------------------------------------------------------------------------------------------------
rtt_op_start_date                                                                                             (unlabeled)
-------------------------------------------------------------------------------------------------------------------------

                  Type: Numeric daily date (float)

                 Range: [20367,23865]                 Units: 1
       Or equivalently: [06oct2015,04may2025]         Units: days
         Unique values: 434                       Missing .: 501/1,041

                  Mean: 23116.1 = 16apr2023(+ 3 hours)
             Std. dev.: 692.566
           Percentiles:       10%        25%        50%        75%        90%
                          22205.5    23069.5      23323      23506      23627
                        17oct2020  28feb2023  09nov2023  10may2024  08sep2024

. tab rtt_op_start if rheum_appt!=0 & rtt_op_start_date<=rheum_appt_date, missing 

rtt_op_star |
          t |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |         34      100.00      100.00
------------+-----------------------------------
      Total |         34      100.00

. 
. ***Combination of RTT clock-stop and open pathway
. gen rtt_ref_date = rtt_cl_ref_date
(500 missing values generated)

. replace rtt_ref_date = rtt_op_ref_date if rtt_cl_ref_date==. & rtt_op_ref_date!=. //need to think how to handle duplica
> te pathways
(192 real changes made)

. format %td rtt_ref_date

. gen rtt_ref =1 if rtt_ref_date!=.
(308 missing values generated)

. recode rtt_ref .=0
(308 changes made to rtt_ref)

. tab rtt_ref, missing

    rtt_ref |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        308       29.59       29.59
          1 |        733       70.41      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. tab mo_year_diagn rtt_ref, missing

Month/Year |
        of |        rtt_ref
 Diagnosis |         0          1 |     Total
-----------+----------------------+----------
  Apr-2016 |         0          1 |         1 
  May-2016 |         0          2 |         2 
  Jun-2016 |         1          1 |         2 
  Jul-2016 |         0          1 |         1 
  Aug-2016 |         0          1 |         1 
  Sep-2016 |         0          1 |         1 
  Oct-2016 |         0          1 |         1 
  Nov-2016 |         0          2 |         2 
  Dec-2016 |         1          2 |         3 
  Jan-2017 |         0          1 |         1 
  Mar-2017 |         0          1 |         1 
  Apr-2017 |         0          2 |         2 
  May-2017 |         1          1 |         2 
  Jun-2017 |         0          2 |         2 
  Jul-2017 |         0          2 |         2 
  Aug-2017 |         0          3 |         3 
  Sep-2017 |         1          2 |         3 
  Oct-2017 |         0          2 |         2 
  Nov-2017 |         0          2 |         2 
  Dec-2017 |         0          2 |         2 
  Feb-2018 |         1          3 |         4 
  Apr-2018 |         1          1 |         2 
  Jun-2018 |         2          0 |         2 
  Jul-2018 |         0          4 |         4 
  Sep-2018 |         0          2 |         2 
  Oct-2018 |         0          2 |         2 
  Nov-2018 |         2          0 |         2 
  Dec-2018 |         0          1 |         1 
  Jan-2019 |         1          1 |         2 
  Feb-2019 |         2          1 |         3 
  Mar-2019 |         2          0 |         2 
  Apr-2019 |         1          0 |         1 
  May-2019 |         4          1 |         5 
  Jun-2019 |         1          2 |         3 
  Jul-2019 |         1          2 |         3 
  Aug-2019 |         1          2 |         3 
  Sep-2019 |         1          2 |         3 
  Oct-2019 |         1          3 |         4 
  Nov-2019 |         2          1 |         3 
  Dec-2019 |         2          1 |         3 
  Jan-2020 |         0          1 |         1 
  Feb-2020 |         0          1 |         1 
  Apr-2020 |         2          2 |         4 
  May-2020 |         3          0 |         3 
  Jun-2020 |         2          1 |         3 
  Jul-2020 |         2          2 |         4 
  Sep-2020 |         1          2 |         3 
  Oct-2020 |         2          2 |         4 
  Nov-2020 |         3          5 |         8 
  Dec-2020 |         6          3 |         9 
  Jan-2021 |         3          1 |         4 
  Feb-2021 |         5          3 |         8 
  Mar-2021 |         1          1 |         2 
  Apr-2021 |         2          2 |         4 
  May-2021 |         2          2 |         4 
  Jun-2021 |         2          0 |         2 
  Jul-2021 |         4          3 |         7 
  Aug-2021 |         5          1 |         6 
  Sep-2021 |         4          2 |         6 
  Oct-2021 |         2          2 |         4 
  Nov-2021 |         3          0 |         3 
  Dec-2021 |         4          0 |         4 
  Jan-2022 |         2          1 |         3 
  Feb-2022 |         7          4 |        11 
  Mar-2022 |         7          1 |         8 
  Apr-2022 |         7          4 |        11 
  May-2022 |         8          5 |        13 
  Jun-2022 |         6          4 |        10 
  Jul-2022 |         6          7 |        13 
  Aug-2022 |         9          1 |        10 
  Sep-2022 |         7          4 |        11 
  Oct-2022 |         8          6 |        14 
  Nov-2022 |        10          5 |        15 
  Dec-2022 |         6          8 |        14 
  Jan-2023 |         8          5 |        13 
  Feb-2023 |         8          8 |        16 
  Mar-2023 |        10         12 |        22 
  Apr-2023 |        10          7 |        17 
  May-2023 |         4         10 |        14 
  Jun-2023 |         5         14 |        19 
  Jul-2023 |        12         14 |        26 
  Aug-2023 |        10         17 |        27 
  Sep-2023 |         9         17 |        26 
  Oct-2023 |         5         20 |        25 
  Nov-2023 |         6         15 |        21 
  Dec-2023 |         8         16 |        24 
  Jan-2024 |        12         21 |        33 
  Feb-2024 |         6         21 |        27 
  Mar-2024 |         4         26 |        30 
  Apr-2024 |         3         25 |        28 
  May-2024 |         4         25 |        29 
  Jun-2024 |         1         22 |        23 
  Jul-2024 |         2         35 |        37 
  Aug-2024 |         4         21 |        25 
  Sep-2024 |         2         24 |        26 
  Oct-2024 |         0         38 |        38 
  Nov-2024 |         3         33 |        36 
  Dec-2024 |         2         30 |        32 
  Jan-2025 |         0         39 |        39 
  Feb-2025 |         0         37 |        37 
  Mar-2025 |         0         34 |        34 
-----------+----------------------+----------
     Total |       308        733 |     1,041 

. tab mo_year_diagn rtt_ref if rheum_appt!=0 & rtt_ref_date<=rheum_appt_date, missing 

Month/Year |
        of |  rtt_ref
 Diagnosis |         1 |     Total
-----------+-----------+----------
  Aug-2017 |         1 |         1 
  Sep-2017 |         1 |         1 
  Nov-2017 |         1 |         1 
  Feb-2018 |         1 |         1 
  Nov-2020 |         1 |         1 
  May-2023 |         1 |         1 
  Oct-2023 |         1 |         1 
  Feb-2024 |         1 |         1 
  May-2024 |         2 |         2 
  Jul-2024 |         2 |         2 
  Aug-2024 |         1 |         1 
  Sep-2024 |         3 |         3 
  Oct-2024 |         2 |         2 
  Dec-2024 |         2 |         2 
  Jan-2025 |         3 |         3 
  Feb-2025 |         6 |         6 
  Mar-2025 |         3 |         3 
-----------+-----------+----------
     Total |        32 |        32 

. 
. ***From clinical events (Nb. low capture of coded rheumatology referrals in clinical events at present)
. tab rheum_ref_gp_preappt, missing //last rheum referral in the 2 years before rheumatology outpatient (requires rheum a
> ppt to have been present)

rheum_ref_g |
  p_preappt |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,040       99.90       99.90
          1 |          1        0.10      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. tab rheum_ref_gp_preappt if rheum_appt!=0 & rheum_ref_gp_preappt_date<=rheum_appt_date, missing  //last rheum referral 
> in the 2 years before rheumatology outpatient, assuming ref date before rheum appt date (should be accounted for by Pyt
> hon code)

rheum_ref_g |
  p_preappt |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |          1      100.00      100.00
------------+-----------------------------------
      Total |          1      100.00

. tab rheum_ref_gp_precode, missing //last rheum referral in the 2 years before IA code 

rheum_ref_g |
  p_precode |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,034       99.33       99.33
          1 |          7        0.67      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. gen referral_rheum_comb_date = rheum_ref_gp_preappt_date if rheum_ref_gp_preappt_date!=.
(1,040 missing values generated)

. replace referral_rheum_comb_date = rheum_ref_gp_precode_date if rheum_ref_gp_preappt_date==. & rheum_ref_gp_precode_dat
> e!=. //combination of the two above
(6 real changes made)

. format %td referral_rheum_comb_date

. 
. ***From GP appointments (proxy)
. tab last_gp_refrheum, missing //proportion with last GP appointment in 2 years before rheum referral (pre-rheum appt); 
> requires there to have been a rheum referral before a rheum appt

last_gp_ref |
      rheum |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,041      100.00      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. 
. gen last_gp_prerheum_12m=last_gp_prerheum if rheum_appt_date!=. & rheum_appt_date<=(date("$end_date", "DMY")-365)
(962 missing values generated)

. recode last_gp_prerheum_12m .=0
(962 changes made to last_gp_prerheum_12m)

. lab var last_gp_prerheum_12m "GP and rheum appt 12m+"

. lab define last_gp_prerheum_12m 0 "No" 1 "Yes", modify

. lab val last_gp_prerheum_12m last_gp_prerheum_12m

. 
. gen last_gp_prerheum_6m=last_gp_prerheum if rheum_appt_date!=. & rheum_appt_date<=(date("$end_date", "DMY")-180)
(935 missing values generated)

. recode last_gp_prerheum_6m .=0
(935 changes made to last_gp_prerheum_6m)

. lab var last_gp_prerheum_6m "GP and rheum appt 6m+"

. lab define last_gp_prerheum_6m 0 "No" 1 "Yes", modify

. lab val last_gp_prerheum_6m last_gp_prerheum_6m

. 
. tab last_gp_refcode, missing //last GP appointment before rheum ref (pre-EIA code ref); requires there to have been a r
> heum referral before an EIA code (i.e. rheum appt could have been missing)

last_gp_ref |
       code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,040       99.90       99.90
          1 |          1        0.10      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. tab last_gp_prerheum, missing //last GP appointment before rheum appt; requires there to have been a rheum appt before 
> and EIA code

last_gp_pre |
      rheum |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        985       94.62       94.62
          1 |         56        5.38      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. tab last_gp_precode, missing //last GP appointment before EIA code

last_gp_pre |
       code |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        542       52.07       52.07
          1 |        499       47.93      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. 
. ****All appts in the correct order (using clinical events referrals)
. gen all_appts=1 if last_gp_refrheum==1 & rheum_ref_gp_preappt==1 & rheum_appt==1 & (last_gp_refrheum_date<=rheum_ref_gp
> _preappt_date) & (rheum_ref_gp_preappt_date<=rheum_appt_date)
(1,041 missing values generated)

. recode all_appts .=0
(1,041 changes made to all_appts)

. tab all_appts, missing //proportion who had a last gp appt, then rheum ref, then rheum appt

  all_appts |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |      1,041      100.00      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. 
. **Define who qualifies in terms of appointments and referrals ===============================*/
. 
. **AMEND THE BELOW ONCE REFERRAL DATE KNOWN
. 
. **Proportion of patients with at least 6 or 12 months of GP registration after diagnostic code
. rename has_6m_follow_up has_6m_follow_up_s 

. gen has_6m_follow_up=1 if has_6m_follow_up_s=="T"
(935 missing values generated)

. recode has_6m_follow_up .=0
(935 changes made to has_6m_follow_up)

. drop has_6m_follow_up_s

. tab has_6m_follow_up

has_6m_foll |
      ow_up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        935       89.82       89.82
          1 |        106       10.18      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. rename has_12m_follow_up has_12m_follow_up_s 

. gen has_12m_follow_up=1 if has_12m_follow_up_s=="T"
(962 missing values generated)

. recode has_12m_follow_up .=0
(962 changes made to has_12m_follow_up)

. drop has_12m_follow_up_s

. tab has_12m_follow_up 

has_12m_fol |
     low_up |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        962       92.41       92.41
          1 |         79        7.59      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. tab mo_year_diagn has_6m_follow_up

Month/Year |
        of |   has_6m_follow_up
 Diagnosis |         0          1 |     Total
-----------+----------------------+----------
  Apr-2016 |         0          1 |         1 
  May-2016 |         1          1 |         2 
  Jun-2016 |         2          0 |         2 
  Jul-2016 |         1          0 |         1 
  Aug-2016 |         1          0 |         1 
  Sep-2016 |         1          0 |         1 
  Oct-2016 |         1          0 |         1 
  Nov-2016 |         1          1 |         2 
  Dec-2016 |         3          0 |         3 
  Jan-2017 |         0          1 |         1 
  Mar-2017 |         1          0 |         1 
  Apr-2017 |         2          0 |         2 
  May-2017 |         1          1 |         2 
  Jun-2017 |         2          0 |         2 
  Jul-2017 |         2          0 |         2 
  Aug-2017 |         2          1 |         3 
  Sep-2017 |         2          1 |         3 
  Oct-2017 |         2          0 |         2 
  Nov-2017 |         1          1 |         2 
  Dec-2017 |         2          0 |         2 
  Feb-2018 |         2          2 |         4 
  Apr-2018 |         2          0 |         2 
  Jun-2018 |         2          0 |         2 
  Jul-2018 |         4          0 |         4 
  Sep-2018 |         1          1 |         2 
  Oct-2018 |         2          0 |         2 
  Nov-2018 |         2          0 |         2 
  Dec-2018 |         1          0 |         1 
  Jan-2019 |         2          0 |         2 
  Feb-2019 |         3          0 |         3 
  Mar-2019 |         2          0 |         2 
  Apr-2019 |         1          0 |         1 
  May-2019 |         5          0 |         5 
  Jun-2019 |         2          1 |         3 
  Jul-2019 |         3          0 |         3 
  Aug-2019 |         3          0 |         3 
  Sep-2019 |         3          0 |         3 
  Oct-2019 |         4          0 |         4 
  Nov-2019 |         3          0 |         3 
  Dec-2019 |         3          0 |         3 
  Jan-2020 |         1          0 |         1 
  Feb-2020 |         1          0 |         1 
  Apr-2020 |         4          0 |         4 
  May-2020 |         3          0 |         3 
  Jun-2020 |         3          0 |         3 
  Jul-2020 |         4          0 |         4 
  Sep-2020 |         3          0 |         3 
  Oct-2020 |         4          0 |         4 
  Nov-2020 |         7          1 |         8 
  Dec-2020 |         9          0 |         9 
  Jan-2021 |         4          0 |         4 
  Feb-2021 |         8          0 |         8 
  Mar-2021 |         2          0 |         2 
  Apr-2021 |         4          0 |         4 
  May-2021 |         4          0 |         4 
  Jun-2021 |         2          0 |         2 
  Jul-2021 |         6          1 |         7 
  Aug-2021 |         5          1 |         6 
  Sep-2021 |         5          1 |         6 
  Oct-2021 |         4          0 |         4 
  Nov-2021 |         3          0 |         3 
  Dec-2021 |         4          0 |         4 
  Jan-2022 |         3          0 |         3 
  Feb-2022 |        11          0 |        11 
  Mar-2022 |         7          1 |         8 
  Apr-2022 |        11          0 |        11 
  May-2022 |        13          0 |        13 
  Jun-2022 |        10          0 |        10 
  Jul-2022 |        13          0 |        13 
  Aug-2022 |         9          1 |        10 
  Sep-2022 |         9          2 |        11 
  Oct-2022 |        12          2 |        14 
  Nov-2022 |        15          0 |        15 
  Dec-2022 |        12          2 |        14 
  Jan-2023 |        12          1 |        13 
  Feb-2023 |        15          1 |        16 
  Mar-2023 |        20          2 |        22 
  Apr-2023 |        17          0 |        17 
  May-2023 |        11          3 |        14 
  Jun-2023 |        18          1 |        19 
  Jul-2023 |        25          1 |        26 
  Aug-2023 |        26          1 |        27 
  Sep-2023 |        24          2 |        26 
  Oct-2023 |        23          2 |        25 
  Nov-2023 |        19          2 |        21 
  Dec-2023 |        22          2 |        24 
  Jan-2024 |        30          3 |        33 
  Feb-2024 |        23          4 |        27 
  Mar-2024 |        27          3 |        30 
  Apr-2024 |        23          5 |        28 
  May-2024 |        24          5 |        29 
  Jun-2024 |        21          2 |        23 
  Jul-2024 |        34          3 |        37 
  Aug-2024 |        22          3 |        25 
  Sep-2024 |        22          4 |        26 
  Oct-2024 |        37          1 |        38 
  Nov-2024 |        33          3 |        36 
  Dec-2024 |        23          9 |        32 
  Jan-2025 |        33          6 |        39 
  Feb-2025 |        28          9 |        37 
  Mar-2025 |        30          4 |        34 
-----------+----------------------+----------
     Total |       935        106 |     1,041 

. tab mo_year_diagn has_12m_follow_up

Month/Year |
        of |   has_12m_follow_up
 Diagnosis |         0          1 |     Total
-----------+----------------------+----------
  Apr-2016 |         0          1 |         1 
  May-2016 |         1          1 |         2 
  Jun-2016 |         2          0 |         2 
  Jul-2016 |         1          0 |         1 
  Aug-2016 |         1          0 |         1 
  Sep-2016 |         1          0 |         1 
  Oct-2016 |         1          0 |         1 
  Nov-2016 |         1          1 |         2 
  Dec-2016 |         3          0 |         3 
  Jan-2017 |         0          1 |         1 
  Mar-2017 |         1          0 |         1 
  Apr-2017 |         2          0 |         2 
  May-2017 |         1          1 |         2 
  Jun-2017 |         2          0 |         2 
  Jul-2017 |         2          0 |         2 
  Aug-2017 |         2          1 |         3 
  Sep-2017 |         2          1 |         3 
  Oct-2017 |         2          0 |         2 
  Nov-2017 |         1          1 |         2 
  Dec-2017 |         2          0 |         2 
  Feb-2018 |         2          2 |         4 
  Apr-2018 |         2          0 |         2 
  Jun-2018 |         2          0 |         2 
  Jul-2018 |         4          0 |         4 
  Sep-2018 |         1          1 |         2 
  Oct-2018 |         2          0 |         2 
  Nov-2018 |         2          0 |         2 
  Dec-2018 |         1          0 |         1 
  Jan-2019 |         2          0 |         2 
  Feb-2019 |         3          0 |         3 
  Mar-2019 |         2          0 |         2 
  Apr-2019 |         1          0 |         1 
  May-2019 |         5          0 |         5 
  Jun-2019 |         2          1 |         3 
  Jul-2019 |         3          0 |         3 
  Aug-2019 |         3          0 |         3 
  Sep-2019 |         3          0 |         3 
  Oct-2019 |         4          0 |         4 
  Nov-2019 |         3          0 |         3 
  Dec-2019 |         3          0 |         3 
  Jan-2020 |         1          0 |         1 
  Feb-2020 |         1          0 |         1 
  Apr-2020 |         4          0 |         4 
  May-2020 |         3          0 |         3 
  Jun-2020 |         3          0 |         3 
  Jul-2020 |         4          0 |         4 
  Sep-2020 |         3          0 |         3 
  Oct-2020 |         4          0 |         4 
  Nov-2020 |         7          1 |         8 
  Dec-2020 |         9          0 |         9 
  Jan-2021 |         4          0 |         4 
  Feb-2021 |         8          0 |         8 
  Mar-2021 |         2          0 |         2 
  Apr-2021 |         4          0 |         4 
  May-2021 |         4          0 |         4 
  Jun-2021 |         2          0 |         2 
  Jul-2021 |         6          1 |         7 
  Aug-2021 |         5          1 |         6 
  Sep-2021 |         5          1 |         6 
  Oct-2021 |         4          0 |         4 
  Nov-2021 |         3          0 |         3 
  Dec-2021 |         4          0 |         4 
  Jan-2022 |         3          0 |         3 
  Feb-2022 |        11          0 |        11 
  Mar-2022 |         7          1 |         8 
  Apr-2022 |        11          0 |        11 
  May-2022 |        13          0 |        13 
  Jun-2022 |        10          0 |        10 
  Jul-2022 |        13          0 |        13 
  Aug-2022 |         9          1 |        10 
  Sep-2022 |         9          2 |        11 
  Oct-2022 |        12          2 |        14 
  Nov-2022 |        15          0 |        15 
  Dec-2022 |        12          2 |        14 
  Jan-2023 |        12          1 |        13 
  Feb-2023 |        15          1 |        16 
  Mar-2023 |        20          2 |        22 
  Apr-2023 |        17          0 |        17 
  May-2023 |        11          3 |        14 
  Jun-2023 |        18          1 |        19 
  Jul-2023 |        25          1 |        26 
  Aug-2023 |        26          1 |        27 
  Sep-2023 |        24          2 |        26 
  Oct-2023 |        23          2 |        25 
  Nov-2023 |        19          2 |        21 
  Dec-2023 |        22          2 |        24 
  Jan-2024 |        30          3 |        33 
  Feb-2024 |        23          4 |        27 
  Mar-2024 |        27          3 |        30 
  Apr-2024 |        24          4 |        28 
  May-2024 |        24          5 |        29 
  Jun-2024 |        21          2 |        23 
  Jul-2024 |        36          1 |        37 
  Aug-2024 |        22          3 |        25 
  Sep-2024 |        24          2 |        26 
  Oct-2024 |        38          0 |        38 
  Nov-2024 |        35          1 |        36 
  Dec-2024 |        28          4 |        32 
  Jan-2025 |        35          4 |        39 
  Feb-2025 |        36          1 |        37 
  Mar-2025 |        34          0 |        34 
-----------+----------------------+----------
     Total |       962         79 |     1,041 

. 
. *For appt and csDMARD analyses, all patients must have 1) rheum appt 2) GP appt before rheum appt 3) 12m follow-up afte
> r rheum appt 4) 12m of registration after diagnostic code
. gen has_6m_post_appt=1 if rheum_appt_date!=. & rheum_appt_date<=(date("$end_date", "DMY")-180) & has_6m_follow_up==1 & 
> last_gp_prerheum==1
(996 missing values generated)

. recode has_6m_post_appt .=0
(996 changes made to has_6m_post_appt)

. lab var has_6m_post_appt "GP/rheum/registration 6m+"

. lab define has_6m_post_appt 0 "No" 1 "Yes", modify

. lab val has_6m_post_appt has_6m_post_appt

. tab has_6m_post_appt

GP/rheum/re |
 gistration |
        6m+ |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |        996       95.68       95.68
        Yes |         45        4.32      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. 
. gen has_12m_post_appt=1 if rheum_appt_date!=. & rheum_appt_date<=(date("$end_date", "DMY")-365) & has_12m_follow_up==1 
> & last_gp_prerheum==1
(1,012 missing values generated)

. recode has_12m_post_appt .=0
(1,012 changes made to has_12m_post_appt)

. lab var has_12m_post_appt "GP/rheum/registration 12m+"

. lab define has_12m_post_appt 0 "No" 1 "Yes", modify

. lab val has_12m_post_appt has_12m_post_appt

. tab has_12m_post_appt

GP/rheum/re |
 gistration |
       12m+ |      Freq.     Percent        Cum.
------------+-----------------------------------
         No |      1,012       97.21       97.21
        Yes |         29        2.79      100.00
------------+-----------------------------------
      Total |      1,041      100.00

. 
. *Time to rheum referral =============================================*/
. 
. **AMEND THE BELOW ONCE REFERRAL DATE KNOWN
. 
. **Time from last GP appt to rheum ref before rheum appt (i.e. if appts are present and in correct time order)
. gen time_gp_rheum_ref_appt = (rheum_ref_gp_preappt_date - last_gp_refrheum_date) if rheum_ref_gp_preappt_date!=. & last
> _gp_refrheum_date!=. & rheum_appt_date!=. & (rheum_ref_gp_preappt_date>=last_gp_refrheum_date) & (rheum_ref_gp_preappt_
> date<=rheum_appt_date)
(1,041 missing values generated)

. tabstat time_gp_rheum_ref_appt, stats (n mean p50 p25 p75) //all patients (should be same number as all_appts)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~t |         0         .         .         .         .
----------------------------------------------------------------

. 
. gen gp_ref_cat=1 if time_gp_rheum_ref_appt<=3 & time_gp_rheum_ref_appt!=. 
(1,041 missing values generated)

. replace gp_ref_cat=2 if time_gp_rheum_ref_appt>3 & time_gp_rheum_ref_appt<=7 & time_gp_rheum_ref_appt!=. & gp_ref_cat==
> .
(0 real changes made)

. replace gp_ref_cat=3 if time_gp_rheum_ref_appt>7 & time_gp_rheum_ref_appt!=. & gp_ref_cat==.
(0 real changes made)

. lab define gp_ref_cat 1 "Within 3 days" 2 "Between 3-7 days" 3 "More than 7 days", modify

. lab val gp_ref_cat gp_ref_cat

. lab var gp_ref_cat "Time to GP referral"

. tab gp_ref_cat, missing

      Time to GP |
        referral |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               . |      1,041      100.00      100.00
-----------------+-----------------------------------
           Total |      1,041      100.00

. 
. gen gp_ref_3d=1 if time_gp_rheum_ref_appt<=3 & time_gp_rheum_ref_appt!=. 
(1,041 missing values generated)

. replace gp_ref_3d=2 if time_gp_rheum_ref_appt>3 & time_gp_rheum_ref_appt!=.
(0 real changes made)

. lab define gp_ref_3d 1 "Within 3 days" 2 "More than 3 days", modify

. lab val gp_ref_3d gp_ref_3d

. lab var gp_ref_3d "Time to GP referral"

. tab gp_ref_3d, missing

      Time to GP |
        referral |      Freq.     Percent        Cum.
-----------------+-----------------------------------
               . |      1,041      100.00      100.00
-----------------+-----------------------------------
           Total |      1,041      100.00

. 
. **Time from last GP to rheum ref before eia code (sensitivity analysis; includes those with no rheum appt)
. gen time_gp_rheum_ref_code = (rheum_ref_gp_precode_date - last_gp_refcode_date) if rheum_ref_gp_precode_date!=. & last_
> gp_refcode_date!=. & rheum_ref_gp_precode_date>=last_gp_refcode_date & rheum_ref_gp_precode_date<=eia_code_date
(1,040 missing values generated)

. tabstat time_gp_rheum_ref_code, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~e |         1       244       244       244       244
----------------------------------------------------------------

. 
. **Time from last GP to rheum ref (combined - sensitivity analysis; includes those with no rheum appt)
. gen time_gp_rheum_ref_comb = time_gp_rheum_ref_appt 
(1,041 missing values generated)

. replace time_gp_rheum_ref_comb = time_gp_rheum_ref_code if time_gp_rheum_ref_appt==. & time_gp_rheum_ref_code!=.
(1 real change made)

. tabstat time_gp_rheum_ref_comb, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_gp_rh~b |         1       244       244       244       244
----------------------------------------------------------------

. 
. *Time to rheum appointment=============================================*/
. 
. **AMEND THE BELOW ONCE REFERRAL DATE KNOWN
. 
. **Time from last GP pre-rheum appt to first rheum appt (proxy for referral to appt delay)
. gen time_gp_rheum_appt = (rheum_appt_date - last_gp_prerheum_date) if rheum_appt_date!=. & last_gp_prerheum_date!=. & (
> rheum_appt_date>=last_gp_prerheum_date)
(985 missing values generated)

. tabstat time_gp_rheum_appt, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_~m_appt |        56  211.9821       118        52     326.5
----------------------------------------------------------------

. 
. **Time from rheum ref to rheum appt (i.e. if appts are present and in correct order)
. gen time_ref_rheum_appt = (rheum_appt_date - rheum_ref_gp_preappt_date) if rheum_appt_date!=. & rheum_ref_gp_preappt_da
> te!=. & (rheum_ref_gp_preappt_date<=rheum_appt_date)
(1,040 missing values generated)

. tabstat time_ref_rheum_appt, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_ref_r~t |         1        45        45        45        45
----------------------------------------------------------------

. 
. **Time from rheum appt received date to rheum appt (i.e. if appts are present and in correct order)
. gen time_hes_rheum_appt = (rheum_appt_date - rheum_appt_ref_date) if rheum_appt_date!=. & rheum_appt_ref_date!=. & (rhe
> um_appt_ref_date<=rheum_appt_date)
(1,000 missing values generated)

. tabstat time_hes_rheum_appt, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_hes_r~t |        41  302.0732       168       104       340
----------------------------------------------------------------

. 
. **Time from RTT combined ref date to rheum appt (i.e. if appts are present and in correct order)
. gen time_rtt_rheum_appt = (rheum_appt_date - rtt_ref_date) if rheum_appt_date!=. & rtt_ref_date!=. & (rtt_ref_date<=rhe
> um_appt_date)
(1,009 missing values generated)

. tabstat time_rtt_rheum_appt, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_rtt_r~t |        32   259.375       149        46     342.5
----------------------------------------------------------------

. 
. gen gp_appt_cat=1 if time_gp_rheum_appt<=21 & time_gp_rheum_appt!=. 
(1,037 missing values generated)

. replace gp_appt_cat=2 if time_gp_rheum_appt>21 & time_gp_rheum_appt<=42 & time_gp_rheum_appt!=. & gp_appt_cat==.
(6 real changes made)

. replace gp_appt_cat=3 if time_gp_rheum_appt>42 & time_gp_rheum_appt!=. & gp_appt_cat==.
(46 real changes made)

. lab define gp_appt_cat 1 "Within 3 weeks" 2 "Between 3-6 weeks" 3 "More than 6 weeks", modify

. lab val gp_appt_cat gp_appt_cat

. lab var gp_appt_cat "Time to rheumatology assessment, overall"

. tab gp_appt_cat, missing

          Time to |
     rheumatology |
      assessment, |
          overall |      Freq.     Percent        Cum.
------------------+-----------------------------------
   Within 3 weeks |          4        0.38        0.38
Between 3-6 weeks |          6        0.58        0.96
More than 6 weeks |         46        4.42        5.38
                . |        985       94.62      100.00
------------------+-----------------------------------
            Total |      1,041      100.00

. 
end of do-file

. do "C:\Users\Mark\AppData\Local\Temp\STD2bf4_000000.tmp"

. forvalues i = 1/$max_year {
  2.     local start = $base_year + `i' - 1
  3.     local end = `start' + 1
  4.         gen gp_appt_cat_`start'=gp_appt_cat if appt_year==`i'
  5.     lab define gp_appt_cat_`start' 1 "Within 3 weeks" 2 "Between 3-6 weeks" 3 "More than 6 weeks", modify
  6.         lab val gp_appt_cat_`start' gp_appt_cat_`start'
  7.         lab var gp_appt_cat_`start' "Time to rheumatology assessment, Apr `start'-Mar `end'"
  8.         tab gp_appt_cat_`start', missing
  9. }
(1,041 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2016-Mar 2017 |      Freq.     Percent        Cum.
------------------+-----------------------------------
                . |      1,041      100.00      100.00
------------------+-----------------------------------
            Total |      1,041      100.00
(1,037 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2017-Mar 2018 |      Freq.     Percent        Cum.
------------------+-----------------------------------
   Within 3 weeks |          1        0.10        0.10
More than 6 weeks |          3        0.29        0.38
                . |      1,037       99.62      100.00
------------------+-----------------------------------
            Total |      1,041      100.00
(1,039 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2018-Mar 2019 |      Freq.     Percent        Cum.
------------------+-----------------------------------
More than 6 weeks |          2        0.19        0.19
                . |      1,039       99.81      100.00
------------------+-----------------------------------
            Total |      1,041      100.00
(1,040 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2019-Mar 2020 |      Freq.     Percent        Cum.
------------------+-----------------------------------
More than 6 weeks |          1        0.10        0.10
                . |      1,040       99.90      100.00
------------------+-----------------------------------
            Total |      1,041      100.00
(1,040 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2020-Mar 2021 |      Freq.     Percent        Cum.
------------------+-----------------------------------
Between 3-6 weeks |          1        0.10        0.10
                . |      1,040       99.90      100.00
------------------+-----------------------------------
            Total |      1,041      100.00
(1,040 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2021-Mar 2022 |      Freq.     Percent        Cum.
------------------+-----------------------------------
More than 6 weeks |          1        0.10        0.10
                . |      1,040       99.90      100.00
------------------+-----------------------------------
            Total |      1,041      100.00
(1,037 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2022-Mar 2023 |      Freq.     Percent        Cum.
------------------+-----------------------------------
More than 6 weeks |          4        0.38        0.38
                . |      1,037       99.62      100.00
------------------+-----------------------------------
            Total |      1,041      100.00
(1,025 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2023-Mar 2024 |      Freq.     Percent        Cum.
------------------+-----------------------------------
   Within 3 weeks |          1        0.10        0.10
Between 3-6 weeks |          1        0.10        0.19
More than 6 weeks |         14        1.34        1.54
                . |      1,025       98.46      100.00
------------------+-----------------------------------
            Total |      1,041      100.00
(1,014 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2024-Mar 2025 |      Freq.     Percent        Cum.
------------------+-----------------------------------
   Within 3 weeks |          2        0.19        0.19
Between 3-6 weeks |          4        0.38        0.58
More than 6 weeks |         21        2.02        2.59
                . |      1,014       97.41      100.00
------------------+-----------------------------------
            Total |      1,041      100.00

. 
end of do-file

. do "C:\Users\Mark\AppData\Local\Temp\STD2bf4_000000.tmp"

. 
. gen gp_appt_3w=1 if time_gp_rheum_appt<=21 & time_gp_rheum_appt!=. 
(1,037 missing values generated)

. replace gp_appt_3w=2 if time_gp_rheum_appt>21 & time_gp_rheum_appt!=.
(52 real changes made)

. lab define gp_appt_3w 1 "Within 3 weeks" 2 "More than 3 weeks", modify

. lab val gp_appt_3w gp_appt_3w

. lab var gp_appt_3w "Time to rheumatology assessment, overall"

. tab gp_appt_3w, missing

          Time to |
     rheumatology |
      assessment, |
          overall |      Freq.     Percent        Cum.
------------------+-----------------------------------
   Within 3 weeks |          4        0.38        0.38
More than 3 weeks |         52        5.00        5.38
                . |        985       94.62      100.00
------------------+-----------------------------------
            Total |      1,041      100.00

. 
. **AMEND THE BELOW ONCE REFERRAL DATE KNOWN
. 
. gen ref_appt_cat=1 if time_ref_rheum_appt<=21 & time_ref_rheum_appt!=. 
(1,041 missing values generated)

. replace ref_appt_cat=2 if time_ref_rheum_appt>21 & time_ref_rheum_appt<=42 & time_ref_rheum_appt!=. & ref_appt_cat==.
(0 real changes made)

. replace ref_appt_cat=3 if time_ref_rheum_appt>42 & time_ref_rheum_appt!=. & ref_appt_cat==.
(1 real change made)

. lab define ref_appt_cat 1 "Within 3 weeks" 2 "Between 3-6 weeks" 3 "More than 6 weeks", modify

. lab val ref_appt_cat ref_appt_cat

. lab var ref_appt_cat "Time to rheumatology assessment"

. tab ref_appt_cat, missing

          Time to |
     rheumatology |
       assessment |      Freq.     Percent        Cum.
------------------+-----------------------------------
More than 6 weeks |          1        0.10        0.10
                . |      1,040       99.90      100.00
------------------+-----------------------------------
            Total |      1,041      100.00

. 
. forvalues i = 1/$max_year {
  2.     local start = $base_year + `i' - 1
  3.     local end = `start' + 1
  4.         gen ref_appt_cat_`start'=ref_appt_cat if appt_year==`i'
  5.     lab define ref_appt_cat_`start' 1 "Within 3 weeks" 2 "Between 3-6 weeks" 3 "More than 6 weeks", modify
  6.         lab val ref_appt_cat_`start' ref_appt_cat_`start'
  7.         lab var ref_appt_cat_`start' "Time to rheumatology assessment, Apr `start'-Mar `end'"
  8.         tab ref_appt_cat_`start', missing
  9. }
(1,041 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2016-Mar 2017 |      Freq.     Percent        Cum.
------------------+-----------------------------------
                . |      1,041      100.00      100.00
------------------+-----------------------------------
            Total |      1,041      100.00
(1,041 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2017-Mar 2018 |      Freq.     Percent        Cum.
------------------+-----------------------------------
                . |      1,041      100.00      100.00
------------------+-----------------------------------
            Total |      1,041      100.00
(1,041 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2018-Mar 2019 |      Freq.     Percent        Cum.
------------------+-----------------------------------
                . |      1,041      100.00      100.00
------------------+-----------------------------------
            Total |      1,041      100.00
(1,041 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2019-Mar 2020 |      Freq.     Percent        Cum.
------------------+-----------------------------------
                . |      1,041      100.00      100.00
------------------+-----------------------------------
            Total |      1,041      100.00
(1,041 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2020-Mar 2021 |      Freq.     Percent        Cum.
------------------+-----------------------------------
                . |      1,041      100.00      100.00
------------------+-----------------------------------
            Total |      1,041      100.00
(1,041 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2021-Mar 2022 |      Freq.     Percent        Cum.
------------------+-----------------------------------
                . |      1,041      100.00      100.00
------------------+-----------------------------------
            Total |      1,041      100.00
(1,041 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2022-Mar 2023 |      Freq.     Percent        Cum.
------------------+-----------------------------------
                . |      1,041      100.00      100.00
------------------+-----------------------------------
            Total |      1,041      100.00
(1,041 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2023-Mar 2024 |      Freq.     Percent        Cum.
------------------+-----------------------------------
                . |      1,041      100.00      100.00
------------------+-----------------------------------
            Total |      1,041      100.00
(1,040 missing values generated)

          Time to |
     rheumatology |
  assessment, Apr |
    2024-Mar 2025 |      Freq.     Percent        Cum.
------------------+-----------------------------------
More than 6 weeks |          1        0.10        0.10
                . |      1,040       99.90      100.00
------------------+-----------------------------------
            Total |      1,041      100.00

. 
end of do-file

. do "C:\Users\Mark\AppData\Local\Temp\STD2bf4_000000.tmp"

. **Time from RTT closed ref date to rheum appt (i.e. if appts are present and in correct order)
. gen time_rtt_cl_rheum_appt = (rheum_appt_date - rtt_cl_ref_date) if rheum_appt_date!=. & rtt_cl_ref_date!=. & (rtt_cl_r
> ef_date<=rheum_appt_date)
(1,017 missing values generated)

. tabstat time_cl_rtt_rheum_appt, stats (n mean p50 p25 p75)
variable time_cl_rtt_rheum_appt not found
r(111);

end of do-file

r(111);

. do "C:\Users\Mark\AppData\Local\Temp\STD2bf4_000000.tmp"

. tabstat time_rtt_cl_rheum_appt, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_rtt_c~t |        24   301.125     165.5        66       422
----------------------------------------------------------------

. 
end of do-file

. do "C:\Users\Mark\AppData\Local\Temp\STD2bf4_000000.tmp"

. gen time_rtt_op_rheum_appt = (rheum_appt_date - rtt_op_ref_date) if rheum_appt_date!=. & rtt_op_ref_date!=. & (rtt_op_r
> ef_date<=rheum_appt_date)
(1,010 missing values generated)

. tabstat time_rtt_op_rheum_appt, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_rtt_o~t |        31  280.8065       214        85       369
----------------------------------------------------------------

. 
end of do-file

. do "C:\Users\Mark\AppData\Local\Temp\STD2bf4_000000.tmp"

. tabstat time_rtt_rheum_appt, stats (n mean p50 p25 p75)

    Variable |         N      Mean       p50       p25       p75
-------------+--------------------------------------------------
time_rtt_r~t |        32   259.375       149        46     342.5
----------------------------------------------------------------

. 
end of do-file

. exit, clear
